[{"title":"情书","date":"2017-03-05T16:20:11.000Z","path":"2017/03/06/情书/","text":"真的很惭愧，直到现在才完整看完这部电影。 大学时代曾看过一点，只是没看下去。毕业后，偶然有个人谈论电影这个话题，他一定对这个电影非常喜爱，所以介绍起这个电影起来滔滔不绝。如今，我是在top250里再看到这个标签，才重新拾起。 微博上曾有过某中学发现学长藏在墙壁里的情书，火极一时。大家纷纷要找到那情书所说女主，找到后，女主表示都过去多少年了，早就忘记了。 我们欣赏那种美好，向往那种美好，尤其是暗藏的，更加稀有。因为我们都有过。这个电影表现出了那种美好，无论是景物、人物、所有的一切，它本该美好，又讲的是这种人人都经历过的美好的故事。足以载入影史。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记2【我不相信】","date":"2017-03-05T12:48:28.000Z","path":"2017/03/05/周记2【我不相信】/","text":"这周主要是工作上的问题，还有就是个人也有了一些问题，结果就是有点糟糕。 同桌走了去年来的实习生，坐我旁边的。周一突然说家里叫他回家，他女朋友也回去了，于是他也就要回家发展了。真是突然呢！ 工作困扰工作上呢，我主要问题就是业务理解能力不足，也没有技术架构能力。结果呢，有些问题我就无法彻底且妥善地解决。最后也就只有跟上级沟通，搞一些暂时做法。 优秀同事我有一个非常优秀的同事，就是那种大学里是学霸的那种。他业务能力很强，工作极其认真。有时候就感觉我跟人家有差距，有些不服气。换个角度，这其实也是提升自己的一个榜样，多跟人家交流，紧跟人家步伐，这样的话自己差不多也会变得更优秀吧。 驾考这种自己的事一定要自己积极一些，要不然，考试的人那么多，排队排到黄花菜都凉了。 关于读书这两周，确实读了挺多书。但是呢，都是杂书，我想以此为引子锻炼一下状态，接下来开始真正的学习。所以接下来就是读专业书，专业学习为主了。还有读书的方法，不同的书应该有不同的读法。小说就通读一遍，结论性的书应该做记录笔记。 效率意志我发现上周这方面还挺好的，这周明显有下滑。主观认为这跟我三分钟热度的性格有一定关系，凡事没能坚持多久，去年就是这样。容易心有杂念，就坚持不下去了。周末更是，干脆一整天都在刷直播。完了又开始懊悔，进而产生极大的负能量。这种情况周而复始，人就被拖垮了。关于效率和意志，真的要找办法好好治治了，要不然就如上瘾一样，一点点蚕食，最后人生就这样虚度了。这是下周首要需要解决的课题，目前只想到读一些诗或许能缓解一些。 北岛的诗，作为结语。 告诉你吧，世界 我–不–相–信！ 纵使你脚下有一千名挑战者， 那就把我算作第一千零一名。 我不相信天是蓝的 我不相信雷的回声 我不相信梦是假的 我不相信死无报应 如果海洋注定要决堤， 就让所有的苦水都注入我心中 如果陆地注定要上升， 就让人类重新选择生存的峰顶。 新的转机和闪闪星斗， 正在缀满没有遮拦的天空 那是五千年的象形文字， 那是未来人们凝视的眼睛 。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"恶意","date":"2017-03-04T13:22:17.000Z","path":"2017/03/04/恶意/","text":"本来不打算再写一篇的，因为相较于嫌疑人、白夜行还是有差距的。但是可能接下来不会再读东野的书了，就对东野圭吾做个总结吧。 最初只看过电影嫌疑人x的献身，当时震撼挺大的。后来一个同学对嫌疑人的电影的评价，让我回忆起这个故事，于是买来实体书来看了。迅速读完，只是对于已知的故事，震撼没那么强烈了。 后来恰巧有 kindle 购书券，就一下买了解忧杂货店以及白夜行。先读的白夜行，是在一个假期读的，读完我就认定这本是我当年度读的最好的书了。就像评语说的，《白夜行》中的爱情极度炽烈，令人粉身碎骨。我认为则是，读完之后有种貌似读完的感觉，好像什么都没太说清楚，但其实已经说清楚了，给人以莫大惆怅感的结局。甚至需要一些时间来平复这种震撼的心情。 解忧杂货店，可能阅历不够，读不出太深层次的意思。 今天又读了一本东野早期作品，就是这部《恶意》。相较于《白夜行》、《嫌疑人》差了些，读完也没什么想说的。 对于作者东野圭吾，引用一段我也生以为然的评语作为评价。 后期笔锋越发老辣，文字鲜加雕琢，叙述简练凶狠，情节跌宕诡异，故事架构几至匪夷所思的地步，擅长从极不合理之处写出及其合理的故事，功力之深令人瞠目骇然。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"向前一步","date":"2017-03-03T12:54:37.000Z","path":"2017/03/03/向前一步/","text":"作者是 Facebook COO（首席运营官），1969年生，成功女性。 才意识到这类讲观点和经验的书是要做读书笔记的，不然看完差不多也忘完了。好在中途也开始了一些摘录。 不自信时，假装自信。 征求他人的建议有助于人际关系的建立。 分享自己的情绪，有助于建立更深层次的人际关系。（深表同感） 如果一个等着别人来告诉你应该做什么，就不可能成为领导别人的人。 只谈公事并不总是最佳的工作方式，将工作和生活完全分离就没什么意义了。不要害怕工作时谈起家里的私事。（又上了一课） 真正的领导力来自真诚的表现，以及不太完美的个性。 一个人对自己的工作越满意，就越不可能辞职。 如果你想要一位能平等相处的伴侣，那么从一开始就要建立平等的关系。（有用） 我们创建的家庭模式其实根植于童年的记忆。 完成，胜过完美。（作者座右铭，也对我启发很大） Facebook初创时期，天天晚上黑客长跑大赛。扎克伯格本人是个夜猫子，难怪有人说他睡觉都在编程。 成功是为自己做出最好的选择，并且接受它们。（独到的见解） 准时下班回家是件很重要的事。（有启发）","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"富爸爸穷爸爸","date":"2017-02-28T17:42:56.000Z","path":"2017/03/01/富爸爸穷爸爸/","text":"一本颠覆思想的财物启蒙书。对于一个小白来说，书中提到的很多观点是具有颠覆性的。以下仅记录我从中领悟到的。 努力学习，找一份工资高的工作，努力工作。这种模式犹如老鼠赛跑，很难从中跳出。不能为钱而工作。 理解资产和负债。增加资产，减少负债。按揭买房是一大负债。分期付款、信用卡都是。 除了职业，还应拥有事业。事业是资产项，资产产生收入。 财商包含会计、投资、市场观察力、法律知识。 投资自己的头脑，不应只了解一个专业技能，不断学习新东西。克服懒惰，自律。 这本书算是启蒙书，给你提供一种新思路。并且年龄越小的孩子读这本书收益越大。大人读由于丧失一些优势或者固有观念难以改变效果大打折扣。 仍然有一些指导性的东西。比如对于现阶段的我，应该怎么做呢。首先需要攒一笔资金，这需要适当的消费观念。同时学习财务方面的专业知识，再开始投资。再然后，不断用钱赚钱，开公司，实现财务自由。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"影视书（2017）","date":"2017-02-26T14:59:12.000Z","path":"2017/02/26/影视书（2017）/","text":"电影 序号 片名 上映时期 豆瓣得分 影评 1 勇敢的心 1995 8.8 95年的水平，相当震撼了。以及对于苏英战争欧洲史的一点开荒。 2 七月与安生 2016 7.6 实话说，有点强。周冬雨演技爆表了。 3 星球大战外传：侠盗一号 2017 7.4 这电影看的，全程一半在睡觉。如无装逼需求，弃坑。 4 西游伏妖篇 2017 5.8 春节档的商业片，经典的配乐还能唤得起多少情怀 5 面纱 2006 8.2 06年西方人到中国拍的电影。吕燕真是丑的可以，西方人反以为美？当爱与责任合二为一，恩典便与你同在！结局也是现实中正确的结局。 6 奇迹 2011 8.6 看完小说再看电影，总觉得哪里不够。文字传达的东西比影视信息量大吧。 7 阿甘正传 1994 9.4 人生是由命运和偶然共同构成的。影评 8 比利林恩的中场战事 2016 8.5 没经历过战争，无法理解他们。比利数度落泪，为自己也为他的宿命。影评 9 步履不停 2008 8.8 关于家庭、关于生死，淡淡的、安静的、细腻的体会感知。多珍惜与亲人在一起的时光… 10 如父如子 2013 8.3 怎样为父，未来的课题。我还是喜欢这样的讲好故事的是枝裕和。 11 情书 1995 8.8 揭秘暗恋。影评 12 言叶之庭 2013 8.2 快去看豆瓣有用最高的长评论，笑疯！ 书籍 序号 书名 豆瓣得分 书评 1 你一定爱读的极简欧洲史 8.3 从另一个维度解读欧洲史，但也多是对中学历史知识的一点回顾。书评 2 奇迹 7.7 最初怀着美好的愿望制定目标，阻挠总会如期而至。但要相信，当你达成目标而收获的绝不仅仅是当初的那点愿望了，会有很多很多收获！致敬那些为目标百折不挠奋斗的人儿吧，因为那才是真正的勇者！书评 3 国境以南太阳以西 8.4 文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。书评 4 追风筝的人 8.8 无愧为文学的经典之作，大学图书馆里借阅榜榜首。一份愧疚，一场救赎，一丝悲悯。书评 5 皮囊 7.8 这是一本凑出来的书，写家人可以打9分，写家乡让我想到草房子，写朋友就真的是过目就忘了。总的来说，及格以上，上乘不达，比刘同强。书评 6 富爸爸穷爸爸 8.2 提到的很多观念对于一个完全没有财商的小白具有颠覆性，不错的启蒙书。说从中学到具体的知识，还是没有的。书评 7 向前一步 8.1 虽然主要是讲女性职业发展和女权的，但还是从中学习到一些关于职业职场的有效方法。书评 8 恶意 8.4 天王套装第四本。开头和结尾精彩，手记体写法也很惊艳。过于注重推理和技巧使得真实感不强烈。关于主题所说的那种恨意体会不来。书评","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记1【完不成的目标】","date":"2017-02-26T09:53:05.000Z","path":"2017/02/26/周记1【完不成的目标】/","text":"日记太繁琐，周记则恰好。记录一周思考，这是第一篇，还是说一下（笑）。 制定计划开始只是有一个大目标，没做具体的细化。直到看到了一个极度自律的人写的一篇血泪日记，为了完成每日目标，半夜也要完成。就开始细化每日目标了。使用贴纸写下月度计划，每天晚上回来再日记本上写下日计划。算是开了头。 估算时间计划写得太满，导致完不成。因此，制定计划时，准确预估完成所需时间格外重要。 安排顺序有时候顺序不对，就完全打乱了一系列计划，制定计划和实施时需要随机调整，以免某个时间段无法完成特定任务而打乱一切。比如，跑步不能安排在吃饭后吧。 调整作息规律过去一周这个问题是最大的问题。现在已经昼夜颠倒了，怎样在指定的时间睡觉，已经成了困扰我的问题。希望下周能调整一些。 心事打断我想我错了。春节回家被家人灌输了一定要找对象的观念，导致我真的以为我需要找对象了。回来为此苦恼很久，怎么找对象困扰了我。后来我终于想起了之前看到的一些文字，在拥有爱的爱的能力之前，找什么对象。我想也是，当我拥有除了照顾好自己还能照顾另一个人的时候，我再考虑找对象的事吧。 迷茫了就去读书一切迷茫，不知所措，都是因为知道的太少而想的太多。多读书，广泛读书，总会找到适合你的那本，打动你，给你方向的书。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"少年锦衣卫","date":"2017-02-26T09:09:32.000Z","path":"2017/02/26/少年锦衣卫/","text":"三维动漫，比不良人还要用心啊，剧情目前看起来也挺好啊，没有不良人略显狗血的拖沓啊。已经超越不良人了，建模真是美哭，国漫新扛把子。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"皮囊","date":"2017-02-26T07:58:14.000Z","path":"2017/02/26/皮囊/","text":"每个读者只能读到已然存在于他内心的东西。书籍只不过是一种光学仪器，帮助读者发现自己的内心。 不可否认，这是今年读到的第一本触动我的书，或者说感受到的共鸣更多。这本书也有很大的毛病，后面的内容水平直线下降，甚至看到后面我联想到了刘同。刘同的书借用一个网友的评论就是“妈妈给的零花钱又被骗了”这种感觉。虽然有毛病，但是这本书还是值得看的，哪怕你只看一半也可以。 首先刺痛我的是，作者嘲讽那些在大城市打拼，跟老家的人产生了隔阂，已经回不去了的那些人。说他们是无家可回孤魂野鬼，庆幸自己还有家。然后作者着力想表达的是，我们这代人，从小镇到县城到地级市到大城市，慢慢的失去了家。呼吁我们小镇才是生我们养我们构成我们的家。作者最后说，我们都是既离开了家，又无法到达的人。我想，我们这代人是城市化进程的结果，城市化也是构成我们的一部分。我们想回到过去，谁不想呢，这也是无奈的事情。也许家里的事情于我们已变陌生，但我们终归还是拥有家人、亲戚，只要我们时常回去走走，即便是在陌生的城市，也不一定就是失去了家。 当作者写到闽南的乡土情怀时，我联想到了曹文轩的盐城农村，蒲松龄的山东，透过文字传达的家乡记忆，也足以令人动容。比如，作者说他们那拨人是晋朝时迁过去的，至今还保留着很多风俗，封建理想也根深蒂固。瞬间觉得自己这种明代山西迁往淮河流域的人，流传下来的文明简单的可怜。 作者由于家庭原因（父亲中风），早早担负起一家之主的责任，在大学时代就成熟老道地规划好了自己的人生。读到这里，令我汗颜，想到自己直到大学毕业依然迷茫不堪，没有任何规划。不得不感叹家庭对于塑造子女影响巨大。当然，健康家庭出身的孩子也相对来说更比较不会有心理创伤，谁又能说哪样的结果更好呢。 最令我感动还是作者描写的关于阿太，母亲，父亲，他的家人。这也是全书的精华，一个艰难家庭更容易催生出坚固的亲情，当然这也是人为努力的结果。毫无疑问，作者笔下的母亲是一位伟大的母亲。关于后半部分写到朋友、发小等，批评的人批评过了。我觉得这还是跟作者有关系，急于成名了，内容难免良莠不齐，或许这也跟作者心理创伤有关。现代大部分人都多少有心理问题。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"比利林恩的中场战事","date":"2017-02-24T15:11:16.000Z","path":"2017/02/24/比利林恩的中场战事/","text":"一部描述美国真正的参战士兵心境的电影。 在美国，有很多参战过的士兵，患有跟战争有关的心里疾病，称为战争后遗症，没参与过战争的人无法理解。 比利林恩数次落泪，因为他通过短暂的中场休息，看清了自己和这个国家的本质，看清了人们无法理解自己，看清了宿命。透过他的视角，是否能让人们能反思战争。 附上片尾音乐。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"追风筝的人","date":"2017-02-24T14:17:18.000Z","path":"2017/02/24/追风筝的人/","text":"经典无愧为经典。 早在我大学时代，这本书长期是学校图书馆里借阅榜第一。去年在朋友圈里看到一个朋友发的出自书中的一句话。 我看见镶木板的墙上挂着照片，照片中的人都将成为我的亲人。 配文：阿米尔到索拉雅家中提亲。那时我便将书购来，拖了很久，终于看完。 之所以没能一气呵成读完，我认为是这样的原因。前面部分描述的一直是安静祥和的小孩之间的真挚友谊，虽然处处预示着将会发生悲惨的事情，但着实是陌生的另一个国家的事情，难免让人感到晦涩、不理解。直到某次乘车途中，读到了发生的那件惨事，一发不可收拾读到大半。再后来，当我把此书列入计划中，方才读完剩下的部分。最后一部分，本来看得我觉得这书可能也就中上水平了，没有传说的那么神，但是后面纷至沓来的一波高潮，改变了我的看法，这本书是实至名归的上上之作。 我庆幸自己有足够的理解能力，能读到书中想表达的东西之一，人性。 没有良知、没有美德的人不会痛苦。 我想我们普通人都是有良知、崇尚美德的人。我们想努力弥补的都是我们愧疚的东西。诚然，有的人面对愧疚，选择逃避。但是，这种人内心深处是有创伤的，他/她们的灵魂是不完整的，当他/她们遭遇不幸，他/她们是容易怀疑人生的。敢于弥补愧疚的人都是勇敢的人，当他/她们完成赎罪，伤口会自愈、灵魂会完整，也便活出了人生的最高境界。 而是对生活曾有过的黑暗忍气吞声的照单全收。 哈桑、索拉博、无数承受战火的阿富汗人，作者还表达了悲悯。哈桑忍受着一切，哈桑依然是那个深爱着阿米尔的哈桑，就像他热爱生活一样。当你经历过地狱，并且从那里走出来，你将无所畏惧。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"阿甘正传","date":"2017-02-22T14:37:36.000Z","path":"2017/02/22/阿甘正传/","text":"印象中这是一部励志电影。 以我粗浅的阅历来看，美国的励志电影中的励志跟我们印象中的励志是不一样的。通常关于刻苦、努力啊基本不说，说的多的往往是运气或者天赋。这类电影通常更多的是探讨生命的意义，你要说它是励志电影真的是不走心。这是一部探讨残障人士的生命的意义的电影。 电影中有一段台词可以作为点睛之笔，摘录如下。 是否我们每个人 都有注定的命运 还是我们的生命中只有偶然 像在风中飘 但我想 也许两者都有吧 也许两者都同时发生着 我们每个人都有着好的或者不好的命运，但人生仅仅是这样吗？不是啊，还有偶然，就像那片随风漂浮的羽毛，时而扬起，时而下落，最终还会落地。我们能做的只是在风雨中承受着这一切，就像詹妮像鸟一样飘零、中尉在飓风中咆哮、羽毛飞舞…","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"国境以南太阳以西","date":"2017-02-20T14:26:18.000Z","path":"2017/02/20/国境以南太阳以西/","text":"文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。 借由其中一首歌在网易云音乐上的热评剧透作为读后记吧。 结尾泉的出现更让我觉得岛本或许真的就不存在。从国境以南来，到太阳以西去，可能岛本只是初一厢情愿的幻象吧。不得不说，初活出了大部分人的理想，有一个带你尽人事尝甘涩的初恋，有一个陪你立黄昏问你粥可温的爱人，有一次让你甘愿放弃一切的精神出轨，有一次回到现实却无奈下半身的肉体出轨。 附上书中反复提及的钢琴三重奏。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"半世伶俜空自许","date":"2017-02-19T13:15:39.000Z","path":"2017/02/19/半世伶俜空自许/","text":"读史使人明智，读诗使人灵秀，数学使人周密，科学使人深刻，伦理学使人庄重，逻辑修辞使人善辩，凡有所学，皆成性格。–培根 查阅寒伧（chen，同寒碜）时，相关词汇给到了伶俜（líng pīng），查伶俜看到了一首诗。 冰骨云绡雪数枝，清幽香冷与尘离。 深山有韵风摇影，古涧无人月弄姿。 半世伶俜空自许，一生风雨却谁知。 都言此萼非凡数，谁道花中最是痴。 这不是一首古诗，而是一位小才女写的诗。多好的诗啊。","tags":[{"name":"诗歌","slug":"诗歌","permalink":"https://amasawaseiji.github.io/tags/诗歌/"}]},{"title":"桃栗三年柿八年","date":"2017-02-19T06:43:14.000Z","path":"2017/02/19/桃栗三年柿八年/","text":"是枝裕和的风格就是讲述平凡的、淡淡的生活，讲述生活的本质。这个故事与电影海街日记一样充满温情。 小学生集体大出逃，7人和一只死了的狗，开始了一段冒险之旅，为了在新干线列车交错的地方许下愿望，让奇迹发生。 这是一个儿童题材的故事，火山灰、波斯菊、燃放的烟花、种子、生活中的一切事物，你喜欢也罢，不喜欢也罢，你通通要接受。生活也是一样，你也必须接受。 也许所谓的奇迹只是需要发泄而已。学会接受讨厌的事物，就是成长。 桃栗三年柿八年，达摩九年我一生。 书中出现的一句台词，原来是一句日本诗。人生需要时间的积累，才会开花结果。 小说是根据电影剧本写出来的，而电影是为了纪念九州新干线全线通车所拍的广告。你不得不佩服这位导演，一个广告电影，一个命题作文，选择了这样的题材，拍出了这样的作品，除了赞叹还能说什么呢。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"极简欧洲史","date":"2017-02-17T14:55:42.000Z","path":"2017/02/17/极简欧洲史/","text":"销量高不一定就好，充其量是对中学世界史的一点回顾。 副标题为为什么欧洲文明对现代文明影响这么深？我来回答一下这个问题。 因为欧洲工业革命，因为大航海，因为殖民。为什么欧洲能近代能够先崛起？因为科学的发展。为什么欧洲人能发明科学？因为欧洲古代有牛人，然后出现了文艺复兴。 这本书单只讨论了近代欧洲文明为什么能超越亚洲文明。给出的解释是：欧洲多国林立，强敌环饲，所以向海上扩张。王权为打压贵族，倚重商贾与科技。中欧一直小国并存，人才可以充分发挥才能，为文艺复兴打下基础。 从另外一角度讨论，中国历代关于科学的著述，偏向于经验总结。而欧洲则是科学方法论，欧洲有逻辑体系和实验方法2个方法论，这才是欧洲可以爆炸性增长的原因。 我们都知道古希腊罗马，罗马的灭亡是因为日耳曼蛮族入侵。蛮族在侵占的土地定居下来，罗马皇帝无地可辖所以才灭亡。所谓中世纪指西罗马帝国灭亡之后的一千年，日耳曼人建立国家，加入基督教，欧洲多国林立。 第二次入侵来自穆斯林，占领欧洲东部，跨越地中海控制到南欧的西班牙。所谓十字军东征即是征讨穆斯林，夺回圣地耶路撒冷。耶路撒冷是基督教发源的地方。 第三次入侵是来自北欧的维京人，维京人使用长船沿河掠夺，后来也定居下来。 英国原住民叫凯尔特人，日耳曼人、维京人入侵之后，才形成英语。 法国是由法兰克王国一分为三后才形成的。而另一支德国却很晚才统一。原因是教皇跟皇帝的争斗导致很分裂。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"马云山教练","date":"2017-02-17T14:36:54.000Z","path":"2017/02/17/马云山教练/","text":"又历时2天，终于可以写点了。这个主题不错吧！当然我没有功夫去学自己打造主题（摊手）。来不及了，车已经出发了。 马教练56岁，做教练20多年。很是健谈、做事麻利、头脑灵光、视野广阔、照顾后辈，当然这个年龄的人一般都会照顾后辈。 再谈公职人员态度。一个跟年期大妈一般态度恶劣，还是年轻好，对，年轻的好！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"侧耳倾听","date":"2016-05-06T15:54:04.000Z","path":"2016/05/06/侧耳倾听/","text":"世界上有两种人，一种是喜欢宫崎骏的人，另一种是不知道宫崎骏的人。 偶然翻阅别人博客，看到有讲到久石让in武道馆的演奏会，据说很震撼，于是去看了下。果然，1200人的演奏团，各种乐器眼花缭乱，据说是世界上最大的音乐会。 完了又去看了映像宫崎骏的介绍,又稍稍加深了对宫崎骏动画的认识。之前看了很多部，除了看完之后很震撼，其实是没看懂。也去翻阅豆瓣评论，试图找找这些电影都讲得什么涵义，不过一时难以体会。 侧耳倾听最早了解宫崎骏都是在各种碎片信息中，就知道有这么个动画大师，由于愚昧无知的原因，觉得动画片是不是有点low，就没有去看了。直到后来有个同学在QQ空间说看了千与千寻感动的不要不要的，才有意识的想去也看看。 再后来关注豆瓣之后，有个妹子在那讲失恋后，每次觉得坚持不下去了，就去看侧耳倾听，就会重新充满力量。我就去看了，第一次看了3遍。第一印象就是白活这么大了，要是早一点看到这个电影的话，也许没有后来的种种的幼稚。然后我就被颠覆了。 侧耳倾听讲单纯的初恋，互相的鼓励和成长。要是早点看到，就知道原来喜欢一个人可以一起成长的嘛。初中的月岛雯问她姐姐自己的前途，高中的天泽圣司是个会制作小提琴的高手，却说像我这样的水准到处都是，梦想成为工匠大师。月岛雯哭着说，你们走的太快，我跟不上。全片充满治愈，各种感动。看完之后就觉得自己通透了，有些东西想的明白了，这也是这个电影于我的意义。 宫崎骏电影一发不可收拾的继续看下去。风之谷的娜乌西卡人与自然、战争与和平。幽灵公主人与神。龙猫5岁小孩必看。哈尔的移动城堡、千与千寻10岁女孩看得，奥斯卡获奖的。天空之城经典纯音乐的出处。大概就是心灵得到了净化，祛除了很多戾气。变了，变得跟以前不一样了。当然这些电影不只是给小孩子看得，因为主人公实质上都是过得是成人生活，她们独立勇敢而又善良，努力热爱生活，能领略到的。 当厌倦了生活，感觉坚持不下去了，不妨看看宫崎骏，满满的治愈。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"春秋战国：一段你应了解的历史【春秋篇】","date":"2016-05-04T15:16:32.000Z","path":"2016/05/04/春秋战国：一段你应了解的历史【春秋篇】/","text":"春秋有几霸春秋五霸有不同的说法，三种主流的说法涉及人物有八个人，读完春秋史我觉得真正名副其实只有3个人。齐桓公 晋文公 和 楚庄王。 小霸郑庄公平王东迁开始首先有所作为的是郑庄公。郑庄公是个能人，先是打败他妈喜欢的他弟弟郑段，军事外交内政用人能力都很强。以至于可以欺负卫国 宋国 等实力相当的国家。军事上发明鱼丽阵，擅长使用谋略，比如伏击等不合周朝军礼的手段。最牛逼的作为就是打败周天子的王师，对历史进程影响很大。死后子辈争位，郑国渐渐威势渐失，郑国后来沦落为二流国家。并没有称霸之实，只是使郑国成为中原诸国中最强的一国。 首霸齐桓公齐桓公吕小白确有称霸之实。而且使用的方法是尊王攘夷，使用道德感化的方式让各国心服口服，情愿尊齐国为领袖。吕小白线索里最重要的莫过于管仲，管仲是个神人各方面才能都很优秀。带领齐国改革，富国强兵。吕小白能耐不大，从他晚年不是英雄的惨死就看的出来，但是他从谏如流，恢弘的气度，不是常人可比。在位期间使齐国国土面积扩大，亲身两次北上攻打蛮夷，深入不毛，九死一生。并且把打下的蛮荒之地转手送给了当时弱小的燕国。这也是为什么燕国后来可以跻身战国七雄的重要原因。谥号桓，伟大的君主。晚年没了管仲他竟然被儿子饿死。死后诸子争位，齐国内乱，从霸主地位跌落下来，但仍然不失为一流国家。 虚名霸主宋襄公宋襄公纯熟扯淡的虚名霸主。宋襄公的偶像是齐桓公，所以就做了一个满口仁义道德的君子。只会仁义道德没有强大的国力或者过人的能力是不可能做到齐桓公那样的。打仗败给楚国，搞会盟想做老大还被楚国人抓了。他有个弟弟宋目夷倒是有点能耐的，多次在关键时刻提出正确的想法，但宋襄公一心要做君子，不采纳。所以宋国始终就是二三流的水平。 传奇霸主晋文公晋文公重耳是个传奇霸主。他老爸晋献公是个猛人，一生灭国18。重耳因为骊姬乱政的原因逃亡国外，一逃就是19年，流亡各国，受尽磨难。始终跟随他逃亡的7个人当中有后来赵国的先祖，魏国的先祖。还有寒食节纪念的人介子推。这场逃亡是个传奇，更是奇迹。后来终于在秦穆公的帮助下回国当国君。再后来在城濮之战退避三舍打败楚国，一跃成为执天下牛耳的超级大国。真正意义上的称霸。但后来晋国公族大权旁落，被六卿架空，最终分裂成三晋。重耳本人就是个牛人，人格魅力很大，才会有那么多人帮助他。重耳之后直到三家分晋晋国都是与楚国并列的超级大国。 楚庄王一鸣惊人楚庄王熊侣。楚国是蛮夷之国，所以敢称王。因为在南方的广袤土地上当时并不开化，国土面积越打越大，不遵守周礼所以随意攻灭小国。楚庄王上台之初楚国奸臣当道，所以他把自己伪装起来，伪装成一个不理朝政的昏君来看清谁是忠臣谁是奸臣。终于三年之后一鸣惊人，任用贤良打击奸臣。整肃内政。任用孙叔敖等人，在重耳死去之后与晋国的邲之战打败晋国，使楚国成为与晋国相当的超级大国。 西戎霸主秦穆公秦穆公嬴任好。嬴任好求贤若渴，用5张羊皮得到百里奚。百里奚又推荐蹇叔。秦国在西部边陲待腻歪了就想争霸中原。首先就是挡住东出之路的晋国，于是嬴任好就想通过控制晋国，好借路东出。后来才有了他护送重耳归国的事情。但是重耳不是池中之物。晋国强大了，秦国没有半点好处。后来晋秦合围郑国，就有了我们以前学过的烛之武退秦师这篇文章。再后来嬴任好打算飞夺郑国，一意孤行，1万人被翻脸的晋国在崤之战全歼。嬴任好东进不成，之好去打西戎，被周王封为西戎霸主。算不上真正的霸主。 吴王阖闾吴王阖闾吴光。吴国，一闪而逝的春秋巨星。晋国是吴国的同盟，派人教吴人中原先进的技术，让吴人骚扰楚国。吴光得到伍子胥的帮助，派遣专诸刺僚，通过政变的方式当上吴王。又有孙武的帮助富国强兵，吴光本人也勤俭节约。后来终于征集3万人打入楚国本土，柏举之战3万打20万大胜楚军，攻入楚都郢城，声震天下。楚国反扑才退兵。此后吴国修养生息，直到夫差上位打败越国，又开始北上争雄，后来黄池会盟达到可以与晋国平起平坐，但此时越国已经偷袭吴国，吴国就在此后数年灭亡。吴国虽然闪耀一时，但是却又瞬间灭亡，也算不上霸主之实。 越王勾践越王勾践。勾践早有范蠡和文种辅佐，但是越王不听劝谏，终于引来兵败被围。又因为有范蠡和文种，他才选择为吴王奴。越国只被允许有3000甲士防卫之用。勾践及范蠡都去吴宫做奴隶。忍辱负重三年，甚至去尝吴王大便，才换来夫差的信任被放回国。回国后卧薪尝胆，依靠伐吴九术，以身作则与民同苦，又靠越女剑和进献西施终于在吴王将兵在外偷袭姑苏城得手，之后奋战数年才灭亡吴国。但是勾践只是做到灭亡吴国震动天下，没有名副其实的去争霸。但他的传奇经历也足以是他成为春秋时代的巨星之一。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记01【青年节】","date":"2016-05-04T13:30:07.000Z","path":"2016/05/04/日记01【青年节】/","text":"央视新闻说青年节放半天假，14-28周岁都放假，不过跟我们没有关系。51回来之后事情好多，有点忙不过来。在淘宝淘了些东西，都是从知乎上看来的。 淘宝购物清单 桌上书架 很笨重，益乐新村快递站点真是少，就几个通，韵达，天天等有站点。他们给我用的宅急送，真是醉了。然后送到公司，拖回来感觉手臂都不是我的了，十几公斤重啊！ 鞋架 现在淘宝卖的都是有遮尘布的,挺好的。 脏衣袋 实用 台灯 省电护眼用的，当初来住的时候，匆忙就决定了，桌子不舒服，凳子不舒服。想要自己添置，空间又太小。打算等房东装修好4楼，上去住了，房子一定要大一些才行。 所思与所想书读不完，总是想着买书。比如重新学C语言,再看看算法。又想着要看一下数据科学与Python,还想买一些闲书看看。现在真是后悔大学那么好的时光没有做点有意义的事情，最起码读点书唉。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]}]