[{"title":"计算机是怎样跑起来的【计算机知识大纲】","date":"2017-03-09T22:51:58.000Z","path":"2017/03/10/计算机是怎样跑起来的【计算机知识大纲】/","text":"知识点 GBK字符编码，汉字占用2字节。UTF-8，3个字节。 硬件由大量IC(集成电路)组成，上的引脚，有的用于输入，有的用于输出。 编译：把编程语言编写的文件(源文件)转换成机器语言编写的文件。 .NET是微软提出的技术。 2种编程方法：面向组件编程、面向对象编程。 GUI(图形用户界面) 算法 字符串的末尾用0表示，链表的末尾用-1，这些特殊字符是哨兵。 辗转相除法，机械求解最大公约数。2种方式，减法和除法。减法：2数中大数减去小数，直到两数相等，相等的这个数就是最大公约数。 典型算法。 名称 用途 辗转相除法 求最大公约数 埃拉托斯特尼筛法 判定素数 顺序查找、二分查找、哈希查找 检索数据 冒泡排序、快速排序 数据排序 最小公倍数。2数乘积除以最大公约数。 埃拉托斯特尼筛法，用待判定的数除以比它小的所有正整数，余数为零，可以整除，不是素数。利用的是计算机的处理速度，同样适用于计算鸡兔同笼问题。 执行时间短的算法更优秀。如，判定素数，只需要从2到待判定数的平方根即可。 线性搜索，从头到尾依次查找。哨兵，多用于此。加个特殊元素，减少判定次数。 数字间的规律，如石头剪刀布游戏判定输赢，0、1、2表示三情况，B+1除以3的余数与A相等，就是B获胜。 数据结构 栈和队列，栈存取形式是LIFO(后进先出)，队列是FIFO（先进先出）。 每个存储单元，8比特数据。 数组应用于线性搜索、冒泡排序。 123456789for (i = 999; i &gt; 0, i--) &#123; for (j = 0, j &lt; i, j++) &#123; if(x[i] &gt; x[j]) &#123; tmp = x[i]; x[i] = x[j]; x[j] = tmp; &#125; &#125;&#125; 典型数据结构 名称 特征 栈 小山堆积一样 队列 排成一队 链表 任意改变数据排列顺序 二叉树 把数据分为两路排列 二叉树是链表的特殊形态。 数组可以转化为栈或队列。 栈需要一个数组，一个变量。变量是索引，指向栈顶数据，是栈顶指针。数组、栈顶指针、入栈函数、出栈函数组成了栈。注意：栈顶指针指向的不是栈里顶端上的数据的地址，实际上是这个数据上面的地址。 1234567891011121314char Stack[100];char StackPointer = 0;/*入栈函数*/void Push(char Data) &#123; Stack[StackPointer] = Data; StackPointer++;&#125;/*出栈函数*/char Pop() &#123; StackPointer--; return Stack[StackPointer];&#125; 队列。数组、存放队头数据索引的变量、存放队尾数据索引的变量、存取函数。尾部存储满到最后，会折回数组的开头。逻辑结构变成圆环，循环利用。 123456789101112131415161718192021char Queue[100];char SetIndex = 0;char GetIndex = 0;void Set(char Data) &#123; Queue[SetIndex] = Data; SetIndex++; if (SetIndex &gt;= 100) &#123; SetIndex = 0; &#125;&#125;char Get() &#123; char Data; Data = Queue[GetIndex]; GetIndex++; if (GetIndex &gt;= 100) &#123; GetIndex = 0; &#125; return Data;&#125; 链表。c语言中用自我引用的结构体组成的数组表示链表。 123456struct TestResult &#123; char Chinese; char Math; char English; struct TestResult* Ptr;&#125;; 二叉树。有2个自我引用结构体的链表。用于搜索数据的算法，如二分查找，更快。 1234567struct TestResult &#123; char Chinese; char Math; char English; struct TestResult* Ptr1; struct TestResult* Ptr2;&#125;; 面向对象编程 缩写为OOP。C++在C的基础上增加了面向对象的机制。Java、C# 是对C++进一步改良。 结构体，操作数据的函数在外部。而面向对象编程可以把函数也放在内部。技巧有封装、继承、多态。 面向对象编程和面向过程编程是一对反义词。 多态指的是，针对同一消息，不同对象可以进行不同的操作。 .NET支持C# 数据库 DBMS缩略语。一张表由行和列组成，列被称为字段、属性，行被称为记录、元组。 SQL，结构化查询语言。 关系型数据库。 客户端、服务端。 主键和复合主键(多个字段组成) CRUD.插入（CREATE）获取(REFER)更新（UPDATE）删除（DELETE） TCP/IP网络 LAN（局域网） 传输控制协议和网际协议(TCP/IP) MAC地址：网卡编号 WAN（广域网） 集线器连接计算机，路由器连接互联网。 以太网网卡 CSMA/CD 带冲突检测的载波监听多路访问，是连接LAN计算机的方法。多路复用，是多个设备同时访问传输介质。 MAC地址由厂商编号和产品编号组成，每个都独一无二。 IP地址是软件上的编号。TCP/IP中传输数据都要带MAC地址和IP地址。IP地址是32比特的整数，8个一组，分4段。IP地址的范围，0.0.0.0~255.255.255.255.前三段是网络地址，后一段是主机地址。子网掩码就是标识出网络地址和主机地址。子网掩码转换的二进制数中，值为1表示网络地址，0的表示主机地址。与MAC地址一样，IP地址也是唯一的。 DHCP（动态主机设置协议）服务器获取IP地址和子网掩码。 默认网关存放路由器的IP地址。 DNS(域名系统)，解析域名为IP地址的服务器。其中记录着域名和IP地址的对应表。 ARP（地址解析协议），把IP地址转换为MAC地址。使用广播的形式。也有缓存表，记录对应表。 IP协议指定目标IP地址和路由器转发。TCP协议是双方相互回应确认信号，可靠传输数据。称作握手。通过包这种数据单元。 MAC信息 IP信息 TCP信息 数据 错误检查信息 网卡-设备驱动程序-IP协议程序-TCP协议程序-应用程序。层级结构。 TCP端口号识别上层的应用程序。web使用80，发送邮件25，接收邮件使用110. 数据加密 秘钥，用于加密和解密的数字。 XOR，逻辑异或运算。二进制，同则0，不同则1. 对称密钥加密技术，特征是加解密密钥相同。密钥的通知不安全，不适用于互联网。 公开密钥加密技术。加密密钥公开，解密密钥私有。公钥和私钥。 RSA，实现公开密钥加密技术的算法，三个字母代表三个三个发明者。 数字签名。MD5,信息摘要。 XML 可扩展标记语言。元语言。 HTML，超文本标记语言。 &lt; &gt; &amp; “ ‘ 5个特殊字符用&amp;lt &amp;gt &amp;amp &amp;quot &amp;apos 表示。&lt;![CDATA[ ]]&gt; 括起来就可以直接使用上述5种特殊字符了。 表示注释。 W3C(万维网联盟) CSV，只记录了信息，没有给信息赋予意义，比XML差一筹。 XML命名空间。xmlns=命名空间 的形式。 SOAP（简单的对象访问协议）用于分布式计算。分布式就是把程序分散在网络连接起来的计算机上。","tags":[{"name":"专读","slug":"专读","permalink":"https://amasawaseiji.github.io/tags/专读/"}]},{"title":"情书","date":"2017-03-05T16:20:11.000Z","path":"2017/03/06/情书/","text":"真的很惭愧，直到现在才完整看完这部电影。 大学时代曾看过一点，只是没看下去。毕业后，偶然有个人谈论电影这个话题，他一定对这个电影非常喜爱，所以介绍起这个电影起来滔滔不绝。如今，我是在top250里再看到这个标签，才重新拾起。 微博上曾有过某中学发现学长藏在墙壁里的情书，火极一时。大家纷纷要找到那情书所说女主，找到后，女主表示都过去多少年了，早就忘记了。 我们欣赏那种美好，向往那种美好，尤其是暗藏的，更加稀有。因为我们都有过。这个电影表现出了那种美好，无论是景物、人物、所有的一切，它本该美好，又讲的是这种人人都经历过的美好的故事。足以载入影史。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记2【我不相信】","date":"2017-03-05T12:48:28.000Z","path":"2017/03/05/周记2【我不相信】/","text":"这周主要是工作上的问题，还有就是个人也有了一些问题，结果就是有点糟糕。 同桌走了去年来的实习生，坐我旁边的。周一突然说家里叫他回家，他女朋友也回去了，于是他也就要回家发展了。真是突然呢！ 工作困扰工作上呢，我主要问题就是业务理解能力不足，也没有技术架构能力。结果呢，有些问题我就无法彻底且妥善地解决。最后也就只有跟上级沟通，搞一些暂时做法。 优秀同事我有一个非常优秀的同事，就是那种大学里是学霸的那种。他业务能力很强，工作极其认真。有时候就感觉我跟人家有差距，有些不服气。换个角度，这其实也是提升自己的一个榜样，多跟人家交流，紧跟人家步伐，这样的话自己差不多也会变得更优秀吧。 驾考这种自己的事一定要自己积极一些，要不然，考试的人那么多，排队排到黄花菜都凉了。 关于读书这两周，确实读了挺多书。但是呢，都是杂书，我想以此为引子锻炼一下状态，接下来开始真正的学习。所以接下来就是读专业书，专业学习为主了。还有读书的方法，不同的书应该有不同的读法。小说就通读一遍，结论性的书应该做记录笔记。 效率意志我发现上周这方面还挺好的，这周明显有下滑。主观认为这跟我三分钟热度的性格有一定关系，凡事没能坚持多久，去年就是这样。容易心有杂念，就坚持不下去了。周末更是，干脆一整天都在刷直播。完了又开始懊悔，进而产生极大的负能量。这种情况周而复始，人就被拖垮了。关于效率和意志，真的要找办法好好治治了，要不然就如上瘾一样，一点点蚕食，最后人生就这样虚度了。这是下周首要需要解决的课题，目前只想到读一些诗或许能缓解一些。 北岛的诗，作为结语。 告诉你吧，世界 我–不–相–信！ 纵使你脚下有一千名挑战者， 那就把我算作第一千零一名。 我不相信天是蓝的 我不相信雷的回声 我不相信梦是假的 我不相信死无报应 如果海洋注定要决堤， 就让所有的苦水都注入我心中 如果陆地注定要上升， 就让人类重新选择生存的峰顶。 新的转机和闪闪星斗， 正在缀满没有遮拦的天空 那是五千年的象形文字， 那是未来人们凝视的眼睛 。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"恶意","date":"2017-03-04T13:22:17.000Z","path":"2017/03/04/恶意/","text":"本来不打算再写一篇的，因为相较于嫌疑人、白夜行还是有差距的。但是可能接下来不会再读东野的书了，就对东野圭吾做个总结吧。 最初只看过电影嫌疑人x的献身，当时震撼挺大的。后来一个同学对嫌疑人的电影的评价，让我回忆起这个故事，于是买来实体书来看了。迅速读完，只是对于已知的故事，震撼没那么强烈了。 后来恰巧有 kindle 购书券，就一下买了解忧杂货店以及白夜行。先读的白夜行，是在一个假期读的，读完我就认定这本是我当年度读的最好的书了。就像评语说的，《白夜行》中的爱情极度炽烈，令人粉身碎骨。我认为则是，读完之后有种貌似读完的感觉，好像什么都没太说清楚，但其实已经说清楚了，给人以莫大惆怅感的结局。甚至需要一些时间来平复这种震撼的心情。 解忧杂货店，可能阅历不够，读不出太深层次的意思。 今天又读了一本东野早期作品，就是这部《恶意》。相较于《白夜行》、《嫌疑人》差了些，读完也没什么想说的。 对于作者东野圭吾，引用一段我也生以为然的评语作为评价。 后期笔锋越发老辣，文字鲜加雕琢，叙述简练凶狠，情节跌宕诡异，故事架构几至匪夷所思的地步，擅长从极不合理之处写出及其合理的故事，功力之深令人瞠目骇然。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"向前一步","date":"2017-03-03T12:54:37.000Z","path":"2017/03/03/向前一步/","text":"作者是 Facebook COO（首席运营官），1969年生，成功女性。 才意识到这类讲观点和经验的书是要做读书笔记的，不然看完差不多也忘完了。好在中途也开始了一些摘录。 不自信时，假装自信。 征求他人的建议有助于人际关系的建立。 分享自己的情绪，有助于建立更深层次的人际关系。（深表同感） 如果一个等着别人来告诉你应该做什么，就不可能成为领导别人的人。 只谈公事并不总是最佳的工作方式，将工作和生活完全分离就没什么意义了。不要害怕工作时谈起家里的私事。（又上了一课） 真正的领导力来自真诚的表现，以及不太完美的个性。 一个人对自己的工作越满意，就越不可能辞职。 如果你想要一位能平等相处的伴侣，那么从一开始就要建立平等的关系。（有用） 我们创建的家庭模式其实根植于童年的记忆。 完成，胜过完美。（作者座右铭，也对我启发很大） Facebook初创时期，天天晚上黑客长跑大赛。扎克伯格本人是个夜猫子，难怪有人说他睡觉都在编程。 成功是为自己做出最好的选择，并且接受它们。（独到的见解） 准时下班回家是件很重要的事。（有启发）","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"富爸爸穷爸爸","date":"2017-02-28T17:42:56.000Z","path":"2017/03/01/富爸爸穷爸爸/","text":"一本颠覆思想的财物启蒙书。对于一个小白来说，书中提到的很多观点是具有颠覆性的。以下仅记录我从中领悟到的。 努力学习，找一份工资高的工作，努力工作。这种模式犹如老鼠赛跑，很难从中跳出。不能为钱而工作。 理解资产和负债。增加资产，减少负债。按揭买房是一大负债。分期付款、信用卡都是。 除了职业，还应拥有事业。事业是资产项，资产产生收入。 财商包含会计、投资、市场观察力、法律知识。 投资自己的头脑，不应只了解一个专业技能，不断学习新东西。克服懒惰，自律。 这本书算是启蒙书，给你提供一种新思路。并且年龄越小的孩子读这本书收益越大。大人读由于丧失一些优势或者固有观念难以改变效果大打折扣。 仍然有一些指导性的东西。比如对于现阶段的我，应该怎么做呢。首先需要攒一笔资金，这需要适当的消费观念。同时学习财务方面的专业知识，再开始投资。再然后，不断用钱赚钱，开公司，实现财务自由。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"影视书（2017）","date":"2017-02-26T14:59:12.000Z","path":"2017/02/26/影视书（2017）/","text":"电影 序号 片名 上映时期 豆瓣得分 影评 1 勇敢的心 1995 8.8 95年的水平，相当震撼了。以及对于苏英战争欧洲史的一点开荒。 2 七月与安生 2016 7.6 实话说，有点强。周冬雨演技爆表了。 3 星球大战外传：侠盗一号 2017 7.4 这电影看的，全程一半在睡觉。如无装逼需求，弃坑。 4 西游伏妖篇 2017 5.8 春节档的商业片，经典的配乐还能唤得起多少情怀 5 面纱 2006 8.2 06年西方人到中国拍的电影。吕燕真是丑的可以，西方人反以为美？当爱与责任合二为一，恩典便与你同在！结局也是现实中正确的结局。 6 奇迹 2011 8.6 看完小说再看电影，总觉得哪里不够。文字传达的东西比影视信息量大吧。 7 阿甘正传 1994 9.4 人生是由命运和偶然共同构成的。影评 8 比利林恩的中场战事 2016 8.5 没经历过战争，无法理解他们。比利数度落泪，为自己也为他的宿命。影评 9 步履不停 2008 8.8 关于家庭、关于生死，淡淡的、安静的、细腻的体会感知。多珍惜与亲人在一起的时光… 10 如父如子 2013 8.3 怎样为父，未来的课题。我还是喜欢这样的讲好故事的是枝裕和。 11 情书 1995 8.8 揭秘暗恋。影评 12 言叶之庭 2013 8.2 快去看豆瓣有用最高的长评论，笑疯！ 书籍 序号 书名 豆瓣得分 书评 1 你一定爱读的极简欧洲史 8.3 从另一个维度解读欧洲史，但也多是对中学历史知识的一点回顾。书评 2 奇迹 7.7 最初怀着美好的愿望制定目标，阻挠总会如期而至。但要相信，当你达成目标而收获的绝不仅仅是当初的那点愿望了，会有很多很多收获！致敬那些为目标百折不挠奋斗的人儿吧，因为那才是真正的勇者！书评 3 国境以南太阳以西 8.4 文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。书评 4 追风筝的人 8.8 无愧为文学的经典之作，大学图书馆里借阅榜榜首。一份愧疚，一场救赎，一丝悲悯。书评 5 皮囊 7.8 这是一本凑出来的书，写家人可以打9分，写家乡让我想到草房子，写朋友就真的是过目就忘了。总的来说，及格以上，上乘不达，比刘同强。书评 6 富爸爸穷爸爸 8.2 提到的很多观念对于一个完全没有财商的小白具有颠覆性，不错的启蒙书。说从中学到具体的知识，还是没有的。书评 7 向前一步 8.1 虽然主要是讲女性职业发展和女权的，但还是从中学习到一些关于职业职场的有效方法。书评 8 恶意 8.4 天王套装第四本。开头和结尾精彩，手记体写法也很惊艳。过于注重推理和技巧使得真实感不强烈。关于主题所说的那种恨意体会不来。书评","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记1【完不成的目标】","date":"2017-02-26T09:53:05.000Z","path":"2017/02/26/周记1【完不成的目标】/","text":"日记太繁琐，周记则恰好。记录一周思考，这是第一篇，还是说一下（笑）。 制定计划开始只是有一个大目标，没做具体的细化。直到看到了一个极度自律的人写的一篇血泪日记，为了完成每日目标，半夜也要完成。就开始细化每日目标了。使用贴纸写下月度计划，每天晚上回来再日记本上写下日计划。算是开了头。 估算时间计划写得太满，导致完不成。因此，制定计划时，准确预估完成所需时间格外重要。 安排顺序有时候顺序不对，就完全打乱了一系列计划，制定计划和实施时需要随机调整，以免某个时间段无法完成特定任务而打乱一切。比如，跑步不能安排在吃饭后吧。 调整作息规律过去一周这个问题是最大的问题。现在已经昼夜颠倒了，怎样在指定的时间睡觉，已经成了困扰我的问题。希望下周能调整一些。 心事打断我想我错了。春节回家被家人灌输了一定要找对象的观念，导致我真的以为我需要找对象了。回来为此苦恼很久，怎么找对象困扰了我。后来我终于想起了之前看到的一些文字，在拥有爱的爱的能力之前，找什么对象。我想也是，当我拥有除了照顾好自己还能照顾另一个人的时候，我再考虑找对象的事吧。 迷茫了就去读书一切迷茫，不知所措，都是因为知道的太少而想的太多。多读书，广泛读书，总会找到适合你的那本，打动你，给你方向的书。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"少年锦衣卫","date":"2017-02-26T09:09:32.000Z","path":"2017/02/26/少年锦衣卫/","text":"三维动漫，比不良人还要用心啊，剧情目前看起来也挺好啊，没有不良人略显狗血的拖沓啊。已经超越不良人了，建模真是美哭，国漫新扛把子。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"皮囊","date":"2017-02-26T07:58:14.000Z","path":"2017/02/26/皮囊/","text":"每个读者只能读到已然存在于他内心的东西。书籍只不过是一种光学仪器，帮助读者发现自己的内心。 不可否认，这是今年读到的第一本触动我的书，或者说感受到的共鸣更多。这本书也有很大的毛病，后面的内容水平直线下降，甚至看到后面我联想到了刘同。刘同的书借用一个网友的评论就是“妈妈给的零花钱又被骗了”这种感觉。虽然有毛病，但是这本书还是值得看的，哪怕你只看一半也可以。 首先刺痛我的是，作者嘲讽那些在大城市打拼，跟老家的人产生了隔阂，已经回不去了的那些人。说他们是无家可回孤魂野鬼，庆幸自己还有家。然后作者着力想表达的是，我们这代人，从小镇到县城到地级市到大城市，慢慢的失去了家。呼吁我们小镇才是生我们养我们构成我们的家。作者最后说，我们都是既离开了家，又无法到达的人。我想，我们这代人是城市化进程的结果，城市化也是构成我们的一部分。我们想回到过去，谁不想呢，这也是无奈的事情。也许家里的事情于我们已变陌生，但我们终归还是拥有家人、亲戚，只要我们时常回去走走，即便是在陌生的城市，也不一定就是失去了家。 当作者写到闽南的乡土情怀时，我联想到了曹文轩的盐城农村，蒲松龄的山东，透过文字传达的家乡记忆，也足以令人动容。比如，作者说他们那拨人是晋朝时迁过去的，至今还保留着很多风俗，封建理想也根深蒂固。瞬间觉得自己这种明代山西迁往淮河流域的人，流传下来的文明简单的可怜。 作者由于家庭原因（父亲中风），早早担负起一家之主的责任，在大学时代就成熟老道地规划好了自己的人生。读到这里，令我汗颜，想到自己直到大学毕业依然迷茫不堪，没有任何规划。不得不感叹家庭对于塑造子女影响巨大。当然，健康家庭出身的孩子也相对来说更比较不会有心理创伤，谁又能说哪样的结果更好呢。 最令我感动还是作者描写的关于阿太，母亲，父亲，他的家人。这也是全书的精华，一个艰难家庭更容易催生出坚固的亲情，当然这也是人为努力的结果。毫无疑问，作者笔下的母亲是一位伟大的母亲。关于后半部分写到朋友、发小等，批评的人批评过了。我觉得这还是跟作者有关系，急于成名了，内容难免良莠不齐，或许这也跟作者心理创伤有关。现代大部分人都多少有心理问题。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"比利林恩的中场战事","date":"2017-02-24T15:11:16.000Z","path":"2017/02/24/比利林恩的中场战事/","text":"一部描述美国真正的参战士兵心境的电影。 在美国，有很多参战过的士兵，患有跟战争有关的心里疾病，称为战争后遗症，没参与过战争的人无法理解。 比利林恩数次落泪，因为他通过短暂的中场休息，看清了自己和这个国家的本质，看清了人们无法理解自己，看清了宿命。透过他的视角，是否能让人们能反思战争。 附上片尾音乐。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"追风筝的人","date":"2017-02-24T14:17:18.000Z","path":"2017/02/24/追风筝的人/","text":"经典无愧为经典。 早在我大学时代，这本书长期是学校图书馆里借阅榜第一。去年在朋友圈里看到一个朋友发的出自书中的一句话。 我看见镶木板的墙上挂着照片，照片中的人都将成为我的亲人。 配文：阿米尔到索拉雅家中提亲。那时我便将书购来，拖了很久，终于看完。 之所以没能一气呵成读完，我认为是这样的原因。前面部分描述的一直是安静祥和的小孩之间的真挚友谊，虽然处处预示着将会发生悲惨的事情，但着实是陌生的另一个国家的事情，难免让人感到晦涩、不理解。直到某次乘车途中，读到了发生的那件惨事，一发不可收拾读到大半。再后来，当我把此书列入计划中，方才读完剩下的部分。最后一部分，本来看得我觉得这书可能也就中上水平了，没有传说的那么神，但是后面纷至沓来的一波高潮，改变了我的看法，这本书是实至名归的上上之作。 我庆幸自己有足够的理解能力，能读到书中想表达的东西之一，人性。 没有良知、没有美德的人不会痛苦。 我想我们普通人都是有良知、崇尚美德的人。我们想努力弥补的都是我们愧疚的东西。诚然，有的人面对愧疚，选择逃避。但是，这种人内心深处是有创伤的，他/她们的灵魂是不完整的，当他/她们遭遇不幸，他/她们是容易怀疑人生的。敢于弥补愧疚的人都是勇敢的人，当他/她们完成赎罪，伤口会自愈、灵魂会完整，也便活出了人生的最高境界。 而是对生活曾有过的黑暗忍气吞声的照单全收。 哈桑、索拉博、无数承受战火的阿富汗人，作者还表达了悲悯。哈桑忍受着一切，哈桑依然是那个深爱着阿米尔的哈桑，就像他热爱生活一样。当你经历过地狱，并且从那里走出来，你将无所畏惧。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"阿甘正传","date":"2017-02-22T14:37:36.000Z","path":"2017/02/22/阿甘正传/","text":"印象中这是一部励志电影。 以我粗浅的阅历来看，美国的励志电影中的励志跟我们印象中的励志是不一样的。通常关于刻苦、努力啊基本不说，说的多的往往是运气或者天赋。这类电影通常更多的是探讨生命的意义，你要说它是励志电影真的是不走心。这是一部探讨残障人士的生命的意义的电影。 电影中有一段台词可以作为点睛之笔，摘录如下。 是否我们每个人 都有注定的命运 还是我们的生命中只有偶然 像在风中飘 但我想 也许两者都有吧 也许两者都同时发生着 我们每个人都有着好的或者不好的命运，但人生仅仅是这样吗？不是啊，还有偶然，就像那片随风漂浮的羽毛，时而扬起，时而下落，最终还会落地。我们能做的只是在风雨中承受着这一切，就像詹妮像鸟一样飘零、中尉在飓风中咆哮、羽毛飞舞…","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"国境以南太阳以西","date":"2017-02-20T14:26:18.000Z","path":"2017/02/20/国境以南太阳以西/","text":"文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。 借由其中一首歌在网易云音乐上的热评剧透作为读后记吧。 结尾泉的出现更让我觉得岛本或许真的就不存在。从国境以南来，到太阳以西去，可能岛本只是初一厢情愿的幻象吧。不得不说，初活出了大部分人的理想，有一个带你尽人事尝甘涩的初恋，有一个陪你立黄昏问你粥可温的爱人，有一次让你甘愿放弃一切的精神出轨，有一次回到现实却无奈下半身的肉体出轨。 附上书中反复提及的钢琴三重奏。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"半世伶俜空自许","date":"2017-02-19T13:15:39.000Z","path":"2017/02/19/半世伶俜空自许/","text":"读史使人明智，读诗使人灵秀，数学使人周密，科学使人深刻，伦理学使人庄重，逻辑修辞使人善辩，凡有所学，皆成性格。–培根 查阅寒伧（chen，同寒碜）时，相关词汇给到了伶俜（líng pīng），查伶俜看到了一首诗。 冰骨云绡雪数枝，清幽香冷与尘离。 深山有韵风摇影，古涧无人月弄姿。 半世伶俜空自许，一生风雨却谁知。 都言此萼非凡数，谁道花中最是痴。 这不是一首古诗，而是一位小才女写的诗。多好的诗啊。","tags":[{"name":"诗歌","slug":"诗歌","permalink":"https://amasawaseiji.github.io/tags/诗歌/"}]},{"title":"桃栗三年柿八年","date":"2017-02-19T06:43:14.000Z","path":"2017/02/19/桃栗三年柿八年/","text":"是枝裕和的风格就是讲述平凡的、淡淡的生活，讲述生活的本质。这个故事与电影海街日记一样充满温情。 小学生集体大出逃，7人和一只死了的狗，开始了一段冒险之旅，为了在新干线列车交错的地方许下愿望，让奇迹发生。 这是一个儿童题材的故事，火山灰、波斯菊、燃放的烟花、种子、生活中的一切事物，你喜欢也罢，不喜欢也罢，你通通要接受。生活也是一样，你也必须接受。 也许所谓的奇迹只是需要发泄而已。学会接受讨厌的事物，就是成长。 桃栗三年柿八年，达摩九年我一生。 书中出现的一句台词，原来是一句日本诗。人生需要时间的积累，才会开花结果。 小说是根据电影剧本写出来的，而电影是为了纪念九州新干线全线通车所拍的广告。你不得不佩服这位导演，一个广告电影，一个命题作文，选择了这样的题材，拍出了这样的作品，除了赞叹还能说什么呢。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"极简欧洲史","date":"2017-02-17T14:55:42.000Z","path":"2017/02/17/极简欧洲史/","text":"销量高不一定就好，充其量是对中学世界史的一点回顾。 副标题为为什么欧洲文明对现代文明影响这么深？我来回答一下这个问题。 因为欧洲工业革命，因为大航海，因为殖民。为什么欧洲能近代能够先崛起？因为科学的发展。为什么欧洲人能发明科学？因为欧洲古代有牛人，然后出现了文艺复兴。 这本书单只讨论了近代欧洲文明为什么能超越亚洲文明。给出的解释是：欧洲多国林立，强敌环饲，所以向海上扩张。王权为打压贵族，倚重商贾与科技。中欧一直小国并存，人才可以充分发挥才能，为文艺复兴打下基础。 从另外一角度讨论，中国历代关于科学的著述，偏向于经验总结。而欧洲则是科学方法论，欧洲有逻辑体系和实验方法2个方法论，这才是欧洲可以爆炸性增长的原因。 我们都知道古希腊罗马，罗马的灭亡是因为日耳曼蛮族入侵。蛮族在侵占的土地定居下来，罗马皇帝无地可辖所以才灭亡。所谓中世纪指西罗马帝国灭亡之后的一千年，日耳曼人建立国家，加入基督教，欧洲多国林立。 第二次入侵来自穆斯林，占领欧洲东部，跨越地中海控制到南欧的西班牙。所谓十字军东征即是征讨穆斯林，夺回圣地耶路撒冷。耶路撒冷是基督教发源的地方。 第三次入侵是来自北欧的维京人，维京人使用长船沿河掠夺，后来也定居下来。 英国原住民叫凯尔特人，日耳曼人、维京人入侵之后，才形成英语。 法国是由法兰克王国一分为三后才形成的。而另一支德国却很晚才统一。原因是教皇跟皇帝的争斗导致很分裂。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"马云山教练","date":"2017-02-17T14:36:54.000Z","path":"2017/02/17/马云山教练/","text":"又历时2天，终于可以写点了。这个主题不错吧！当然我没有功夫去学自己打造主题（摊手）。来不及了，车已经出发了。 马教练56岁，做教练20多年。很是健谈、做事麻利、头脑灵光、视野广阔、照顾后辈，当然这个年龄的人一般都会照顾后辈。 再谈公职人员态度。一个跟年期大妈一般态度恶劣，还是年轻好，对，年轻的好！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"嫌疑人x的献身","date":"2016-05-22T13:20:04.000Z","path":"2016/05/22/嫌疑人x的献身/","text":"推荐之书早前看过电影，当时感到确实牛逼啊。不过到看书前，大致情节都记不清了。只记得真相是杀了一个叫花子，最后主角很悲剧。很震撼，之后也是久久不能平复。 后来意识到东野圭吾的大名，又见到解忧杂货店畅销，就先买了相对熟识的x来看。 情节石神是个数学天才，帝都大学毕业后被迫当了个高中数学老师，人到中年仍然孤身，他想自杀。恰巧那天隔壁来了靖子母女，靖子离异独自带着女儿，石神暗恋靖子，天天去靖子工作的便当店光顾。靖子前夫是个无赖，纠缠她们母女不放，靖子母女失手杀了他。石神挺身而出帮她们处理尸体，隐瞒真相。警察找了上来，靖子母女按照石神的指示小心对付。办案警官意外引来了汤川，汤川是石神的老友，物理学家，其逻辑思维足以和石神匹敌。石神精心布置的障眼法被汤川慢慢识破，和靖子的关系渐渐浮出水面。另一边靖子的老相识妻子去世，追求靖子，石神嫉妒着，靖子痛苦着。 随着汤川一步步识破真相，在跟石神在一排游民处讨论齿轮作用后，石神自首了，证据全部对的上。知道真相的汤川替好友不平，去找了靖子，把真相告诉了靖子。原来石神不惜为了保护靖子母女，抛尸后，不惜再杀一人，是个流浪汉，所有的案情都是跟流浪汉有关，那么靖子母女就永远是安全的。为爱牺牲至此，用情至深，超乎人性极点。 靖子得知真相的同时，老相识送上了钻戒，是愧疚的活一辈子还是去自首，靖子在犹豫，但是女儿割腕了，所幸没死。靖子决定说出实情，自首了。 感受除了感叹作者构思匪夷所思，故事精彩至极之外，就是石神的爱，是暗恋，从一开始就赌上了性命，实在伟大。所以得知真相的靖子承受不住那份巨大的压力，选择了自首。而且石神喜欢人从眼睛开始，有共鸣啊。虽然故事离我遥远，但是至情至性，感人至深，是我今年到目前为止读到的最好的故事。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿1洪武大帝","date":"2016-05-21T09:49:07.000Z","path":"2016/05/21/明朝那些事儿1洪武大帝/","text":"总评豆瓣阅读买的电子书，一共7部，总共4、50块，要是买实体书的话一定上百的，毕竟一部就20多万字。 第一部主要描写朱元璋的一生以及建文帝朱允炆那几年。我认为可以分为4个部分，第一是朱元璋与群雄相争到扫灭陈友谅及张士诚止，第二是灭掉元朝驱逐北元到蓝玉扫灭元庭止，第三是内政方面洪武四大案到朱元璋去世止，第四是靖难之战到朱允炆倒台止。作者着墨最多的是靖难之役，花了三分之一的篇幅都在讲这件事，讲的很细致。 这本书给我的感觉就是，一开始以为讲历史，结果啥都讲。也有很多人诟病的一点就是，故弄玄虚，夸大其词，不过这也是章回体小说的套路。 一、群雄相争朱元璋的发迹朱重八，安徽凤阳人，农民出身。为什么叫重八？因为祖上都没文化，只能以生日年龄等数字起名字，就是朱八八。 元末，官员腐败，汉人又地位低贱，天下大灾，爆发了韩山童、刘福通为首的农民起义。朱元璋家祸不单行，父母，大哥二哥都饿死了，朱元璋就去当打工的和尚，辗转讨饭于各地，在这期间磨练了心智。后汤和引荐他去郭子兴处参加起义军，因为能力强，郭子兴把义女马姑娘嫁给他为妻，这就是后来的马皇后。后来从郭子兴处借来兵马，在安徽江苏一带发展，占据金陵为根据地，成为一方势力。历史演进，小角色谢幕，出现了2个主要的对手。 陈友谅&amp;&amp;张士诚朱元璋前期主要是自己指挥为主，他是杰出的政治军事家，这有赖于他后来的自主学习。手下有武有徐达常遇春等名将，谋有刘基，关键时刻能正确判断事情的人。 陈友谅，湖北仙桃人，渔民出身。本是小吏，为人狠毒，一步步向上爬，最后干掉主子徐寿辉，称国号汉，登基为帝，都九江，占据湖北江西一带，陈友谅不愧为枭雄。第一次攻击金陵(南京)，陈友谅水军强大，战船多，朱元璋引诱其至龙湾，使其登岸，伏兵败之。但陈友谅还是很强大，不甘失败，又进攻南昌，朱元璋的侄子朱文正也是个守城名将，陈友谅没能攻下来，朱元璋支援，双方于鄱阳湖大战,朱元璋采用火攻，大败陈友谅60万大军，陈友谅战死。 张士诚，盐贩出身，占据江苏浙江一带，守城达人，自守之贼。元军攻打高邮，张士诚硬是凭借意志力守了下来，也是个人杰。但是他不思进取，在朱元璋与陈友谅大战的时候，也不去支援陈友谅。等到陈友谅被消灭了，就轮到他了，被朱元璋围城，城破自杀。 二、对元战争灭元朝当时元朝还是很有实力，但是从南往北打，历来成功者少。而且蒙古人善战，骑兵厉害。朱元璋先从河南山东开打，凭借他卓越军事家的谋略善战的名将，逐步驱逐元朝，攻下大都。后逐步往东北西北出兵，元迁都上都，称为北元。 这一时期，只要是朱元璋制定作战计划，将领们去完成任务，类似于汉武帝时期的方式。朱元璋只坐镇都城，已经建立了明朝。 逐北元这一时期涌现了许多名将，徐达、常遇春、李文忠、冯胜、邓愈、傅友德等。元朝也有一位名将，名叫王保保，只不过他的运气不好，总有人能打败他。期间常遇春病逝，一代名将陨落。当老将渐渐死去，新人脱颖而出，最厉害的就数蓝玉，蓝玉率领15万军深入漠北，打到捕鱼儿湖(贝加尔湖)，找到元庭，俘虏元妃，王公贵族大部，成吉思汗的黄金后代也遭遇灭顶之灾。后来另一支蒙古人建立政权，就是鞑靼。蓝玉的功绩被朱元璋称赞为可以和卫青(仲卿)，李靖(药师)比肩，不可谓不伟大。 三、洪武四大案对抗制度朱元璋是个权力欲望很大的人，他希望自己建立的朝代是最好的，亲自制定了很多制度，精力旺盛，也很疯狂。 明朝初期，朝廷官员分为2派，一个是李善长代表的淮西派，另一个则是刘基代表的浙东派。李善长可以说是朱元璋的萧何，后勤部长。朱元璋对其也很器重，因为都是老乡。两派互相攻击，最后两派都覆灭了。这时候蹦出来个胡惟庸当丞相，大肆拉拢派系，但朱元璋似乎不管不问，直到时机成熟，一件小事就让胡惟庸倒台，牵连者上万人，被杀。然后朱元璋废除了丞相制度，还设立锦衣卫等特务机构，专门监察官员不法者。锦衣卫，飞鱼服，绣春刀是标配，电影绣春刀等都在讲述着这个传奇的职业。 朱元璋制定了许多约束官员的制度，给官员的俸禄又少，还面对着一个杀官员不眨眼的皇帝，所以明初当官真的是有很大风险的，可谓是朝不保夕，即使你没有犯法。 空印案是官员钻法律的漏洞，郭桓案是腐败，蓝玉案着实是蓝玉自己作死，蓝玉有性格缺陷，打仗很吊，做大官不会做，最出名的就是他奸淫投降俘虏的元妃，人品有问题。后来又因为别的事惹恼了朱元璋，以谋反罪处死，牵连甚广。 为了子孙万代朱元璋杀那么多人，很多错杀冤杀。这与其自身成长经历有关系，他从要饭的变成皇帝，这期间，他的心越来越硬。他希望自己的后代不要像他那样受那么多苦，为子孙剪除了一大批可能有威胁的臣子。建立了他认为完美的制度，认为这样他的子孙后代只要他制定照着制度走，就能千秋万达，历史证明，这多么不现实啊。 四、靖难之战朱标与朱允炆朱元璋的儿子除了太子朱标，都被封为亲王，拥有军队，用以危难时勤王。朱标，为人宽厚，为朱元璋喜爱，被封为太子，但是死得早。由于朱元璋对朱标的深爱，便立朱标的儿子朱允炆为继承人。朱允炆也是个饱读诗书，宽厚的人。朱元璋怕自己走了，朱允炆镇不住那些有能力的大臣或者亲王，给他留了几个人。方孝孺，忠义的文臣。齐泰，不出错的出色官员。黄子澄，朱允炆的伴读。朱允炆早就意识到朱棣不会安分。 靖难朱允炆一上台就搞他的其他的几个叔叔，或者关起来，或者流放，但就是不杀死，妇人之仁。朱棣也警觉了，暗中打造兵器，装疯。等到时机成熟了，遂起兵，占据北平。本来朱棣一个亲王，十几万兵，不可能成什么气候。但是怪就怪在朱允炆和朱棣能力不是一个层级的。 首先去打朱棣的是耿炳文，这是个守将，不会攻啊。带了30万人，败。但是朝廷兵多啊，第二波，李景隆，李文忠之子，但这是个军事白痴啊，带了60万人，又败。这一战也有沙尘暴的原因，让朱棣抓住了时机，天要朱棣胜。之后，朱棣进攻，打济南，这个时候，有人站了出来，铁炫、盛庸、平安这些人，有的是小吏，有的是低职军官，但他们守住了济南。战争进入拉锯阶段。 朱允炆任命盛庸为新的总帅，进攻朱棣。此战朱棣大败，大将朱玉战死。但是因为朱允炆的不杀朱棣的约束，混战中所有人都不敢把火器朝朱棣身上招呼，这也是朱棣与朱允炆的等级差别的体现。之后又一次发生了沙尘暴，朱棣又打败了盛庸。 姚广孝，和尚，道士，阴阳家。本来已经是个老人了，但觉得一生空有抱负无处施展，又考不过科举，就到了朱棣的身边，劝说朱棣造反。这一次他劝说朱棣绕道直取京城，于是朱棣又出发了，不打济南了，走徐州、宿州、灵璧、直到南京。这个时候，那个李景隆又出来了，作为朱棣的内应来打开城门了，这个间谍埋得好深啊。朱允炆烧城失踪，一批忠臣被朱棣残杀。 朱棣，历时四年，燕贼篡位。归因于他的坚韧，朱允炆的等级太低。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记02【无题】","date":"2016-05-18T14:36:01.000Z","path":"2016/05/18/日记02【无题】/","text":"烦心事本来只是看到一篇讲给博客插入音乐的博客，想实践一下，顺便测试一下。遇到了一些烦心事，工作上也有点不愉快，这两天回去之后，一般就是睡觉。 从小的来，我妈最近工作中扭到腰了，还挺严重。突然意识到我才从学校出来，父母身体却不好了，努力的速度完全赶不上他们衰老的速度啊。最近看到一句话，读得好不如长得好，长得好不如生得好。 本来很早就能下班的，可是一个同事请假了，另一个同事跑得比我还快。版本要发布了，我只能留下解决可能出现的问题。还真有，就是那个跑得早的同事的问题。这还不是关键，加班也就罢了，好基友在等我下班啊，最后我就请他吃了饭啊。 我陷入困境了这两天，浑浑噩噩，上班埋头敲代码，下班看点书睡觉。大雨衬托着此时的心情。又疯狂买了4本书，一个月买4本，这个月买6本了。 新东西试试插入音乐的功能","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"游无锡","date":"2016-05-15T15:42:25.000Z","path":"2016/05/15/游无锡/","text":"游与行在我的词典中，旅游分为2种。 一是旅游，一堆人，特别热闹，到什么景区。这是规范化的旅游，要收钱。很多时候没什么大意思。一般目的地是人工开发大于自然美景。 二是旅行，可以一个人或者几个人，野游。随便到什么地方，有的时候比规范化的旅游看点更多，更美。一般目的地是自然风景。 旅游地又分为2种，但是我现在认为可以有3种。 自然风景，人为装饰较少，如一些山。本身足够雄奇，不需要人工雕饰。 人文风景，一般以建筑为主。由于现在很少有历史遗迹（很多那些所谓的遗迹都是后人还原仿建的），这类看点不大，也没什么意思。 影视基地，背靠自然风景的影视基地。中国影视发展了几十年，这群基地是仿的里面最出类拔萃的。影视也可以怀旧啊，还是有一些精品的。 无锡早上出发，车上老板陈词，做活动，新人介绍。我也挺悲催的，惩罚环节怎么少的了我(郁闷脸)。3个小时的车程，中午都是硬菜。到了无锡，导游就上来了，名叫侯希希，笑声很有特点。无锡缘何称无锡，锡山有锡，锡锻造青铜器的材料，兵家必争锡山。王翦除锡山，无锡（导游说的）。还说了，吴的祖先，阖闾，夫差，勾践，吴越，范蠡，西施，还好我都懂。 鼋(元)头渚很烂的地方，坐大船去到一个岛上，岛上全都是近些年旅游开发的东西。且人满为患。 仙岛 岛上的水 城 下了岛，还有 包孕吴越 拔河游览完毕，公司的体育竞技，选在一个草坪上，我们组第一场第一轮晋级，第二轮败退。第二场，训练的很好，有个隐患没人注意，比赛时绑带脱落。out出局。值得一提的是决出总冠军的拔河比赛。之前一直没了解过拔河有什么技巧。原来有种姿势是全体正向拔河向后倒，利用草坪的摩擦力不大，着力点放宽，他们组轻松取得胜利。反观另一组，全部侧身姿势，爆发力是强，一点对面顶住5秒钟，胜负已定。如果不是草坪是水泥地效果就没有这么好了。 晚宴还好可以不用喝太多酒，一群人出去逛了下夜晚的无锡。没有杭州的脚步匆匆，这是一个地广人少的地方，适合生活。夜静很美丽。 酒店2人一间，4星级，400多一天，可以了。 三国城刚进去嗤之以鼻，不就是人工造的吗，没啥意思。直到看三英战吕布的表扬，马术可以的，背景音乐也是老三国的，有刘欢的这一拜 还有 貂蝉已随清风去等。谁让我看过老三国呢，还不止一遍。忍不住发了个朋友圈，像我这种从不发朋友圈的也没忍住，虽然后来删除了。 三英战吕布 看完，天公不作美，下起了雨，撑伞呗。途中我们的导游秀逗了一把，他说刘备去山东诸葛亮老家三顾毛驴，看来他水平太次了。但是路上还有个其他的导游，倒是水平不低。为什么呢？他说，有三个人在对待汉朝皇帝这件事上犯了成本高，效率低的致命错误。他们分别是，董卓，袁绍，袁术。卧槽！一听这个，我觉得他肯定看过易中天的，这是易中天讲的呀。水平可以的。到了水边，本次旅游最最壮阔的地方、最最美的地方。一张图说明一切。 壮阔的水边 当时风大，浪起，很有fell。为什么打动我？背靠太湖，这里自然风景已经大过了人文建筑。 之后去吴王宫，水浒城，就再也没有这样令人神往的地方了。 吴王宫","tags":[{"name":"游记","slug":"游记","permalink":"https://amasawaseiji.github.io/tags/游记/"}]},{"title":"岛上书店","date":"2016-05-15T13:52:27.000Z","path":"2016/05/15/岛上书店/","text":"封面 每个人的生命中，都有最艰难的那一年，将人生变得美好而辽阔 句子 无人为孤岛，一书一世界 独自生活的难处，在于不管弄出什么样的烂摊子，都不得不自己清理 没有人会漫无目的地旅行，那些迷路者是希望迷路 好的婚姻，至少有一部分是阴谋 婚礼就是这样，会让人感觉孤独的要命 一个地方如果没有一家书店，就算不上个地方了。 主题 因为从心底害怕自己不值得被爱，我们独来独往。然而就是因为独来独往，才让我们以为自己不值得被爱。有一天，你不知道是什么时候，你会驱车上路。有一天，你不知道是什么什么时候，你会遇到他(她)。你会被爱，因为你今生第一次真正不再孤单。你会选择不再孤单下去。 –A.J.与艾米婚礼 迟暮花开 关于一本畅销小说，美国人所写。故事时间跨度还是有些长，所以人生阅历尚浅的我很难get到共鸣。就像那个电影，one day，主要是虐，但是那种时间的流逝，命运的无常，很让人唏嘘。 再扯另一个话题，看书。之前我看书，都是过一遍，图一个爽，不会去想任何东西，那叫浅阅读。现在知道了看书是要思考的，所谓学而不思则罔。看一个小时，思考2个小时，作者为什么怎么写？作者想通过这些表达什么？虽然我还get不到这种阅读技能，也时间有限不能想那么久，毕竟不是去研究什么东西。但现在已经开始思考了，这也算是进步，至少会想一下，看完了，我从中学到了什么。 那，这本书，我又学到了什么？除了低谷中的坚持，无出其右啊，关键是get不到啊，没有共鸣。但是个不错的故事。由于不是一口气读完，中间还穿插了去旅游，前面的有些都记不清楚了。只能试着去回忆了。 主人公是一家在爱丽丝岛的书店的老板。名字叫A.J.费克里（我总是读成费里克（尴尬））。故事开头，女主角给小岛书店推荐书目，遭到了A.J.的冷遇。女主角名叫阿米莉亚（朋友会喊她艾米），是出版社的销售代表。冷遇？这是因为A.J.妻子妮可去世了，他在低谷中。A.J.整日买醉，书店情况越来越糟。人在低谷中，总是要有重重一击，才会清醒过来。A.J.的一本价值几十万的书被偷了，那是他最值钱的东西。警长兰比亚斯在A.J.最低谷的时候给予他类似于陌生人的关怀。 A.J.重拾跑步，打算重新开始，也跟兰比亚斯成了朋友。一天，他去跑步回来发现，家中多了一个女婴，附带一则留书，玛雅的妈妈说自己实在无路可走了，第二天，玛雅的妈妈就跳河自杀了。（这里埋了个伏笔，为什么玛雅妈妈一个外地人，人生的最后选择了爱丽丝岛？）A.J.竟然渐渐与玛雅产生了感情，决定收养玛雅。一个单身汉收养一个女婴，听起来不可思议。A.J.是个痴迷于读书的人，尤其喜欢短篇。这样一对父女开始新的生活，且越来越好。 一天玛雅出水痘，A.J.很焦虑，抓到手边一本书开始读，这本书叫迟暮花开，讲述作者自己单身一辈子，78岁娶了位妻子，妻子比他还大，2年后妻子去世，这样一个悲伤地故事。A.J.发现这本书是阿米莉亚推荐给他的，他还有印象，他想找到这个跟他有共同阅读品味的人交流一下。于是2人从合作关系开始，慢慢开始约会。艾米的男朋友是个军人，艾米跟他并没有共同语言。A.J.带着玛雅以及兰比亚斯以去某公园为幌子，实际是他去找艾米，至此2个人确定了男女朋友关系。终于A.J.找到个机会，在请到迟暮花开作者的前提下，办了场签售会，他要在会后求婚！A.J.不会当众求婚，那样做会类似于强迫，他更尊重艾米。会后，A.J.开车送人去了，艾米得知迟暮花开竟然是别人代笔，真是令人啼笑皆非。A.J.回来后即向艾米求婚，艾米答应。并隐瞒了代笔的事，她不想2人结缘的那本书最后是个笑话。 婚礼上A.J.前妻的姐姐伊斯梅，很苦恼，走到了海里，兰比亚斯阻止了她。原来伊斯梅的丈夫丹尼尔外遇不断，而且伊斯梅流产了7次之多，一直没有孩子。丹尼尔是个作家，写的第一本书很受欢迎，所以伊斯梅一直忍受着，直到忍不了了。回去的路上，伊斯梅责问丹尼尔华莱士（玛雅的妈妈）的事情，她知道玛雅是丹尼尔跟华莱士的孩子。车停在路上，遭遇车祸，丹尼尔去世，伊斯梅受伤。 玛雅上初中了，写得一手好作文，这都是A.J.一手打造出来的，一次作文比赛，A.J.给与玛雅指导，玛雅获得第三，写的是她想象的她的妈妈死的那一天的活动。这又是一个引子，引出了之前的谜题，A.J.的收藏书被偷的谜题。 兰比亚斯跟他的妻子结婚时，只知其表不知其里，离婚了，单身很多年。一天，他跟A.J.吐露他喜欢伊斯梅。2人约会、上床。早上起来，他发现了那本被偷的书在伊斯梅那儿，但是他爱着伊斯梅，什么也没做。A.J.有时会有失语症，一天，他跑步时，晕倒了。去医院得知自己得了脑瘤，手术后也不能活多久。他犹豫着是要花一笔钱治病，还是省那笔钱给玛雅读大学，给妻子还房贷。他找到兰比亚斯，告诉他实情。兰比亚斯跟伊斯梅坦白自己知道那本书在伊斯梅那儿，在伊斯梅的话中真相终于揭开。原来华莱士找过伊斯梅，想要问丹尼尔要钱，她们过不下去了。伊斯梅要单独摆平这件事，她爱着丹尼尔。偶然看到A.J.不省人事，那本书就在桌上，她顺手拿走了。给华莱士，但华莱士用这个换不来钱。又去找伊斯梅，还给她书。然后这本书被玛雅损坏了，伊斯梅只能一直放自己那儿。书换得7万多元，手术了，之后也没活多久，去世了。艾米经营不来书店，兰比亚斯和伊斯梅接手，艾米辞去了销售代表的工作，又有新人上来，又有新故事不断发生。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"草房子","date":"2016-05-08T10:27:00.000Z","path":"2016/05/08/草房子/","text":"读书总结？读书读的是什么？读了一本书，除了跟随作者领略了主人公的心路历程，体验了一番别人的生活经历，于我留下了什么。时间一久，恐怕就什么都忘了。所以说读书不光是体验，还要总结。这才是读书的用意所在。况且听人说，就算读的书再少，也要写总结。于是这篇就是一篇总结，而且是认真读完了的总结。 草房子？都知道，儿童文学，入选中学课文的。早在我中学时，就在同桌的手里见过这本书了，并且他当时还跟我安利了，但是错过了没有读。后来也忘记是高中还是大学了，在少儿频道看过电影版。当时看的很感动的，虽然都是小朋友的戏，但是有共鸣啊。直到作者曹文轩获得国际安徒生奖，草房子又进入了我的视野，果断买了本回来看。虽然已经步入工作，看完了之后，仍然觉得感动依在。 感动依在秃鹤因为是秃子，被人嘲笑，不受人待见。但是他却在事关学校荣誉的文艺表演上，证明了自己。原来人可以不因为外表，而是因为有所担当，变成最英俊的少年。 纸月被男同学欺负，被迫转学。转学后依然有人在上学路上骚扰她，天天迟到，桑桑站了出来，桑桑为帮助纸月逃脱，跟人比试从桥上跳下去。少年为了少女甘冒艰险，什么是值得的，什么是胆略？ 桑桑成了蒋老师和白雀的信使，他也不懂为什么就愿意成为信使，并把这件事变成了他的责任，因为他的好奇导致他俩的误会，桑桑耿耿于怀，总想着弥补。后来终于桑桑说出了实情，可是时过境迁，挽回已不可能。白雀把那些信全部送给了桑桑，希望他以后可以懂得多，就误会少了。阴差阳错，不能全怪桑桑，除了要桑桑明白，也是要读者明白，大人的世界是什么样。 秦大奶奶独居校园小屋，学校赶不走。因此她和学校就结下了梁子，让人误会。却在学生落水之际，不顾年迈挺身而出，赢得了大家的尊重，也因此变成了慈祥的秦大奶奶，直到故去引得一群学生悲伤与怀念。 杜小康本是油麻地富贵人家的孩子，成绩好，总是抢了桑桑的风头，2人从竞争对手到朋友大概还是因为杜小康的心胸豁达，愿意借车给桑桑骑，也由此引发了一场大火。杜小康有担当，主动承认，而桑桑却做了缩头乌龟。桑桑因此痛恨自己，羡慕着杜小康。但是天有不测风云，杜家遭难了，货船沉船了，家道中落。杜小康上不了学，跟着父亲去放鸭，也失败了。这里应该是全篇的高潮，也是中学课文的那段。杜小康在放鸭途中，面对孤独，忽然长大了，回来后桑桑主动卖鸽子给杜小康筹钱摆小摊卖东西。杜小康的勇敢，与桑桑的友谊，荡气回肠，大有英雄惜英雄之意。 细马是邱家要来的孩子，他是外地来的，跟不上学校进度。于是辍学去放羊了，因为家里的关系，桑桑成为细马唯一的朋友。细马因为年龄稍大的原因，被邱二妈认为是来继承家产的而不是来孝敬双亲的。想赶细马走，但邱二爷对细马确是真情实意，令细马很感动。就在他被送走的时候又自己回来了。恰逢发大水，邱家被淹了，没有家产了，邱二爷病故了，细马成了家里的顶梁柱。经历了这些，细马也突然间长大了，他阻止邱二妈自寻死路，精明的做一些生意，要给邱二妈盖新房子，为人养子者做到如此，无愧于天下了。 文中最后桑桑经历了死亡的考验，原来在面临死亡之际，人性的光辉突然会变得无比耀眼，他愿意做一切为任何人。也许是上天悲悯，看到了桑桑的真情实意，给与了他免死牌。 后记正如小说扉页所说。 也许，我们谁也无法走出自己的童年······ 我也深刻领悟过童年，前段时间翻到我大学时写过的一篇报告，上面还描述了一段惊心动魄的过往。小时候，跟伙伴去桥下玩，踩着石头过河。我们撺掇其中一个第一个去，结果被水冲到下游去了，惊动了很多人，好在下游有大石头挡住了他，不然后果会很严重。这么多年我都记得，更记住了不能拿生命冒险，更不能让别人拿生命冒险。 又如小说内容提要概括的那样，少男少女之前毫无瑕疵的纯情，不幸少年与厄运相拼时的悲怆与优雅，残疾男孩对尊严的执着坚守，垂暮老人在最后一瞬所闪耀的人格光彩，在死亡体验中对生命深刻而优美的领悟，大人们之间扑朔迷离而又充满诗情画意的情感纠葛·····这一切正是一个少年正在体验或终将体验的征程。其实不光是少年，现在社会的少年体验这些的时间明显滞后了。无论何时，于个人而言，这也是一笔珍贵的财富。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"2015在上海","date":"2016-05-08T07:11:29.000Z","path":"2016/05/08/2015在上海/","text":"2015年下半年我都待在上海，从学生转向职场，颇多艰难。所见所闻，偶有所感，遂记之。 越老感悟越不同2016-01-03 生活就像强奸，既然反抗不能，那就安然接受！以前宅久了，出去到外面吵闹的地方，恨不得找个地缝钻进去不出来。觉得跟自己毫不相关，却打扰到我，真想呵呵这个世界一脸。那时候是真的抑郁，一点不与外界交流。现在反而觉得累了闷了就到那些吵闹欢快的地方去，虽然他们跟我还是一点关系没有，但她们有笑容，总是能感染到我。这之间主要的变化大概是从不闻不看到愿闻愿见。接受他们接受世界才能进一步热爱生活热爱世界。 上海初见闻2016-01-14 在上海待了几个月了，想聊一聊我眼中的上海。 刚来上海的时候也没什么了解，只觉得这是个高大上的地方，地铁都飞行于地面上，6的飞起。 后来住了一些天，发现上海原住民都会养宠物，并且喊狗狗是宝宝。对待狗都像自己儿子一样，比如会给狗擦屁股。。 还有就是这边的小吃路边摊一些门店都是泛中原籍人民经营的。操着一口中原官话，我听着都很熟悉。也不是上海，大江南北到处都有，毕竟赶上改革开放，中原人口庞大就都往东南方向谋生去了。就跟你在珠三角感觉云贵川湘人多一样。 后来领略到上海房价之贵，郊区也都200多w，感觉把自己一辈子都卖给上海也怕是难买套房住下来。 物价还好，住也不是很夸张。之前看到一朋友转载的一文章，说在上海，月薪8k勉强自给自足，我感觉也没有说的那么夸张。 听人说北京这地方工作区跟生活区挤在两大坨，然后每天大家都往一个方向去上班，又同一个方向下班。所以地铁特拥堵。上海倒是还好，因为工作区是呈星射线型向四周扩散，除了市中心哪一环比较挤，其他地方还好的。 就说我去过的几个区吧，首先浦东这地方真的是有点人少，除了一些大型的工作园区，更多看到的是宽阔的马路，爽朗的天空。仿佛远方的大海就在不远处一样。说到工作园区，那真的是一个挺让人向往的地方，因为这是一个成熟的生活园区。你在这上班，我有丰富的餐饮大楼，娱乐放松大楼，保证你不会枯燥。 往南到闵行奉贤过，那边儿主要的感受就是人多，主要的居民区居住区挺多，但是那边美女也蛮多的，哈哈。 市中心以及浦东的高科技公司较多，但是市中心也是参差不齐，也有破烂的小作坊，也有高大上的甲级写字楼。总之浦东是一个可以向往的地方。 地铁非常发达，基本上你要去的地方90%都是用不着在做公交车的。就说有的时候你要转个线，经常直线下降几十米都很正常。不知道在重庆的朋友会不会打我。 再有就是公交，有的郊区蛮乱的说，不是自动售票。浦东的就很好，会用三种语言播报，普通话，上海话，英语都来。我还学会了说谢谢，上海话说听起来和“下压”差不多。哈哈 还有就是嘉定，那地方，空旷风大，人流多，吃的地方少。就不要去喝西北风了哈 雁栖之地-江湾新城2016-01-15 也许以后少有机会写东西了。行万里路，读万卷书。所见所闻，群像百态，皆可成文。 昨天去了江湾新城，发觉虽然浦东空旷和大气，江湾这地方一点不输。江湾是孤傲中掺杂些许自然。 我有说行走在江湾的大路上，想起来九峰山骑行的豪情。九峰山真的有九座山丘，在金华，九峰山还有水上乐园，是个生态旅游景点。当年去九峰山一路上人烟稀少，只有一条孤寂的道路绵绵不绝，望不到尽头。路上草丛中偶尔还会出现坟茔。浙江地区有种特色，往往在路边会见到墓碑和一些供奉拜祭的器具，或者还会有残留的香线，你这也是我当年夜间骑行所忌惮的东西。放哪儿不好，把墓碑竖在路边这样真的好吗？ 在去园区之前，遇一溪流。这并不足奇，吸引眼球的是岸边垂钓者众多，细下心来去数钓竿，两边栏杆加在一起足足有20有余竿。这种地方，高楼林立，水那么黑，会有鱼？还真的有，我观察他们放鱼的水袋子中大鱼小鱼全有，真是个宝地。鱼儿游得过来，说明生态还没有破坏。凭栏望去，什么！还有鸭子水中游，河边草丛深，申延入河中，鸭子的身影渐渐隐没其后。驻足又有片刻，成双的白鸥从我头顶飞过，目光追随它们身影，触到斜射过来的阳光，乃止。 有如此景色，传说中的湾谷科技园又如何呢。大，非常之大，大到我不知道它会有多大。a但是由于刚刚开发完毕，很多大楼没有入驻的公司，空空如也。但是这不要紧，交通方便啊，虽然没有直达的地铁。但是园区自己有公车啊，只会往返两个站点，从附近的地铁站到园区只要10分钟。我是已经心向往之了。 今天也去了个地方，有可说道之处。徐家汇常熟路附近几条街大概是老外的生活圈子吧，走在路上一半都是歪果仁。还有一对歪果仁哥们骑三轮车卖鞋子，丰富了我的眼球啊。 最近读了个历史推理文集，三国谜案，颇有新意。除了一些悬案诸如邓艾昭雪之难、司马断嗣、东吴二宫并阙、血衣带诏、李严废黜通过史家隐笔给出合理推测，历史是任人打扮的女孩。关键是洛神密码的推理真有让人讶异的地方。洛神密码的主角不是甄宓不是曹植也不是曹丕，而是曹彰！作者甚至推测出曹睿是曹彰跟甄宓的儿子！曹植的洛神赋写的是曹彰！真的新颖地值得一看。 转眼还有三周就过年了，以后也少有机会读一些杂谈之类的东西了，岁岁少，岁岁少！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"侧耳倾听","date":"2016-05-06T15:54:04.000Z","path":"2016/05/06/侧耳倾听/","text":"世界上有两种人，一种是喜欢宫崎骏的人，另一种是不知道宫崎骏的人。 偶然翻阅别人博客，看到有讲到久石让in武道馆的演奏会，据说很震撼，于是去看了下。果然，1200人的演奏团，各种乐器眼花缭乱，据说是世界上最大的音乐会。 完了又去看了映像宫崎骏的介绍,又稍稍加深了对宫崎骏动画的认识。之前看了很多部，除了看完之后很震撼，其实是没看懂。也去翻阅豆瓣评论，试图找找这些电影都讲得什么涵义，不过一时难以体会。 侧耳倾听最早了解宫崎骏都是在各种碎片信息中，就知道有这么个动画大师，由于愚昧无知的原因，觉得动画片是不是有点low，就没有去看了。直到后来有个同学在QQ空间说看了千与千寻感动的不要不要的，才有意识的想去也看看。 再后来关注豆瓣之后，有个妹子在那讲失恋后，每次觉得坚持不下去了，就去看侧耳倾听，就会重新充满力量。我就去看了，第一次看了3遍。第一印象就是白活这么大了，要是早一点看到这个电影的话，也许没有后来的种种的幼稚。然后我就被颠覆了。 侧耳倾听讲单纯的初恋，互相的鼓励和成长。要是早点看到，就知道原来喜欢一个人可以一起成长的嘛。初中的月岛雯问她姐姐自己的前途，高中的天泽圣司是个会制作小提琴的高手，却说像我这样的水准到处都是，梦想成为工匠大师。月岛雯哭着说，你们走的太快，我跟不上。全片充满治愈，各种感动。看完之后就觉得自己通透了，有些东西想的明白了，这也是这个电影于我的意义。 宫崎骏电影一发不可收拾的继续看下去。风之谷的娜乌西卡人与自然、战争与和平。幽灵公主人与神。龙猫5岁小孩必看。哈尔的移动城堡、千与千寻10岁女孩看得，奥斯卡获奖的。天空之城经典纯音乐的出处。大概就是心灵得到了净化，祛除了很多戾气。变了，变得跟以前不一样了。当然这些电影不只是给小孩子看得，因为主人公实质上都是过得是成人生活，她们独立勇敢而又善良，努力热爱生活，能领略到的。 当厌倦了生活，感觉坚持不下去了，不妨看看宫崎骏，满满的治愈。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"春秋战国：一段你应了解的历史【春秋篇】","date":"2016-05-04T15:16:32.000Z","path":"2016/05/04/春秋战国：一段你应了解的历史【春秋篇】/","text":"春秋有几霸春秋五霸有不同的说法，三种主流的说法涉及人物有八个人，读完春秋史我觉得真正名副其实只有3个人。齐桓公 晋文公 和 楚庄王。 小霸郑庄公平王东迁开始首先有所作为的是郑庄公。郑庄公是个能人，先是打败他妈喜欢的他弟弟郑段，军事外交内政用人能力都很强。以至于可以欺负卫国 宋国 等实力相当的国家。军事上发明鱼丽阵，擅长使用谋略，比如伏击等不合周朝军礼的手段。最牛逼的作为就是打败周天子的王师，对历史进程影响很大。死后子辈争位，郑国渐渐威势渐失，郑国后来沦落为二流国家。并没有称霸之实，只是使郑国成为中原诸国中最强的一国。 首霸齐桓公齐桓公吕小白确有称霸之实。而且使用的方法是尊王攘夷，使用道德感化的方式让各国心服口服，情愿尊齐国为领袖。吕小白线索里最重要的莫过于管仲，管仲是个神人各方面才能都很优秀。带领齐国改革，富国强兵。吕小白能耐不大，从他晚年不是英雄的惨死就看的出来，但是他从谏如流，恢弘的气度，不是常人可比。在位期间使齐国国土面积扩大，亲身两次北上攻打蛮夷，深入不毛，九死一生。并且把打下的蛮荒之地转手送给了当时弱小的燕国。这也是为什么燕国后来可以跻身战国七雄的重要原因。谥号桓，伟大的君主。晚年没了管仲他竟然被儿子饿死。死后诸子争位，齐国内乱，从霸主地位跌落下来，但仍然不失为一流国家。 虚名霸主宋襄公宋襄公纯熟扯淡的虚名霸主。宋襄公的偶像是齐桓公，所以就做了一个满口仁义道德的君子。只会仁义道德没有强大的国力或者过人的能力是不可能做到齐桓公那样的。打仗败给楚国，搞会盟想做老大还被楚国人抓了。他有个弟弟宋目夷倒是有点能耐的，多次在关键时刻提出正确的想法，但宋襄公一心要做君子，不采纳。所以宋国始终就是二三流的水平。 传奇霸主晋文公晋文公重耳是个传奇霸主。他老爸晋献公是个猛人，一生灭国18。重耳因为骊姬乱政的原因逃亡国外，一逃就是19年，流亡各国，受尽磨难。始终跟随他逃亡的7个人当中有后来赵国的先祖，魏国的先祖。还有寒食节纪念的人介子推。这场逃亡是个传奇，更是奇迹。后来终于在秦穆公的帮助下回国当国君。再后来在城濮之战退避三舍打败楚国，一跃成为执天下牛耳的超级大国。真正意义上的称霸。但后来晋国公族大权旁落，被六卿架空，最终分裂成三晋。重耳本人就是个牛人，人格魅力很大，才会有那么多人帮助他。重耳之后直到三家分晋晋国都是与楚国并列的超级大国。 楚庄王一鸣惊人楚庄王熊侣。楚国是蛮夷之国，所以敢称王。因为在南方的广袤土地上当时并不开化，国土面积越打越大，不遵守周礼所以随意攻灭小国。楚庄王上台之初楚国奸臣当道，所以他把自己伪装起来，伪装成一个不理朝政的昏君来看清谁是忠臣谁是奸臣。终于三年之后一鸣惊人，任用贤良打击奸臣。整肃内政。任用孙叔敖等人，在重耳死去之后与晋国的邲之战打败晋国，使楚国成为与晋国相当的超级大国。 西戎霸主秦穆公秦穆公嬴任好。嬴任好求贤若渴，用5张羊皮得到百里奚。百里奚又推荐蹇叔。秦国在西部边陲待腻歪了就想争霸中原。首先就是挡住东出之路的晋国，于是嬴任好就想通过控制晋国，好借路东出。后来才有了他护送重耳归国的事情。但是重耳不是池中之物。晋国强大了，秦国没有半点好处。后来晋秦合围郑国，就有了我们以前学过的烛之武退秦师这篇文章。再后来嬴任好打算飞夺郑国，一意孤行，1万人被翻脸的晋国在崤之战全歼。嬴任好东进不成，之好去打西戎，被周王封为西戎霸主。算不上真正的霸主。 吴王阖闾吴王阖闾吴光。吴国，一闪而逝的春秋巨星。晋国是吴国的同盟，派人教吴人中原先进的技术，让吴人骚扰楚国。吴光得到伍子胥的帮助，派遣专诸刺僚，通过政变的方式当上吴王。又有孙武的帮助富国强兵，吴光本人也勤俭节约。后来终于征集3万人打入楚国本土，柏举之战3万打20万大胜楚军，攻入楚都郢城，声震天下。楚国反扑才退兵。此后吴国修养生息，直到夫差上位打败越国，又开始北上争雄，后来黄池会盟达到可以与晋国平起平坐，但此时越国已经偷袭吴国，吴国就在此后数年灭亡。吴国虽然闪耀一时，但是却又瞬间灭亡，也算不上霸主之实。 越王勾践越王勾践。勾践早有范蠡和文种辅佐，但是越王不听劝谏，终于引来兵败被围。又因为有范蠡和文种，他才选择为吴王奴。越国只被允许有3000甲士防卫之用。勾践及范蠡都去吴宫做奴隶。忍辱负重三年，甚至去尝吴王大便，才换来夫差的信任被放回国。回国后卧薪尝胆，依靠伐吴九术，以身作则与民同苦，又靠越女剑和进献西施终于在吴王将兵在外偷袭姑苏城得手，之后奋战数年才灭亡吴国。但是勾践只是做到灭亡吴国震动天下，没有名副其实的去争霸。但他的传奇经历也足以是他成为春秋时代的巨星之一。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记01【青年节】","date":"2016-05-04T13:30:07.000Z","path":"2016/05/04/日记01【青年节】/","text":"央视新闻说青年节放半天假，14-28周岁都放假，不过跟我们没有关系。51回来之后事情好多，有点忙不过来。在淘宝淘了些东西，都是从知乎上看来的。 淘宝购物清单 桌上书架 很笨重，益乐新村快递站点真是少，就几个通，韵达，天天等有站点。他们给我用的宅急送，真是醉了。然后送到公司，拖回来感觉手臂都不是我的了，十几公斤重啊！ 鞋架 现在淘宝卖的都是有遮尘布的,挺好的。 脏衣袋 实用 台灯 省电护眼用的，当初来住的时候，匆忙就决定了，桌子不舒服，凳子不舒服。想要自己添置，空间又太小。打算等房东装修好4楼，上去住了，房子一定要大一些才行。 所思与所想书读不完，总是想着买书。比如重新学C语言,再看看算法。又想着要看一下数据科学与Python,还想买一些闲书看看。现在真是后悔大学那么好的时光没有做点有意义的事情，最起码读点书唉。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]}]