[{"title":"比利林恩的中场战事","date":"2017-02-24T15:11:16.000Z","path":"2017/02/24/比利林恩的中场战事/","text":"一部描述美国真正的参战士兵心境的电影。 在美国，有很多参战过的士兵，患有跟战争有关的心里疾病，称为战争后遗症，没参与过战争的人无法理解。 比利林恩数次落泪，因为他通过短暂的中场休息，看清了自己和这个国家的本质，看清了人们无法理解自己，看清了宿命。透过他的视角，是否能让人们能反思战争。 附上片尾音乐。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"追风筝的人","date":"2017-02-24T14:17:18.000Z","path":"2017/02/24/追风筝的人/","text":"经典无愧为经典。 早在我大学时代，这本书长期是学校图书馆里借阅榜第一。去年在朋友圈里看到一个朋友发的出自书中的一句话。 我看见镶木板的墙上挂着照片，照片中的人都将成为我的亲人。 配文：阿米尔到索拉雅家中提亲。那时我便将书购来，拖了很久，终于看完。 之所以没能一气呵成读完，我认为是这样的原因。前面部分描述的一直是安静祥和的小孩之间的真挚友谊，虽然处处预示着将会发生悲惨的事情，但着实是陌生的另一个国家的事情，难免让人感到晦涩、不理解。直到某次乘车途中，读到了发生的那件惨事，一发不可收拾读到大半。再后来，当我把此书列入计划中，方才读完剩下的部分。最后一部分，本来看得我觉得这书可能也就中上水平了，没有传说的那么神，但是后面纷至沓来的一波高潮，改变了我的看法，这本书是实至名归的上上之作。 我庆幸自己有足够的理解能力，能读到书中想表达的东西之一，人性。 没有良知、没有美德的人不会痛苦。 我想我们普通人都是有良知、崇尚美德的人。我们想努力弥补的都是我们愧疚的东西。诚然，有的人面对愧疚，选择逃避。但是，这种人内心深处是有创伤的，他/她们的灵魂是不完整的，当他/她们遭遇不幸，他/她们是容易怀疑人生的。敢于弥补愧疚的人都是勇敢的人，当他/她们完成赎罪，伤口会自愈、灵魂会完整，也便活出了人生的最高境界。 而是对生活曾有过的黑暗忍气吞声的照单全收。 哈桑、索拉博、无数承受战火的阿富汗人，作者还表达了悲悯。哈桑忍受着一切，哈桑依然是那个深爱着阿米尔的哈桑，就像他热爱生活一样。当你经历过地狱，并且从那里走出来，你将无所畏惧。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"阿甘正传","date":"2017-02-22T14:37:36.000Z","path":"2017/02/22/阿甘正传/","text":"印象中这是一部励志电影。 以我粗浅的阅历来看，美国的励志电影中的励志跟我们印象中的励志是不一样的。通常关于刻苦、努力啊基本不说，说的多的往往是运气或者天赋。这类电影通常更多的是探讨生命的意义，你要说它是励志电影真的是不走心。这是一部探讨残障人士的生命的意义的电影。 电影中有一段台词可以作为点睛之笔，摘录如下。 是否我们每个人 都有注定的命运 还是我们的生命中只有偶然 像在风中飘 但我想 也许两者都有吧 也许两者都同时发生着 我们每个人都有着好的或者不好的命运，但人生仅仅是这样吗？不是啊，还有偶然，就像那片随风漂浮的羽毛，时而扬起，时而下落，最终还会落地。我们能做的只是在风雨中承受着这一切，就像詹妮像鸟一样飘零、中尉在飓风中咆哮、羽毛飞舞…","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"国境以南太阳以西","date":"2017-02-20T14:26:18.000Z","path":"2017/02/20/国境以南太阳以西/","text":"文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。 借由其中一首歌在网易云音乐上的热评剧透作为读后记吧。 结尾泉的出现更让我觉得岛本或许真的就不存在。从国境以南来，到太阳以西去，可能岛本只是初一厢情愿的幻象吧。不得不说，初活出了大部分人的理想，有一个带你尽人事尝甘涩的初恋，有一个陪你立黄昏问你粥可温的爱人，有一次让你甘愿放弃一切的精神出轨，有一次回到现实却无奈下半身的肉体出轨。 附上书中反复提及的钢琴三重奏。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"半世伶俜空自许","date":"2017-02-19T13:15:39.000Z","path":"2017/02/19/半世伶俜空自许/","text":"读史使人明智，读诗使人灵秀，数学使人周密，科学使人深刻，伦理学使人庄重，逻辑修辞使人善辩，凡有所学，皆成性格。–培根 查阅寒伧（chen，同寒碜）时，相关词汇给到了伶俜（líng pīng），查伶俜看到了一首诗。 冰骨云绡雪数枝，清幽香冷与尘离。 深山有韵风摇影，古涧无人月弄姿。 半世伶俜空自许，一生风雨却谁知。 都言此萼非凡数，谁道花中最是痴。 这不是一首古诗，而是一位小才女写的诗。多好的诗啊。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"桃栗三年柿八年","date":"2017-02-19T06:43:14.000Z","path":"2017/02/19/桃栗三年柿八年/","text":"是枝裕和的风格就是讲述平凡的、淡淡的生活，讲述生活的本质。这个故事与电影海街日记一样充满温情。 小学生集体大出逃，7人和一只死了的狗，开始了一段冒险之旅，为了在新干线列车交错的地方许下愿望，让奇迹发生。 这是一个儿童题材的故事，火山灰、波斯菊、燃放的烟花、种子、生活中的一切事物，你喜欢也罢，不喜欢也罢，你通通要接受。生活也是一样，你也必须接受。 也许所谓的奇迹只是需要发泄而已。学会接受讨厌的事物，就是成长。 桃栗三年柿八年，达摩九年我一生。 书中出现的一句台词，原来是一句日本诗。人生需要时间的积累，才会开花结果。 小说是根据电影剧本写出来的，而电影是为了纪念九州新干线全线通车所拍的广告。你不得不佩服这位导演，一个广告电影，一个命题作文，选择了这样的题材，拍出了这样的作品，除了赞叹还能说什么呢。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"极简欧洲史","date":"2017-02-17T14:55:42.000Z","path":"2017/02/17/极简欧洲史/","text":"销量高不一定就好，充其量是对中学世界史的一点回顾。 副标题为为什么欧洲文明对现代文明影响这么深？我来回答一下这个问题。 因为欧洲工业革命，因为大航海，因为殖民。为什么欧洲能近代能够先崛起？因为科学的发展。为什么欧洲人能发明科学？因为欧洲古代有牛人，然后出现了文艺复兴。 这本书单只讨论了近代欧洲文明为什么能超越亚洲文明。给出的解释是：欧洲多国林立，强敌环饲，所以向海上扩张。王权为打压贵族，倚重商贾与科技。中欧一直小国并存，人才可以充分发挥才能，为文艺复兴打下基础。 从另外一角度讨论，中国历代关于科学的著述，偏向于经验总结。而欧洲则是科学方法论，欧洲有逻辑体系和实验方法2个方法论，这才是欧洲可以爆炸性增长的原因。 我们都知道古希腊罗马，罗马的灭亡是因为日耳曼蛮族入侵。蛮族在侵占的土地定居下来，罗马皇帝无地可辖所以才灭亡。所谓中世纪指西罗马帝国灭亡之后的一千年，日耳曼人建立国家，加入基督教，欧洲多国林立。 第二次入侵来自穆斯林，占领欧洲东部，跨越地中海控制到南欧的西班牙。所谓十字军东征即是征讨穆斯林，夺回圣地耶路撒冷。耶路撒冷是基督教发源的地方。 第三次入侵是来自北欧的维京人，维京人使用长船沿河掠夺，后来也定居下来。 英国原住民叫凯尔特人，日耳曼人、维京人入侵之后，才形成英语。 法国是由法兰克王国一分为三后才形成的。而另一支德国却很晚才统一。原因是教皇跟皇帝的争斗导致很分裂。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"马云山教练","date":"2017-02-17T14:36:54.000Z","path":"2017/02/17/马云山教练/","text":"又历时2天，终于可以写点了。这个主题不错吧！当然我没有功夫去学自己打造主题（摊手）。来不及了，车已经出发了。 马教练56岁，做教练20多年。很是健谈、做事麻利、头脑灵光、视野广阔、照顾后辈，当然这个年龄的人一般都会照顾后辈。 再谈公职人员态度。一个跟年期大妈一般态度恶劣，还是年轻好，对，年轻的好！","tags":[{"name":"琐事","slug":"琐事","permalink":"https://amasawaseiji.github.io/tags/琐事/"}]}]