[{"title":"读【小王子】","date":"2017-06-07T16:57:32.000Z","path":"2017/06/08/读【小王子】/","text":"2万多字很短的童话，我读来也没太大的感觉。关于里面的玫瑰、狐狸、哲理等别人也说得很多了，总之这是一个忧郁的童话。 知道这本书是在匆匆那年电视剧开始的，知道是名著。这让我想起了匆匆那年这个电视剧，电视剧是好看的，当时我还去看了小说，也不错。然后这令我想起跟青春有关的事情，那些纯真的感情和令人忧郁的回忆。 想起旧夏天，短短的身影，充满美好的回忆，仿佛那些炎热的日子从来都是清凉的。 想起童年，风雨骤来，大风刮起，泡桐树的花朵落在地上，我们释放自我的疯跑，记忆深处的一幕幕浮在眼前。 还有，这本书的作者，传奇的一生，无外乎能进入先贤阁。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"小倩的故事","date":"2017-06-05T12:44:56.000Z","path":"2017/06/05/小倩的故事/","text":"看了倩女幽魂，觉得跟我读的小倩的故事差别太多，于是重新翻了下小倩原文。 兰若寺我大学金华读书，学校就在金华北郊。记得当前学校里平山坡种花的时候，挖出过古墓，就有新闻说是聂小倩的墓。荒唐搞笑，但也有原委。小倩中说，兰若寺在金华北郭，就是金华城城北。结果电影中只字没提金华，倒是有个北郭县，搞笑了。兰若一词在聊斋中出现过10多次，大概是泛指寺庙，并不一定真的在金华城北有个兰若寺。又有说法说在兰溪，金华下辖的一个县级市，有个兰若寺，我觉得不过是后人杜撰，因为原文中提到一个兰溪生来金华考试，所以这个寺庙绝不会在兰溪。 宁采臣，原文中说他从金华坐船回家，金华有个金华江，自西向东流。我猜测宁采臣可能就是金华附近的某个县市人，不会太远，或者是东边或者是西边。小倩，原文中没有交代，猜测就是金华本地人。 原文梗概宁采臣，浙人，性格慷慨豪爽，品行端正。经常对人说：生平无二色(我不会喜欢第二个女人，这一点也救了他，虽然后来食言了)。学政来金华考察学子的情况，所以宁采臣到了金华去，城中租房子贵，他就到兰若寺来了。恰好碰到了燕赤霞，燕赤霞是秦人。晚上，宁采臣睡不着，听到外面有人说话，就去看，发现有40多个女的在那边，一个姥姥，还有一个叫小倩的女子。然后宁采臣以为是住在这里的邻居，就回去睡觉了。过了一会，小倩来了，笑着说：月夜不寐，愿修燕好。(有月亮的晚上睡不着，不如咱们滚床单)。宁采臣是个知廉耻有道德的人，坚决不干，叫小倩走，又威胁小倩说，你再不走，我喊人，喊燕赤霞来。小倩退出去，又扔一锭金子进来，宁采臣说，不义之财，弄脏我口袋。小倩自言自语说：这个人真是心如铁石。 接着两天，来了个兰溪生和他的仆人，都被害死了。接着一个晚上，小倩又来了，跟宁采臣说，我看你是圣贤，不敢欺骗你，说自己是18岁夭折，埋在这里，被妖怪逼迫，用美色取人性命。他怕夜叉来杀宁采臣，叫他跟燕赤霞同住，就可以免灾祸。又说，叫宁采臣把她的朽骨藏在安全的地方。 晚上，妖怪来了，被燕赤霞的箱子中的小剑打伤，留下血迹逃跑，燕赤霞说他是个剑客。(根本没有什么大战，黑山老妖之类，燕赤霞也根本没有出手，是剑自己跳出去杀妖怪的) 第二天，到了寺北，找到小倩墓穴，宁采臣谎说自己的妹妹葬在这里，发掘出骨头，用衣服包裹住。他还想跟燕赤霞学剑，燕赤霞说你命中是富贵人，不是我道中人，把剑袋送给他。宁采臣坐船回家。 归去，把小倩葬在自己书房外面的荒野上。然后小倩出现了，小倩谢说，愿意认识公婆，给你当婢妾。宁采臣看见小倩，肌映流霞，足翘细笋，非常娇艳。于是带她见母亲，宁采臣本来有妻子，病了。母亲一开始很害怕，见小倩绰约可爱，才敢跟她说话。(也看脸)但是只有宁采臣一个儿子，要传宗接代，不敢叫他娶鬼妻。于是小倩就说，愿意认宁采臣为兄长，侍奉母亲。小倩开始代替母亲做家务，到了晚上，母亲还是害怕，不给小倩铺床铺被，小倩就回荒野了。小倩到了宁采臣书房，说自己小时候读过经书，就读宁采臣的书。到了二更还不愿意去，宁采臣催她，她才说害怕一个人住荒墓。以后就天天白天来做家务，晚上读经书，觉宁将寝，始惨然去(觉得宁采臣要睡觉了，才惨然离去)。 没多少天，宁采臣妻子去世，母亲业与小倩相处越来越好。过了一年余，母亲想要纳小倩，小倩得知，就说，我因为不愿意祸害人才跟宁采臣来，想要跟着过几年，能得到个诰命夫人，光宗耀祖。母亲担心小倩不能传宗接代，小倩说，子女惟天所授，而且宁采臣是个有福的人，能有三个儿子。于是就举办婚礼，请来亲朋好友，大家看到盛装打扮的小倩，都说是仙人。 后来，金华的妖怪来了，幸亏有燕赤霞赠的剑袋把妖怪杀了。又过了几年，宁采臣中了进士，小倩生了2个儿子，宁采臣又纳妾生了一个儿子，三个儿子都做官，有名声在外。 不同电影电视剧改编的都太离谱，原文主要描写的是小倩跟宁采臣回家后生活的情况，电影则是把小倩尸骨带回去安葬就没了。原文是个美满幸福，并且绵延后代的故事。可能是现在看来，聂小倩有小三的嫌疑，所以后面的故事都不说了。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记15【忍耐】","date":"2017-06-04T17:18:03.000Z","path":"2017/06/05/周记15【忍耐】/","text":"本周知道了一件心塞的事情，导致情绪有点低落，好在第二天就好了很多，事情在其他篇也说过了，忍耐是关键。 电影本周看了不少电影，有些写了影评就不说了。其他的有爱乐之城，没有预想的那么好，歌舞的元素还是挺新颖的。卡罗尔也没有b站弹幕说的看了几十遍什么的，可能我对同行题材不感兴趣吧，不太能接受。黑鹰坠落，中央车站，都平平无奇，疯狂动物城有点搞笑，励志到没有。倩女幽魂取胜在演员上，故事不好，原故事比较精彩，只是以现在的价值体系衡量不能拍出来，有机会专门写一篇说一下。 读书关于红楼梦，有一点引发我的思绪。就是下人外人对贾宝玉的评价，说他见人没话，这正戳中我的软肋。我也是这样的，因为这个从小被家长说来说去。现在也没有彻底改变，性格原因吧。每次我回老家，跟家乡的人很少打交道，只跟家人亲戚说话，也不出门串门，觉得以后尽量改一下，家是根，不想做孤魂野鬼。 杂项练车科目三，比较难，熄火多次，被教练骂。我的同事约上了，考过了，我也要加油。 看到别人满世界游玩，自己基本没出去玩过，有点羡慕，将来有机会吧，我还是热爱田园山水的。 跳出环境的限制，想跟优秀的人共事，需要自己先变优秀，才能进的到好的环境中去。千万不可被安逸的现状磨灭了斗志。 本周读书读的不多，读完了一本薄书，坚持每周一本，而且现在斗志更多了，可以加把劲。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"茅庐【两晋风云】","date":"2017-06-04T03:01:52.000Z","path":"2017/06/04/茅庐【两晋风云】/","text":"去年读了纵横十六国和悠悠南北朝两部关于从晋到唐的动乱史。这两部书一个人所写，文笔不是太好，但也比较详细的讲述了这段历史，甚至是每一个小的政权都有清楚的交代。不过读完没有写想法或者笔记，那时候还不知读书要义，就是观其大意、不求甚解，所以耽搁了没有记述。而这本书是豆瓣原创作者茅庐小生的又一系列作品，之前他写的春秋战国系列，到现在也是豆瓣原创区的热门电子书。而且这本书详略得当，只介绍主线，看书的名字，应该只会讲到东晋灭亡，文笔也是很好，目前出了三部。 司马家族不必多说，从高平陵到淮南三叛结束，司马家族的反对者中，只有一个文鸯表现亮眼，勇猛异常。再有就是诸葛诞的得人心，诸葛诞失败之后，他的部下300多人轮流斩头，一个投降的也没有，令人惊异。 灭蜀的时候，卫瓘简直是bug，可以说邓艾、钟会、姜维的死都跟卫瓘有直接关系。首先是抓邓艾，卫瓘到达成都后不是直接就去宣告邓艾的罪名抓人，而是事先让邓艾的部下跟邓艾离心，他跟邓艾的部下说只抓邓艾，跟他们没有关系，让他们不要闹事，然后邓艾就被抓了。钟会跟姜维准备起事，找到卫瓘，卫瓘不愿意，然后泄漏消息给钟会众将的部下说，钟会要全部杀掉他们的将军，引得士兵哗变，钟会、姜维死于乱兵之中。之后，他担心邓艾，派人追上邓艾的囚车，把邓艾杀了。看到这些，简直令人瞠目结舌，然而这样一个善于利用矛盾分化敌人的人，最后死的很憋屈，八王之乱中随便就被政变的藩王搞死了，还认为自己忠心皇帝不会杀自己，没搞清权力已经到了谁的手上。 八王之乱中，有一个叫卢志的谋士才能可以，如果司马颖一直听从他的建议，也不会下场那么惨。另一边，石勒可以称得上乱世枭雄，石勒虽然是羯族人，但是不准胡人欺负汉人，启用汉族士人，算得上是个英主，就是没处理好继承人的问题。西晋王朝最后的皇帝司马邺表现也算不平庸，12岁即位，在关中一带坚持了数年之久，很不容易。另外，还有刘琨与祖逖这对少年好朋友，都没有辜负当初的誓言，在乱世中也奋力为国家做贡献。只是刘琨孤立无援，祖逖后方不稳，都只是一时昙花。 司马睿和王导这对好基友，跑到建康建立了东晋，然后是衣冠南渡，南渡持续百年之久，迁徙人数百万计。今天浙南、福建、江西等地很多都是当时南渡的晋人后裔，我有一个福建的同事，他说他们家就是从晋朝的时候迁移过去的。司马睿是个平庸之主，王导倒是值得称道，王导缓和了江南土著士族与南迁人士的矛盾，使得司马睿能够扎下跟来。只不过东晋也是内乱不断，王敦、苏峻先后叛乱，建康城也是破了重建，战火肆扰。还有就是明帝司马绍，是个难得的英才，举目见日、不见长安的典故就出自司马绍，司马绍的母亲是鲜卑人，所以司马绍长的跟一般汉人有些不同。只不过司马绍继位一年就死了，东晋仅有的一位英主却英年早逝。 石勒去世后，子孙争位，北方大乱。冉闵作为石家养子后人，被羯族人排挤，愤然下了杀胡令，羯族遭遇大劫难，十不存一。但是东晋也不亲近冉闵，冉闵很孤独，对自己的身份认同不清晰。纵然冉闵勇猛过人，很有军事才能，最后被慕容家击败俘虏，仅仅2年冉魏就灭亡，也如一颗流星。","tags":[{"name":"历史","slug":"历史","permalink":"https://amasawaseiji.github.io/tags/历史/"}]},{"title":"算法入门【算法图解】","date":"2017-06-03T14:50:27.000Z","path":"2017/06/03/算法入门【算法图解】/","text":"看的第一本算法书，图很多，讲的很详细，不过觉得讲的有点浅，像是专门给还不是程序员的人看的。 二分查找输入一个有序的列表和一个元素，如果元素包含的列表中返回元素的位置，否则返回null。一般，对于包含n个元素的列表，二分查找需要log2n步，简单查找最多需要n步。 大O表示法，指出了算法运行时间的增速。二分查找表示为O(logn)，括号中叫做操作数。 123456789101112131415161718192021222324252627282930import Foundation// Note: If you aren’t familiar with Comparable, please check out “Generics” chapter in Swift bookfunc binarySearch &lt;T: Comparable&gt;(_ list: [T], item: T) -&gt; Int? &#123; // low and high keep track of which part of the list you'll search in. var low = 0 var high = list.count - 1 // While you haven't narrowed it down to one element ... while low &lt;= high &#123; //... check the middle element let mid = low + (high - low) / 2 let guess = list[mid] // Found the item. if guess == item &#123; return mid &#125; // The guess was too high. if guess &gt; item &#123; high = mid - 1 &#125; else &#123; low = mid + 1 &#125; &#125; return nil&#125;let myList = [1, 3, 5, 7, 9]print(binarySearch(myList, item: 3) ?? \"Not Found\") // =&gt; 1print(binarySearch(myList, item: -1) ?? \"Not Found\") // =&gt; Not Found 选择排序数组预留位置是一种权变措施，可能浪费内存，超过这个值，需要转移。链表元素的内存可以在任何地方，数组是连续内存。链表每个元素存储了下一个元素的位置，链表的优势在插入元素方面，查找元素链表效率低。O(n)叫线性时间，O(1)叫常量时间。删除链表也是优势。数组可以随机访问，链表顺序访问。 选择排序速度不是很快，运行时间为O(n2)。 123456789101112131415161718192021222324252627282930313233343536import Foundation// Finds the smallest value in an arrayfunc findSmallestIndex &lt;T: Comparable&gt; (_ arr: [T]) -&gt; Int &#123; // Stores the smallest value var smallest = arr[0] // We don't need any calculation if the array lenght is 1 if arr.count == 1 &#123; return 0 &#125; // Stores the index of the smallest value var smallestIndex = 0 for i in 1...arr.count-1 &#123; if arr[i] &lt; smallest &#123; smallest = arr[i] smallestIndex = i &#125; &#125; return smallestIndex&#125;// Sort arrayfunc selectionSort &lt;T: Comparable&gt; (arr: [T]) -&gt; [T] &#123; var newArr: [T] = [] // We have to make mutableArray reference copy of original array, because Swift 3 doesn't allow to get var parameter var mutableArr = arr for _ in 0...mutableArr.count-1 &#123; //Finds the smallest element in the array and adds it to the new array let smallestIndex = findSmallestIndex(mutableArr) newArr.append(mutableArr[smallestIndex]) mutableArr.remove(at: smallestIndex) &#125; return newArr&#125;print(selectionSort(arr: [5, 3, 6, 2, 10])) // =&gt; [2, 3, 5, 6, 10] 递归递归函数有基线条件和递归条件，基线条件指的是函数不再调用自己，避免无限循环。递归指的是调用自己。 尾递归 123456789101112import Foundationfunc fact(x: Int) -&gt; Int &#123; if x == 1 &#123; return 1 &#125; else &#123; return x*fact(x: x-1) &#125;&#125;print(fact(x: 5)) // =&gt; 120 快速排序分而治之D&amp;C，递归式解决方法。 欧几里得算法 涉及数组的递归基线条件通常是数组为空或只有一个元素。 Haskell，使用递归多，函数式编程。 快速排序比选择排序快，平均运行时间为O(nlogn)，也是最佳时间，每次都随机选择一个元素作为基准值就可以。 合并排序或者也叫归并排序 也是O(nlogn)。 123456789101112131415161718192021import Foundation//The following implementation of quick sort is little more classic than described in the book, but we have two use this one because of some “slice” feature limitation with array on Swift 3. Main concept is the samefunc quicksort &lt;T : Comparable&gt; (_ array : [T]) -&gt; [T] &#123; if (array.count &lt; 2) &#123; // base case, arrays with 0 or 1 element are already \"sorted\" return array &#125; else &#123; // recursive case let pivot = array[0] // sub-array of all the elements less than the pivot let less = array.filter &#123; $0 &lt; pivot &#125; // sub-array of all the elements equal to the pivot let equal = array.filter &#123; $0 == pivot &#125; // sub-array of all the elements greater than the pivot let greater = array.filter &#123; $0 &gt; pivot &#125; return quicksort(less) + equal + quicksort(greater) &#125;&#125;print(quicksort([1, 5, 10, 25, 16, 1])) // =&gt; [1, 1, 5, 10, 16, 25] 散列表散列表、散列映射、映射、字典、关联数组，不同的叫法一个概念。应用DNS解析、网页缓存。2个键映射到同一个位置，给这个位置用链表。散列函数将键均匀映射到不同位置，避免冲突。插入删除与链表一样快，查找与数组一样快。填装因子度量的是散列表中的空闲位置，填装因子变大，需要调整长度，通常将数组长度增大一倍。填装因子大于0.7就需要扩增散列表长度。 SHA函数 用作散列函数。 广度优先搜索最短路径问题，用于图查找。运行时间为O(V+E)，V是顶点，E为边数。 队列FIFO，栈LIFO。 有向图，无向图。有依赖关系，叫拓扑排序。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293import Foundation// As I can see Swift doesn't have Queue default implementation, so we have to use custom on, Degue structure from Swift Algorithm Club// https://github.com/raywenderlich/swift-algorithm-club/tree/master/Dequepublic struct Deque&lt;T&gt; &#123; private var array = [T]() public var isEmpty: Bool &#123; return array.isEmpty &#125; public var count: Int &#123; return array.count &#125; public mutating func enqueue(_ element: T) &#123; array.append(element) &#125; public mutating func enqueueFront(_ element: T) &#123; array.insert(element, at: 0) &#125; public mutating func dequeue() -&gt; T? &#123; if isEmpty &#123; return nil &#125; else &#123; return array.removeFirst() &#125; &#125; public mutating func dequeueBack() -&gt; T? &#123; if isEmpty &#123; return nil &#125; else &#123; return array.removeLast() &#125; &#125; public func peekFront() -&gt; T? &#123; return array.first &#125; public func peekBack() -&gt; T? &#123; return array.last &#125;&#125;func persionIsSeller(name: String) -&gt; Bool &#123; return name.characters.last == \"m\"&#125;var graph = [String : [String]]()graph[\"you\"] = [\"alice\", \"bob\", \"claire\"]graph[\"bob\"] = [\"anuj\", \"peggy\"]graph[\"alice\"] = [\"peggy\"]graph[\"claire\"] = [\"thom\", \"jonny\"]graph[\"anuj\"] = []graph[\"peggy\"] = []graph[\"thom\"] = []graph[\"jonny\"] = []func search(name: String) -&gt; Bool &#123; var searchQueue = Deque&lt;String&gt;() //Swift Note: Our custom Deque doesn't have possibility to add new element as array so we have to add elements one by one (insted of +=graph[\"person\"] in the book example) for string in graph[name]! &#123; searchQueue.enqueue(string) &#125; // This array is how you keep track of which people you've searched before. var searched = [String]() while !searchQueue.isEmpty &#123; let person = searchQueue.dequeue() // Only search this person if you haven't already searched them if !searched.contains(person!) &#123; if persionIsSeller(name: person!) &#123; print(\"\\(person!) is a mango seller!\") return true &#125; else &#123; for string in graph[person!]! &#123; searchQueue.enqueue(string) &#125; // Marks this person as searched searched.append(person!) &#125; &#125; &#125; return false&#125;if search(name: \"you\") == false &#123; print(\"Mango seller Not Found!\")&#125; // =&gt; thom is a mango seller! 狄克斯特拉算法非加权图用广度优先搜索，加权图使用狄克斯特拉算法。环增加权重，不可能是最短路径。狄克斯特拉适用于有向无环图。负权边不能用狄克斯特拉，得用贝尔曼-福德算法。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778import Foundation// the graphvar graph = [String : [String: Double]] ()graph[\"start\"] = [String: Double]()graph[\"start\"]?[\"a\"] = 6graph[\"start\"]?[\"b\"] = 2graph[\"a\"] = [String: Double]()graph[\"a\"]?[\"fin\"] = 1graph[\"b\"] = [String: Double]()graph[\"b\"]?[\"a\"] = 3graph[\"b\"]?[\"fin\"] = 5graph[\"fin\"] = [String: Double]()// the costs tablelet infinity = Double.infinityvar costs = [String: Double]()costs[\"a\"] = 6costs[\"b\"] = 2costs[\"fin\"] = infinity// the parents tablevar parents = [String: String]()parents[\"a\"] = \"start\"parents[\"b\"] = \"start\"parents[\"fin\"] = nilvar processed = [String]()func findLowestCostNode(costs: [String: Double]) -&gt; [String: Double] &#123; var lowestCost = Double.infinity var lowestCostNode = [String: Double]() // Go through each node. for node in costs &#123; let cost = node.value // If it's the lowest cost so far and hasn't been processed yet... if (cost &lt; lowestCost) &amp;&amp; !processed.contains(node.key) &#123; // ... set it as the new lowest-cost node. lowestCost = cost lowestCostNode = [node.key : node.value] &#125; &#125; return lowestCostNode&#125;// Find the lowest-cost node that you haven't processed yet.var node = findLowestCostNode(costs: costs)// If you've processed all the nodes, this while loop is done.while !node.isEmpty &#123; // Swift Note: Unfortunately there are some limits for working with Dictionary inside Dictionary, so we have to use temp \"nodeFirstKey\" variable as workaround var nodeFirstKey = node.first?.key var cost = costs[nodeFirstKey!] // Go through all the neighbors of this node. var neighbors = graph[nodeFirstKey!] for n in (neighbors?.keys)! &#123; var newCost = cost! + (neighbors?[n])! // If it's cheaper to get to this neighbor by going through this node... if costs[n]! &gt; newCost &#123; // ... update the cost for this node. costs[n] = newCost // This node becomes the new parent for this neighbor. parents[n] = nodeFirstKey &#125; &#125; // Mark the node as processed. processed.append(nodeFirstKey!) // Find the next node to process, and loop. node = findLowestCostNode(costs: costs)&#125;print(\"Cost from the start to each node:\")print(costs) // -&gt; [\"b\": 2.0, \"fin\": 6.0, \"a\": 5.0] 贪婪算法每步都选择最优做法，结果与正确结果接近。集合问题的贪婪算法，O(n2)。NP完全问题，需要计算所有的解，选出最好的。NP只能求近似解，非NP能容易算出解。组合、序列、集合可能是NP完全问题，需要考虑所有情况不能分解，数量多变复杂速度变慢。 123456789101112131415161718192021222324252627282930313233import Foundation// You pass an array in, and it gets converted to a set.var statesNeeded : Set = [\"mt\", \"wa\", \"or\", \"id\", \"nv\", \"ut\", \"ca\", \"az\"]var stations = [String: Set&lt;String&gt;]()stations[\"kone\"] = [\"id\", \"nv\", \"ut\"]stations[\"ktwo\"] = [\"wa\", \"id\", \"mt\"]stations[\"kthree\"] = [\"or\", \"nv\", \"ca\"]stations[\"kfour\"] = [\"nv\", \"ut\"]stations[\"kfive\"] = [\"ca\", \"az\"]var finalStations = Set&lt;String&gt;();while !statesNeeded.isEmpty &#123; var bestStation = String() var statesCovered = Set&lt;String&gt;() for station in stations &#123; var covered = statesNeeded.intersection(station.value) if covered.count &gt; statesCovered.count &#123; bestStation = station.key statesCovered = covered &#125; statesNeeded = statesNeeded.subtracting(statesCovered) //Swift note: We should avoid adding empty station to Set if !bestStation.isEmpty &#123; finalStations.insert(bestStation) &#125; &#125;&#125;print(finalStations) // -&gt; [\"kone\", \"kfive\", \"ktwo\", \"kthree\"] 动态规划求最优解，画网格图。依赖于子问题是离散的。应用，DNA相似性、git、diff、拼写检查等。 K最近邻算法KNN，分类和回归，分类就是编组，回归是预测。余弦相似度，计算矢量距离。KNN用于机器学习，OCR，人脸识别，语音识别。训练数据。朴素贝叶斯分类器预测垃圾邮件概率。 其他算法二叉查找树，O(logn),插入删除也快，不能随机访问。B树、红黑树、堆、伸展树。搜索引擎，反向索引。傅里叶变换，压缩音视频，地震预测、DNA分析。并行算法。MapReduce,分布式算法，短时间内完成海量工作。布隆过滤器是概率性数据结构，答案不一定准确，占用存储空间小。SHA，根据字符串返回散列值，比较文件，检查密码，simhash，局部敏感，检查相似程度，如论文查重。RSA加密。","tags":[{"name":"计算机科学","slug":"计算机科学","permalink":"https://amasawaseiji.github.io/tags/计算机科学/"}]},{"title":"不吐不快","date":"2017-06-02T16:39:01.000Z","path":"2017/06/03/不吐不快/","text":"2天晚上没看书，糟心事一大堆，不吐不快。 实在是难以排解，然而却又无人可说，不得不在这儿一吐为快了。 首先，我怪我自己。从去年年初来到杭州，辛苦找工作，当时心情很绝望。所以有第一家公司肯收留我，我也不管三七二十一就进来了，并且一心没想着要多少工资，我的初心是学到技术然后拍拍屁股走人。刚开始很紧张也很开心，除了自己的计划没有执行，此懒惰一也。我本计划利用几个月迅速学到深一点的层次，达到能够轻松应对普通面试的程度。并且一下买了好些书、资料。也看了一点，可惜的是一个月后就开始懈怠，每天晚上回来看电视剧、看杂书麻痹自己，以免于看不想看的专业书。时间很快到了夏季，夏季连续3、4个月是工作攻坚，自己也有些一根筋，全部时间投入工作中，想着可以做的完美一些。转眼到了10月份，这个时候跳槽已经不可能，就想着用几个月再深入学一下，来年初换工作。然后就开始了玩游戏，此懒惰二也。时至年尾，因为一些事戒掉了游戏。今年过来，不得不重新开始继续没怎么开始的深入学习，然后先是有学车造成的时间短缺，更大的是精神压力，现在学车完全是因为我爸想叫我买车。说句题外话，通过这件事，我觉得我爸就像活在梦里一样，哪里来的钱买车，还叫我找女朋友结婚，考虑过现实吗？想想都觉得不可理喻，人家争口气是自己争口气，不是指望后代啊。我是您生的不错，我是一个有独立人格的人，不会任您摆布好吗？回到主题，也开始看了一部分书，现在加起来已经比去年多了，这个计划一拖就是一年。到现在预计8月份可以重新找工作。 其次，说一下什么事情。最近在加工资，顺便得知了一些同事们工资的情况，不例外，我是最低的。我知道我当初要的起薪就很低，因为没想过要多少工资，能活得下去就行。可是他们本身工资就不错，以我现在来看也不错，我跳槽也不过是这些，然后他们还成天说自己工资低。特别是我的一个同事，他写的代码格式都不规范，很明显没有受过正规训练。举个例子，他会用拼音来命名变量名，我是面试官这种类型能打到十八层地狱去，但是我能去说他吗？在我跟领导聊天中，领导问我从他身上学到些什么？excuse me?那一刻我要是没有产生跑路的想法，鬼也不信。然后呢，他起薪就很高，那时候正是互联网热火朝天的时候，什么人都能随便领个高工资。我就业的时候，已经是泡沫了，找工作真是难。时也，命也。我当然不平衡，所以唯有跑路才能缓解这个情况。这个事情激励了我，也敲响了警钟。 最后，昨天2个小时前，还是昨天的23点，测试忽然钉钉上发给我bug，并且说叫我尽快解决，边上有电脑就立刻做的意思。我照做了，然后这个人就再也联系不上了，估计是睡觉去了。牛逼，是谁也忍不了，不对他产生情绪也是不可能。大半夜的忽然找你，完了又联系不上了，这不是耍人吗？这个测试的槽点太多，不吐槽了。我想，跟组里的同事一样，我们跑路他也是原因之一。 好了，话已说完，心情舒畅，睡觉去也。","tags":[{"name":"心事","slug":"心事","permalink":"https://amasawaseiji.github.io/tags/心事/"}]},{"title":"初读【红楼梦】","date":"2017-05-31T11:40:17.000Z","path":"2017/05/31/初读【红楼梦】/","text":"这本书从开始看，到看完80回，断断续续持续了将近一个月，终于在一天晚上的凌晨读完了。很想看后续剧情，但很可惜，后续遗失了，不得不说是一场伟大的悲剧。 先看完刘心武的揭秘红楼梦，再读完的80回本红楼梦。因为看了刘心武，知道了曹雪芹实著80回，因此后面的也就不再看了。也从81回看了一点，发现文笔已经较为粗陋，很容易看出是后人杜撰。这就如同你看完了金庸的小说，再看一些金庸伪作一样，一分一毫也是读不下去。 很多人说刘心武讲的不好，太牵强。我也不敢发表自己的看法，因为我也没有看法。姑且不论刘心武怎么说，从我自己的角度讲一讲读书的过程中，对一些人的看法和体会。 首先是贾宝玉，人们说贾宝玉娘炮，一点不假。想一下寡人自幼生于深宫之中，长于妇人之手这句话，大概就能明白贾宝玉的性格了。说的好的，说贾宝玉有绅士风度，关心边缘人物，悲天悯人等。不好的，看下人对他的评价就知道了，说他见人没话，对下人没有威严。观他的作为，打女人，当然我们不能以成年人的视角要求一个古人，对他表示理解。还有，他帮不了他想帮助的下人，迫于封建礼法，对他也表示理解。总之，这个人懦弱，娘炮是跑不了的。 林黛玉，个人无感，无喜无厌。 薛宝钗，先喜后厌。以怎样的姿态活在那个世界是人的自由，可以有心计，八面玲珑，没什么不好。当她在林黛玉面前，向薛姨妈撒娇时，为林黛玉不喜欢她。当她对刚悲惨死去的尤家姐妹漠不关心时，替尤家姐妹不喜欢她。固然她很完美，但是她不显示真性情，就很难打动人心。 王熙凤，无感到厌。替尤二姐厌。 柳湘莲，赞赏到厌。柳湘莲痛打薛蟠，真伟丈夫也。以友情定婚姻，有古之士人风范。及至疑而退婚，光环一落千丈。士人不为人所疑，更不用说怀疑别人。 贾琏，除了好色，还是个挺正派的人物。 王夫人，全书最大毒瘤，封建女德的贯彻执行者。从这一点说，赵姨娘这个坏人都不及她。 袭人，没看到晴雯之死，一直挺喜欢她的，直到晴雯去世，宝玉哭晴雯，终于露出了马脚，原来对晴雯这么无情啊。 晴雯，可惜了的。死的时候，写的也太逼真了，作者绝逼亲眼见过，想起了沈复笔下的陈芸。 贾迎春，懦弱的人，被封建礼教迫害的人。 贾惜春，就是个自私的人。据说下场也挺惨的。 贾探春，有心计有口舌，到哪里也是强人。这才是混封建社会该有的样貌。 平儿，全书最喜欢的人。手里有权，心中良善，能做到这样，实属不易。 史湘云，最真，最没有毛病，也是全书最喜欢的人。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"心灵捕手","date":"2017-05-29T15:16:28.000Z","path":"2017/05/29/心灵捕手/","text":"无聊的一个晚上，偶然间看了这部电影，跟随主人公经历了一场心灵的旅程。 开头我想到，这不会又是说天才是天生的，毕竟美国的学霸都是靠聪明的。看到后面才知道，这是一部关于心理学的电影。 当看到，老师不断重复说出，那不是你的错，第三遍我就已经泪湿眼眶。罕见的泪湿眼眶。这个电影可能在我今年的观影生涯中已经占据了主要的位置。 为什么会泪目，每个人心中都有最柔软的地方，恐惧被说出来。一旦被说出来，我们辛苦营造的自己的保护壳就会支离破碎，心理防线彻底崩溃。老师做的事，就是逼迫我们打碎保护壳，敞开心灵，接受它，那不是你的错，你没有必要背负。 而我们时常为了保护自己，不惜伤害他人。他对她女友说，并不爱她，就是最好的例子。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记14【2小时怕是不够】","date":"2017-05-29T03:00:32.000Z","path":"2017/05/29/周记14【2小时怕是不够】/","text":"回到正轨之后，每天晚上坚持看专业书至少2小时，但仍觉不够。 工作看了3天Swift，之后3天切换到工作模式。想明白了一件事，组里面有一位神人，自然是比不过他，那么既然做不了第一，那就争做第二。 还有一件事，不吐不快。我们需要做基于硬件的功能，老大随便从淘宝买回来一个设备。然后这个设备在iOS端不能用，于是这个问题就落到了我的头上。我呢，求爷爷告奶奶的找淘宝小二，问他设备生厂商的联系方式，谁知道淘宝小二给的设备生产方不是真的生产商，拿一些言语忽悠我们，说一些自己都说不通的话，其实就是不想给我们解决问题，胡乱糊弄过去，因为他们也不知道解决办法。最后我在App Store上找到了真的设备生产商，人家重新给我们开发包，这次能用了但是还有问题，这些售后也是脾气大，随便说了一些让人理解不能的话，你说没听懂他还急。这件事情，让我对一些人的嘴脸有了新的认识，对于淘宝背后的利益链也有了深刻的认知。不得不说，我对淘宝的厌恶加深了一分。 琐事没想去练车，就窝在家里。 睡眠有些不足，好歹周末一个晚上加一个下午补了回来。 看了一些公开课，比若吕世浩的秦始皇系列，讲的很深刻，甚至有人呼其为人生导师。还看了北大的古汉语课程，也有收获。 看了哈利波特第一步，没那么好看。端午放假第一天只睡觉看书看电影了。 网络是怎样连接的接着上周加4个晚上，每晚不少于2小时读完了，是一本概括网络全貌的书，豆瓣评分9分以上，作为网络入门书很不错的。 跟一位朋友聊了一下各自公司的事情。 忽然怀念起大学时光，想着有机会能回去看看也是好的。(看红楼看多了，语言组织都变得跟其有点像了。仔细你的皮！哈哈。)","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"吕世浩【秦始皇】","date":"2017-05-28T02:49:00.000Z","path":"2017/05/28/吕世浩【秦始皇】/","text":"还在大学的时候，在b站看到过这个系列视频，觉得讲的很好，有眼前一亮、醍醐灌顶的感觉。但是当时临毕业了，没时间看，最近又捡起来，从头看到尾，收获很大。 读历史怎么读我之前了解历史，大多是通过今天的人写的通俗书籍，用现代语言加上作者自身的见解写出来的书籍或者讲的课。例如，易中天品三国、明朝那些事儿、纵横十六国、悠悠南北朝等。读这些书不过是了解了一些历史人物，增长了知识，作为消遣而已。读史使人明智，指的是阅读历史开启智慧，我所说的读的书籍，了解的历史算不得读史。 吕老师，先是通过讲张良圯桥拾履的故事，讲了通过这个故事我们能学到的智慧。张良刺杀秦始皇失败后，走在圯桥上，一个老头让他去捡鞋，张良去捡了给他穿上。于是老头约张良5日后来此相会。5日后，张良迟到了，老头说再约，又约，张良去的比以前早了，还是迟到。老头说再约，这一次张良在第四天的晚上就去了，过了凌晨，老头果然来了。什么意思呢，做一件事在规定的规则之内，做到最绝，这样别人就不能指责你的不是了。这样读历史，才能启迪智慧啊，匆匆一眼看过，了解了故事，啥也学不到。历史中隐含的都是做人做事的道理，这才是读历史的价值。 然后，讲述为什么秦国能统一六国，这不是秦始皇一个人的功劳，而是因为秦国太强大了，有战争机器。秦国变法而六国不能，变法之后，利出一孔，身为秦国的子民，想上升只有耕战。六国也变法，但是都失败了。到了秦始皇的时代，秦国国力已经能轻易打败六国了，所以秦始皇能统一。统一之后，人的欲望无穷，对于造成的恶果，秦始皇又自欺欺人，不做改变，一步步走向灭亡。 秦的崛起首先是秦穆公，然后是秦孝公和商鞅。20多年的努力就能从最贫弱到能打败强大的魏国，变法见效奇快。后世沿用变法，国力步步提升。 然后讲李斯，李斯是个只追求功名利禄不惜害死韩非的小人，他身上没有丝毫士人的精神。他当然有成功，但结局也很惨。李斯影响了秦的历史，如果他没有私心，肯依照始皇遗诏通知扶苏，历史也不会是后来的样子。扶苏刚毅武勇，听到让他自杀的命令就乖乖自杀，因为他最敬爱的父亲背叛了他，心理防线崩溃。二世纨绔子弟，大杀宗室，赵高上下其手，秦没有主心骨，怎能不灭亡。 最后，讲了荆轲的故事。荆轲逐秦王，秦王绕柱走，这个细节是怎么来的。是太史公听到的口述历史，当年那个拿药袋子丢荆轲的人口述的。荆轲之所以不成功，一个是他等的宾客没来，太子丹就催他上路，所以才有秦舞阳色变，群臣疑之，提高了对手的警惕性。二是荆轲自己说的，想要生擒。","tags":[{"name":"公开课","slug":"公开课","permalink":"https://amasawaseiji.github.io/tags/公开课/"}]},{"title":"网络入门:网络是怎样连接的","date":"2017-05-26T11:53:19.000Z","path":"2017/05/26/网络入门-网络是怎样连接的/","text":"这本书在豆瓣评分高达9.3，属于非常好的书一类。通过它，可以了解网络的全貌。 0GET和POST 端口号：web 80,邮件 25。 URI的内容是网页的文件名或者CGI程序。 HTTP常用的方法是GET,POST，POST的URI通常指向服务器的一个程序。GET能发送的数据只有几百字节，超过这个就要使用POST。GET的消息体中不包含数据。 HTTP头部字段中Host表示请求的服务器IP地址和端口号。 响应消息中的状态吗2开头表示成功，4开头表示客户端错误，如404错误。 DNS DNS作用是根据域名查询IP地址。 TCP/IP结构是由子网通过路由器连接起来的大网络。几台计算机由集线器连接起来构成子网。家用路由器内置了集线器功能。消息经由集线器发送到最近的路由器，再发往下一个路由器。 IP地址是一串32比特的数字，8比特一组分为4组。 子网掩码为1的部分表示网络号，为0的部分表示主机号。主机号全部为0代表整个子网，主机号全部为1代表向子网所有设备发包，即广播。 不使用域名，只用IP地址，数字太难记。只用域名，字节数太长不固定降低效率。2者并用效率高，需要桥梁，就是DNS出现的原因。 Socket库是提供网络功能的组件集合。 还可以根据IP地址反查域名。 域名还可分上下级。可以通过上级DNS服务器查询下级DNS服务器的IP地址。根域保存在所有DNS服务器里面。根域的IP地址全世界只有13个。 DNS服务器还有缓存功能。 套接字、端口号 数据收发分为4个阶段，创建套接字，连接，通信，断开。服务器启动后就会创建好套接字，断开是客户端发起。通过描述符识别不同的套接字。 套接字加上IP地址和端口号就可以识别具体那台计算机了。端口号是让对方能够识别出套接字的机制。连接开始时，客户端会将这个随便分配的端口号告诉服务器。 1协议栈 浏览器、邮件一般使用TCP，DNS查询收发较短数据采用UDP. IP模块负责收发网络包，IP中还包含ICMP和ARP,ICMP用于告知网络包传送过程中产生的错误。ARP根据IP地址查询以太网MAC地址。 套接字的实体是存放控制信息的内存空间。 TCP头部，MAC头部，IP头部。头部用来记录和交换控制信息。 连接、SYN、ACK 协议栈将服务器IP地址，端口号传递给TCP模块，客户端先创建一个包含控制信息的头部。接下来将头部中的SYN比特置为1，表示连接，交给IP模块发送。服务器收到后返回响应，头部设置跟客户端发来的一样，除此还要将ACK位置为1，表示收到客户端发来的网络包。客户端收到后，如果SYN为1表示连接成功，还要将ACK位置为1发回服务器，告诉服务器刚才的网络包已收到，服务器收到之后，连接完成。 发送、MTU、序号、窗口 发送时机有两个因素决定。1个是网络包的最大长度，MTU,在以太网中一般是1500字节，MTU是包含头部的总长度，减去头部的长度叫做MSS。第2个要素是时间，协议栈内部有个计时器，一定时间之后就发送包，即时数据没积累到MSS。浏览器一般是直接发送，不等到填满缓冲区。 TCP可以确认对方是否收到包，没收到需要重发。序号用来告知接收方网络包在全部数据中的起始位置，连接操作中，将SYN置1时，将随机的起始序号告诉对方。除了序号还要告知对方包的长度。接收方根据序号和长度算出一共收到多少字节，将这个数值写入ACK号中，发到发送方。 重传几次无效之后，TCP会强制结束通信，向应用程序报错。关于重传之前的等待时间，TCP会动态调整，根据发送数据时测量ACK的返回时间，动态调整。 滑动窗口。发送包等待送达确认，如果第二个包等待第一个包的送达确认，效率会很低，所以发送包是按频率发送的，并不等待送达确认。如果频率太块，会导致接收方处理数据的能力，造成接收方缓冲区溢出。所以接收方应该告诉发送方自己缓冲区还有多少空间，这个数据在TCP的窗口字段中，表示接收方还能接受的最大数据长度。ACK号和窗口更新返回可以合并，提高效率。 断开、删除 无论哪一方先发起断开，需要将TCP头部中的FIN比特设为1发送，接收方表示收到需要返回ACK号，这个过程双方都要做。删除一般需要等待几分钟，防止断开发送失败，重传后来到达，等待就是等待重传失败。 IP模块、ARP、网卡、集线器、UDP 集线器按照以太网规则传输，路由器根据IP规则传输。MAC头部用于以太网头部，IP头部用于IP协议。IP协议根据IP地址找出传输方向，委托以太网协议传输，根据MAC地址找出下一个传输设备。以太网的部分可以被替换成无线局域网、ADSL、FTTH. IP模块添加MAC头部、IP头部。之后交给网卡，网卡将数字信息转换成电信号或者光信号传输出去。 IP头部中最重要的就是IP地址，接收方IP地址来源于应用程序。发送方IP地址根据计算机配备的网卡决定，计算机启动时会自动分配。路由表中有网关，代表下一个路由器的IP地址，默认网关是0.0.0.0。协议号06代表TCP,17代表UDP。 MAC头部中包含接收方发送方MAC地址，IP地址长度32比特，MAC头部48比特。MAC地址是网卡生产时写入ROM里的。 ARP根据IP地址查询MAC地址。使用广播的技术，将包发送给子网中所有设备来查询，查询时候放入ARP缓存中。ARP中缓存在几分钟之后会删除。 以太网中发送的包，所有设备都能收到。一开始是中继式集线器后来发展为交换式集线器，后者也叫交换机。交换式中信号只会流到指定的MAC地址的设备上，而不是所有设备。 网卡负责将数字信号转换为电信号或者光信号。网卡中保存着全世界唯一的MAC地址。网卡中的MAC模块会为数据包加上报头、起始帧分界符SFD，和FSC。MAC头部是由IP模块负责的，并不是网卡。报头用来测定读取时机，SFD用来确定帧的起始位置。 根据电流电压变化能还原出数据信号，但是如果数据是连续的0或1，就无法分辨信号的分界点了，所以使用时钟信号和数字信号叠加的方式。时钟信号是0和1交替的信号。找出时钟信号的周期就能分离数字和时钟信号的叠加信号，报头的作用就在这里。起始帧分界符是表示包起始位置的标记。FCS用来检测包传输中因为噪声导致的数据错误，是根据前面的数据来计算出来的，如果数据发生了变化，接收方算出来的FSC就会和数据中保存的不一致。 MAC模块转换之后，从PHY/MAU模块发送出去，其功能就是将信号进行格式转换。双绞线的情况两台设备之间的距离不能超过100米。半双工模式下会发生信号碰撞，一旦碰撞还需要发送阻塞信号，所有发送操作会终止。等待一段时间后，再重新发送。 包接收时，如果IP模块检测到错误会发送ICMP消息告知发送方。IP还需要将分片的数据重组。 UDP用于数据很短，只有一个包，不需要重发的情况，例如DNS。UDP没有TCP中的确认、窗口机制，也不需要建立和断开连接，只要加上UDP头部交给IP模块就好了，错误时就重发一遍，最大能传输的数据大概是6M多。另外一种使用UDP的情况就是音频视频，在音频视频上，就算错误重发了也无法补救，重发也没意义，这时使用UDP效率更高。 2双绞线、集线器、交换机、路由器 信号在网线中传输会衰减，线路越长，衰减越严重。因为噪声而失真。双绞线就是为了抑制噪声。环境中的电磁波产生噪声。双绞使得线路电流相互抵消，从而抑制噪声。内部相邻的信号线会产生内部噪声，也就是串绕，串绕可以通过控制节距来抑制。 集线器把信号发送给所有连接的线路。交换机根据地址表进行转发，交换机端口的MAC模块不具有MAC地址。查找到MAC地址后，将信号发送到相应的端口。MAC地址表的维护是交换机自发维护。如果找不到，会转发到除了源端口之外的所有端口。 交换机的全双工模式同时进行发送和接受，不会发生碰撞。比半双工效率高。根据脉冲信号，将自己支持的模式和速率告知对方，这就是自动协商。 路由器的端口具有MAC地址和IP地址，根据IP地址判断转发目标。会忽略主机号，只匹配网络号。路由器只接收与自身MAC地址匹配的包，不匹配的直接丢弃。判断转发目标时，采用最长匹配，即从网络号比特数最长的开始。无法匹配，丢弃后通过ICMP通知发送方。子网掩码为0.0.0.0的记录表示默认路由，找不到匹配时选择默认路由。包有生存时间TTL，每经过一次路由这个值减一，减到0就丢弃。 IP中的分片是指对于网络包再拆分，如果包的长度大于端口MTU就需要分片，首先查看IP头部的字段看看是否可以分片，不能分片丢弃发ICMP消息，分片的话，每个分片数据前加上IP头部。 路由器发送时查看路由表的网关列，如果网关列内容是IP地址，此IP地址就是下一个转发目标，如果网关列为空，则IP头部中的接收方IP地址就是下一个转发目标。也是用ARP查询下一个目标的MAC地址。 路由器负责将包送达通信对象这一过程，其中交换器负责将包传输到下一个路由器这个传输过程。 路由器还有地址转换和包过滤的功能。内网使用私有地址，与互联网通信需要把私有地址改写为公有地址，根据端口号来区别私有地址中的设备。一个公有地址可以对应几万个私有地址。包过滤应用于防火墙等设备。 3ADSL、光纤 接入网方式包括，ADSL、FTTH、电话线等。互联网接入路由器在网络包前面加上MAC头部、PPPoE头部、PPP头部，然后发送给ADSL调制解调器。调制解调器将包拆分成信元，转换成电信号发送给分离器。调制采用振幅调制加相位调制结合的方式，并且使用多个波来提高速率。 分离器的作用是将电话信号和调制信号分离。DSLAM具有ATM接口，与路由器收发数据使用的是ATM信元格式。BAS负责将信元还原成网络包，并转发到会联网内部。 光纤的原理是将数字信号转换成电信号，再转换成光信号。根据纤芯直径不同，分为较细的单模光纤和粗的多模光纤。多模光纤传导多条光，单模光纤传导一条光。光纤越长越容易失真，单模光纤失真较小。多模光纤用于建筑物里面，单模光纤连接建筑物。 FTTH分为直连和分路2种方式。PPPoE是将PPP消息装入以太网包进行传输的方式。 互联网接入路由器通过PPPoE的发现机制查询BAS的MAC地址。BAS下发的TCP/IP参数被配置到互联网接入路由器的BAS端的端口上。BAS收到用户路由器发送的网络包之后会去掉MAC头部和PPPoE头部，用隧道机制发送给运营商的路由器。互联网接入路由器将私有地址转换为公有地址。 PPPoA不添加MAC头部和PPPoE头部，直接将包装入信元中。DHCP不使用PPP,而是将以太网包直接转换成ADSL信号发送给DSLAM。 网络包接入网之后到达运营商POP的路由器。POP扩大规模之后就是NOC，NOC是运营商的核心设备。互联网内部使用BGP机制在运营商之间交换路由信息。IX将多个运营商汇聚在一起， 4缓存服务器、负载均衡器、防火墙、代理、分发 防火墙最普及的是包过滤方式的。通过接收方IP地址，发送方IP地址、接收方端口号、发送方端口号、控制位信息来判断是否允许某个包通过。 服务器性能不足时，需要使用负载均衡器。用缓存服务器分担负载。缓存服务器通过更新时间管理内容。缓存服务器收到请求之后会给服务器发送一个查询响应是否改变的消息，没有改变则从缓存中取数据。 正向代理，接收客户端的请求消息，再转发到互联网。可以查看消息内容，实现防火墙的功能。反向代理，能转发一段不包含完整网址的请求。透明代理是缓存。 内容分发服务，缓存服务器交给服务器运营者管理。找到最近的缓存服务器，然后重定向。服务器内容变化时，通知缓存服务器更新。 5服务器 服务器系统有多任务、多线程的功能。描述符的作用，等待连接的套接字中没有客户端IP地址和端口号。网卡的MAC模块将网络包从信号还原为数字信息，检验FCS并存入缓冲区。 IP模块的接收，判断是不是发给自己的，判断是否分片，将包交给TCP模块或者UDP模块。 TCP处理连接包，确认TCP头部的控制位SYN,检查接收方端口号，为等待连接套接字复制一个副本，记录发送方IP地址和端口号。 TCP处理数据包，根据发送方IP地址，发送方端口号，接收方IP地址，接收方端口号，找到对应的套接字。将数据拼合起来保存在接收缓冲区中，向客户端返回ACK。 响应，将请求的URI转换成实际的文件名。web服务器还有访问控制，限制特定用户才能访问，如会员制。 响应的数据类型，Content-Type字段。text/html是html文档，image/jpeg JPEG格式的图片等。 6术语解释 简称 释义 URL 统一资源定位符 FTP 文件传送协议 HTTP 超文本传输协议 URI 统一资源标识符 DNS 域名服务系统 SFD 起始帧分界符 FCS 帧校验序列 ARP 地址解析协议 ICMP 控制报文协议 ADSL 不对称数字用户线 FTTH 光纤到户 DHCP 动态主机配置协议","tags":[{"name":"计算机科学","slug":"计算机科学","permalink":"https://amasawaseiji.github.io/tags/计算机科学/"}]},{"title":"周记13【回到正轨】","date":"2017-05-21T16:02:32.000Z","path":"2017/05/22/周记13【回到正轨】/","text":"本周工作状态不错，主要的业余时间用来读和看了红楼梦，小部分时间用来阅读了专业书。心情算是不错。 红楼梦看完了刘心武的揭秘红楼梦，大体上对于红楼梦的一些事情有了充分的了解。收获颇大，可以说是看了这个节目才引起了我对红楼梦的兴趣，感谢刘老师。 史湘云，别看她活泼话多，其实也是可怜的人。父母早亡，住在叔婶家，婶婶对她也不好，在家就是没日夜的干活，也就到贾府才有开心的日子。 贾迎春，亲妈也死了，虽然不是庶出，跟庶出地位没什么两样。是一个脆弱软弱的人，只想着能被世界温柔以待，结果却是唏嘘。 香菱，看到她学诗就知道了，她是一个多么想要精神世界的人，努力想跟大家一样，那么积极向上的姿态，也逃不脱命运的戏弄。 工作一开始因为旅游没有好好休息，有点虚，又在着迷红楼梦，上班状态有点梦游。后来跟同事交流渐多，状态变好。另外，加了工资，每天晚上6.30回来刚刚好。 其它听了些歌，有些纯音乐还是强推的，不细说。 想着有机会可以回中学校园看一看，忽然发现，从高中毕业，那么多年好像没有真正去回去看过。还想着，约小伙伴一起去爬山看海。 偶然看到大学同学朋友圈，大家都成长了很多，深刻了很多，无不是向上的姿态。每个人都有自己的路，别人的羡慕不来，一步步走好自己的路就好。 周末看了2部电影，没出去玩。睡了一个下午，平均每天学习5个小时。制定了新的计划，放下了绘画、骑游的念头。虽说时间没有充分利用，但还算是重回正轨，接下来就是按照计划行事就好了。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"红楼梦是怎么一回事","date":"2017-05-19T15:18:30.000Z","path":"2017/05/19/红楼梦是怎么一回事/","text":"曹公千古。 我与红楼早年间，只爱读三国、水浒，认为红楼是女孩子读的书。读大学时，只因为好奇，尝试过读红楼，但是每次都没读下去，最多只读到贾宝玉初试云雨情，咳咳，我乃一俗人。 还是从百家讲坛缘起，看到三国就想到当年电视上有过刘心武解红楼梦的事情。当时貌似还被语文老师说过，印象深刻。自然而然看了一下，竟一发不可收拾，直到今日勉强算是看完了共61集的课。落下最后3集没看，因觉得那是刘心武在推销自己的续书了，续书自然是永远没法跟曹公原笔并论的，即使是几百年前的高鹗亦不能免。还有就是2.0倍速看的也相当快。 红楼背后现在我们读到的红楼梦不能说是曹雪芹的红楼梦，而是曹前80回加高鹗续的40回，即曹加高所著红楼梦。高鹗是曹雪芹去世30年后才续的红楼梦，他跟曹雪芹没有关系，算作是最早的同人文作者罢。相反，跟曹雪芹关系密切的人叫脂砚斋，脂给红楼梦写批语，参与编辑、删改红楼梦。因此脂砚斋的批语是研究红楼梦的重要线索，红学中有一脂学，就是指这个。 红楼梦行文，被称作草蛇灰线，伏沿千里，就是说伏笔用的最好，每一个人物，每一段故事，每一首诗都有伏笔或预言。其文学价值无复多言，许多作家或会说从红楼梦中借鉴了什么云云。还有其它价值，比如反映了封建社会贵族生活、中国文化底蕴、作者超时代的悲天悯人的情怀等。总之，红楼梦是个宝藏，所以才会有红学。而这样一部作品，80回后竟然迷失无稿，是一部不完整的作品，可说是伟大的悲剧。 曹雪芹是什么人？曹雪芹祖父曹寅是康熙的发小，你看鹿鼎记的韦小宝就知道了。到了曹雪芹这里，遭遇了家族的没落，从贵族到贫民，人生起落，困厄才会生发出巨大的毅力，成为伟大的人。 刘心武解红楼红楼梦反映政治，甄士隐（真事隐），贾雨村（假语存）。主要是康熙雍正乾隆三朝的事情，双悬日月照乾坤，日派和月派争斗。这事牵扯到康熙时期九子夺嫡的故事，两立两废的太子就是书中的义忠亲王老千岁，太子被废在书中叫做坏了事。秦可卿就是和太子有着血缘关系，所以死了用的是老千岁的棺材，丧事极为隆重。贾家最后倒下是因为跟月派有着很大的关系，月派是想要颠覆政权，发动政变的一派。秦可卿之死应该是舍车保帅。 贾家起势是从贾元春加封妃子开始，而贾元春就是告发秦可卿是月派的人。她的结局是没有诞下子嗣，野外吊死。 妙玉是个尼姑，高冷女神。本身也是贵族子弟，王孙公子叹无缘，说明本来有个相好的，因为有些事情被迫做了尼姑。与宝玉不存在爱情，是高级的精神交流。结局是坚守本心，与佛为伴。 林黛玉与贾宝玉真实的血缘关系并不近。无父无母，孤零零的在亲戚家生活，当维护她的贾母去世，她自然也悲剧了。黛玉之死应该是沉湖，当然不会有尸体，只有玉带林中挂，回归仙界去了。 薛宝钗用现代的眼光看，堪称完美的贤妻良母类型。最初参加选秀，但是家里关系不硬，没选上。贾母也不喜欢她，金玉姻缘障碍重重。最终与宝玉结为夫妻，但是宝玉出了家。 史湘云原型与曹雪芹关系很密切，所以写来逼真。先嫁与卫若兰，后来卫若兰死去。贾府倒下后，因缘际遇与宝玉遇合。 贾宝玉吃胭脂，以及跟丫鬟洗澡洗几个时辰，是隐晦的写法，是什么事情大家都知道。他有超时代的悲天悯人的情怀，考词叫做情不情，他爱对他没感情的事物，就是博爱。结局两度出家。 贾迎春是一个脆弱软弱的人，嫁给了中山狼，被摧残致死。 香菱，真名叫做甄英莲（真应怜），薛蟠娶了正妻后，被迫害致死。 贾惜春意识比较好，早与贾府断关系。最终做尼姑，缁衣乞食。 袭人为保护宝玉，被人带走。 探春远嫁，漂洋过海，可能是琉球。 王熙凤跟平儿妻与妾掉了个个儿，结局悲惨。巧姐嫁了刘姥姥外孙板儿。 李纨虽能自保，儿子命不长。 薛宝琴不在梅边在柳边，嫁给侠士柳湘莲。 晴雯对他表哥那么好，结局惨惨惨！","tags":[{"name":"公开课","slug":"公开课","permalink":"https://amasawaseiji.github.io/tags/公开课/"}]},{"title":"周记12【活动】","date":"2017-05-14T10:53:15.000Z","path":"2017/05/14/周记12【活动】/","text":"琐事条述。 一个朋友感情上遇到困境，我从局外说了一点想法，但是呢，毕竟是局外，体会不了局内人的感触。只能说是聊胜于无吧。 绘画这件事，热度是完全降下来了。之前还想着以后可以画的多好多好，不过是想想罢了。请看到现实。 工作也挺忙的，天天都加班，好歹算是完成任务。另外，每天都加班的这种状态也蛮好的，有心保持一下。 刘心武揭秘红楼梦看到了30多集，红楼梦看到了30多回。这使我偶然想到自己还小的时候，那些萦绕在耳边的旋律。比若，西游记后传的片尾曲。后来我专门找了这首歌曲，歌曲固然是好听，歌词更是超神。什么“最不屑一顾是深情，守着爱怕人笑，还怕人看清”，小时候词都没记着，现在看简直超神。还有红楼梦中引用牡丹亭中的句子，比若“良辰美景奈何天”、“似水流年”，这些在现在很火的词句，竟都是出自汤显祖的笔下，惊叹。 看了一集幻境诺德琳，不错。可能我对科幻不太感冒，对于豆瓣打出的9.几的高分，持观望态度。 下述主题。 周六周日一共是1天半的时间，在旅游，旅游质量下降严重。从我在公司里一共三次旅游，第一次去的无锡，太湖啊，影视城啊。第二次去千岛湖，虽然没什么好看的，毕竟也是有名的景区。这次呢，去了个桐庐，什么鬼。怕是除了杭州人谁还知道这么个景点。这还算了，结果呢，2天全都在做活动，比赛竞赛搞团建，奖励还十分少。第一天是随便找了个场地还罢了，第二天比赛爬山。旅游的精髓是沿途的风景啊，无话可说。唯有3点还算是不亏，一是自己做饭，即使不会做饭看着别人做也能学到东西呀。二是有高级宾馆可以享受，三就是经济上的好处了。但是，下次如果仍是这样，即使有这些好处，不去也罢。还不如我自个儿骑个车去逛西湖呢。 还有一个，晚上吃饭，跟一群拆二代在一桌，就像其中一个非拆二代说的，他们跟我不生活在一个世界。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"周记11【无事】","date":"2017-05-08T14:08:52.000Z","path":"2017/05/08/周记11【无事】/","text":"所谓无事，就是没什么可道之事，最多也就过了科目二算一件事，但却也是本来不该有的事。 本周正事一件没干，尽把时间打发。 索性说一说用什么来打发时间了罢。看了3期跑男，不过呢除了鹿晗跟迪丽热巴新组的cp，也就没什么值得看的了，而且郑凯贼尴尬好伐。其次呢看百家讲坛，看了一下易中天品三国，但是这个我至少已经看过两遍了，所以看了几集弃了。看蒙曼的大隋风云，也是看了几集兴趣不大。最后，因为我最近在读红楼梦，于是就看刘心武揭秘红楼梦，这个就比较精彩了。跟随刘心武的脑洞，红楼梦还真是惊心动魄呢。特别是脂砚斋其人，特别神秘。大概了解了红楼梦作为带有自传性质的小说，可以说是天才的悲剧吧。后人说红楼梦字字泣血不虚也。一口气看了十几集，随后又看了电视版红楼梦，刚开始看，不过这个坑已经挖好了，基本不看完不准备先跳出来了。 科目二浪费了我一天半的休息时间，稳当的过了。 也想了一点事情，思路也很清晰，也算是豁然开朗了。就是要逼迫自己实践这种方式还有困难要克服。 另外最近睡眠有点不足，需要好好休息调理。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"骑游记1","date":"2017-05-08T13:45:07.000Z","path":"2017/05/08/骑游记1/","text":"早先想骑政府的自行车，后来有了看起来酷炫共享单车，就想着骑出去溜达一下。一为体验一下共享单车，二为能够出去玩。 是时候改变死宅的属性了。 我约了个朋友，周五的晚上就约了，他早先买了辆自行车，挺贵的车，1000多呢。我跟他这么一说，他也就来了兴致，虽然平时他从不骑他的那辆车，一直放在公司的地下车库里，他是我一个同事。 我从富阳回来，还没到家，担心自己回去之后会放弃，干脆提前丢掉后路，给他发微信约好下午去骑车，他很快同意。中午一起吃了饭，他去公司拿车，我在路边研究共享单车。我发现，公司附近有四种车，并且在支付宝上都有的。hellobike白车听说是最好骑，但是需要交199元的押金。u-bicycle也是。然后我试了免押金的小黄车，觉得龙头太灵活了，不好骑。换永安行，可是永安行车座无法调节高低，最后还是骑了ofo小黄车。通过我的观察，杭州地界上以hellobike和ofo最多，但是2个的方式不一样，hello以收押金和最好骑是特点。ofo最多，免押金。猜测hello很稳，而ofo背后有大金主，不愧是和mobike争雄的巨头。 再说说去玩的地方，去的路比较曲折，不看地图瞎骑，去用时3个小时，回来才40多分钟。骑到西湖西边的景区，路上高低起伏，有时酸爽有时辛苦。最让我难忘的是两边有竹林的小路，在这样的路上骑100回也不会讨厌。最后我们在杨公堤上休息了一会儿，这时候西湖的人不算多也不算少，路上经常是骑共享单车的几个一队的人群，这也算成了一种景观。不过，骑到景区里面，停放的车比较少，所以最好还是不要放弃你骑来的这辆，不然你有可能就没的骑了。","tags":[{"name":"骑游记","slug":"骑游记","permalink":"https://amasawaseiji.github.io/tags/骑游记/"}]},{"title":"17岁的故事","date":"2017-05-05T15:25:37.000Z","path":"2017/05/05/17岁的故事/","text":"最近知乎上的一个问题。男生好追吗？一个回答回忆了他17岁纯真的感情，赢得高赞。17岁，人生一个十分重要的年纪，因为17岁往往会发生第一个感情故事。 下面是个人主义的故事。 17岁，我读高二。为了成绩互补，老师安排我与彼坐同桌。彼十分活泼，我木讷少言。彼与众男生称兄道弟，对我也没什么不同。彼用MP4听歌，分给我一只耳机。我与彼吵闹，被逼得窘迫，竟然口无择言，说彼是死鬼。(捂脸而去) 彼有点蠢，跟我一起下楼梯，人走的飞快，一不小心摔倒。按照正常的故事情节，应该是我扶彼起来。可是呢，彼却迅速自己爬起来，当做没事一样。 故事的转折在于下一次排座位。按照成绩先后顺序自己选择座位。彼对我说，你选了之后帮我留个座位。我如是照做，彼仍与我同桌。上课时，彼与我用纸写字交流，我乘机问彼愿做女友吗？彼回答好。我与彼十指相握，自认为这是小说里所说的感情。不料，第二日，彼旋即反悔。此后直到我17岁结束，又高中结束，单独度过。与彼再不言一语。 这就是我个人主义的17岁遇到的第一个感情故事。仅存在不到1天。","tags":[{"name":"往事","slug":"往事","permalink":"https://amasawaseiji.github.io/tags/往事/"}]},{"title":"易中天百家讲坛【汉代风云人物】","date":"2017-05-05T14:51:17.000Z","path":"2017/05/05/易中天百家讲坛【汉代风云人物】/","text":"逛b站偶然看到，出于对易中天的喜爱，便把易中天教授所讲的那部分看完。易中天在b站是个名人啊，特别是鬼畜区，更有人将他所讲的历史公开课，如品三国，视为镇站之宝。 晁错被袁盎反杀，袁盎是古代被称为士的人。 窦婴田蚡都是外戚，汉武帝巧妙利用2人的矛盾，2人互相攻击，一起被瓦解。汉武帝晚年防外戚防的死是有原因的，年轻时深受其苦啊。 韩信是军事家，谋略不高，自己作死。不可否认的是他的国士无双。 刘邦深谙领导艺术，什么都不行，就会帝王之术。萧何也被猜疑下过狱，就连樊哙也差点被杀。 什么是真正的男人，真正的男人是有人格精神和人格魅力的男人，这种魅力是有凝聚力和震慑力的。","tags":[{"name":"公开课","slug":"公开课","permalink":"https://amasawaseiji.github.io/tags/公开课/"}]},{"title":"周记10【前途】","date":"2017-05-01T01:39:28.000Z","path":"2017/05/01/周记10【前途】/","text":"工作虽然工作任务有点多，但是完成的还不错。一次会议中，我也主动表达了一些观点，算是进步吧。 杂项那位看了我博客的朋友读了白夜行，可能是受我的影响吧。 看了动画未闻花名，失望。 一天晚上，在餐厅里，当我看到里面的员工，嬉笑调侃，我想起了另外一种幸福。忙碌和嬉笑中，时光流淌。给时光留白，不失为愉快的事情。 我在车站候车的时候，看到众人的面貌。不禁想到，南方水土好，男人脸上也是白皙干净，我有点自惭形秽。好羡慕啊。 车站的自动售货机也支持移动支付，真是方便。实话说，我出门只带几个硬币坐公交车的。移动支付时代带来的便利很大。 画画放弃补动画了，想开始系统的学习绘画。程序员作为比较火和好的职业，我会坚定走下去，绘画作为兴趣就好。 家人每当我即将见到父母的时候，我会有点害怕，害怕看见他们的苍老。与他们交流的感触就是，他们是跟不上时代的人了，手机也玩不溜，很多东西来问我。所以，尽可能的帮他们跟上这个时代。我父母对我当然也有抱怨，说我不爱说话说了多少年了，现在他们求我发朋友圈，说我不常常发朋友圈，他们不知道我的情况了。我也很无奈啊，不发朋友圈还有罪了？另外就是催我找对象，最后我以一句我心里有数终止了这个话题。还有就是我爸一直以来对我的期望，他希望我能有一官半职，然后他就有面子了，可以炫耀了。这个问题我不想多说，因为我们的对话不在一个频道，他说着他实现不了，想让我实现的梦想。我想着，追求怎样的生活因人而异，不在其位不知其中苦处。我跟他在这个问题上可能永远不会在一个频道了。他抱怨说到现在看不到我的任何长处(他的言论经常孩子气，不成熟，但我已免疫)，我想，总有一天我会证明给他看。 樱花樱花，想见你多年前，还在大学的时候。一个室友的朋友来找他玩，住在我们寝室。这个朋友是个流浪歌手，带着吉他。当时，他在我们寝室向着对面寝室楼弹唱，对面寝室楼是女生寝室楼，还引起不小的轰动呢。他当时爱听和正在学的就是这首歌。我一直不知道这首歌的名字，再也没听过。最近，在bilibili偶然又听到了。然后去看了背景，是一个父亲对死去女儿的对话，然后女儿以这首歌作为回应。怎么样？光看背景就足够感动了吧。歌曲好听到哭。 网易云没原版版权，姑且找个翻唱的男生版。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"【你的名字。】原作小说与外传，感怀逝去之物","date":"2017-04-30T10:29:41.000Z","path":"2017/04/30/【你的名字。】原作小说与外传，感怀逝去之物/","text":"新海诚在小说后记中是这么说的：“失去了重要的人和地方，但依旧决心抗争。坚信总有一天能与某种尚未遇见的事物相会，执拗的伸出自己的臂膀。” 动画电影回忆来到2016年12月，我在电影上映后的第一天，也是周五的晚上去电影院观看了电影。虽然之前已经看过网络流传出来的版本，但是我依旧在社交平台表达过如果电影上映就前去支持的愿望，如愿以偿。当时本以为会到第二年也就是2017年才会在大陆上映，后来突然有一天我的一位同事先于我知道并且告诉我已经确定上映日期，那天我真是兴奋莫名呢。而我之所以会去了解并看这部电影，是因为我对宫崎骏动画电影的虔诚心态，以及此电影在日本的超高票房，已经成为票房仅次于千与千寻的作品。我以我怀着虔诚的心态，观看电影2次，阅读原作小说以及外传小说。 那天我去的晚了，电影已经开始在放，放映厅坐满了人，绝对是100%上座率。我有点震惊，有点惊喜，更多的是尴尬，我要在众人直视屏幕的情况下找到我的位置并坐下，还是一个人！幸好有个大概是电影院的管理人员的小姐姐，看了我的票，告诉我位置在哪，我才顺利找到座位，非常感谢她。我左边坐的是一个工作人士打扮的女生，右边是一个胖宅打扮的男生。我回头看了看，女生很多，男生也不少，还有一堆成对的情侣。我调整好坐姿，以使自己平静下来，认真观看电影。 电影中灵魂交换产生的笑点，大家都会哄堂大笑，这么多人一起看二次元，我真的有点方，我因为紧张而没有发笑。我不晓得其他人观看是什么样的感受，大笑或破涕。总之我从始至终都是以欣赏美的态度观看地，没有笑也没有泪，只是有点怀念那年少时的勇敢，特别是泷与司和奥寺前辈三人远足去寻找未知之物。17岁，一个多愁善感的年纪呢。 看完电影，我努力思索这个电影到底想表达什么呢？我把他/她们多年后相遇一眼认出对方（相当于本不认识）理解为一见钟情，并且在豆瓣评论区写下了这样的短评：“一见钟情源于少年时期的幻想”。现在看来，这句话真是颇为幼稚。 原作小说小说没什么看点，新海诚自己也说了，动画电影是最佳的呈现方式。小说相对于电影，内容上当然没有电影表现出来的东西多。但我注意的是另外一些点，算是涨了知识。比如，穰(rang)是丰收的意思，参道就是神社前的道路，鸟居就是神社的大门，⛩emoji表情。 新海诚的后记，也让我对电影以及小说表达的东西有了新的理解。我们不仅对失去的东西感怀，而且执着。具体来说，尽管失去了，甚至忘却了，却仍要期待，并且抱着期待的心情活下去。致郁吧，哈哈。 外传小说外传小说有点水，主要是对电影和原作小说的一些补充。通过进入三叶身体的泷，敕使河原克彦，四叶，三叶父亲4个人角度，还原了更多的背景内容。比如，河原为什么愿意继续待在小镇，而不是跟随三叶和早耶香的想法去东京？因为他的理想是改造小镇来寻求变化而不是到外面的大世界来使自己发生变化。四叶喝了自己的口嚼酒短暂穿越回了古代。三叶父亲，宫水俊树与宫水二叶的故事，揭示了为什么最后他会答应三叶的请求发出避难通知。还有三叶四叶为什么起这样的名字，是因为他们觉得应该叫这样的名字。最终表达的是，命中注定说，也就是命运说。对此我表示不以为然。 东京是日本的绝对中心，这一点跟中国不同。中国南方中心是广州、深圳，中部中心是上海，北部中心是北京，西部有西部的中心，没有说哪一个城市有绝对上的优势，全国人民都只往那里去。日本九州中心的福冈，中部的名古屋，关西的大阪跟东京是没法比的，东京在日本是绝对的中心。 不在意别人对自己的看法是自暴自弃的表现，orz。 贴2张扉页插图。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"动画电影","slug":"动画电影","permalink":"https://amasawaseiji.github.io/tags/动画电影/"}]},{"title":"【人民的名义】引发的三观思考","date":"2017-04-28T15:36:24.000Z","path":"2017/04/28/【人民的名义】引发的三观思考/","text":"写在播到祁同伟自杀之后。 这个电视剧的毛病不说了，说一下其中人物引发的讨论。前期大家讨论的焦点在李达康，无外乎这个人物演技赞，大公无私，还有点萌。后期讨论的焦点转移到了祁同伟身上。 一个反派被大家同情。我就想追究为什么会同情他，并且对高高在上的侯亮平，钟小艾，陈岩石反感。就观感来说，我也是这样，并且对侯亮平说祁同伟是畏罪自杀表示鄙视。当时觉得那像是乌江自刎的楚霸王。 三观是否有问题？ 祁同伟出身寒族，被权力侮辱之后转而投靠权力，并以权力作恶。不要被同情心蒙蔽了，他作恶！看到后面会很容易被他表现出的，苍天不仁，社会不公，与天斗的气质迷惑，从而忘记了他作恶的事实。 为什么讨厌侯亮平，钟小艾，你说是特权阶级，其实是讨厌特权阶级不是在你的身上。如果你是特权阶级，你会讨厌自己？人要摆正自己的位置，这就牵扯到另一个问题，阶级固化。好在现如今的中国，阶级固化还没有像日本那样严重。但是如果你不想改变阶级，觉得那很困难，普通安分的生活也是一种活法。 你被权力侮辱就作恶。你让那些不作恶，通过正常途径努力晋升的人怎么想，凭什么，公平何在？ 勇者怒，抽刃向强者，怯者怒，抽刃向弱者。 屁股决定脑袋，人都有局限性。","tags":[{"name":"电视剧","slug":"电视剧","permalink":"https://amasawaseiji.github.io/tags/电视剧/"}]},{"title":"刘未鹏【暗时间】","date":"2017-04-28T15:12:57.000Z","path":"2017/04/28/刘未鹏【暗时间】/","text":"从徐宥的博客了解到的刘未鹏。徐宥的博客是比较有趣的，看他的博客很有故事性，可以说他是一个热爱生活的人。刘未鹏是一个读了很多心理学书籍的程序员。从他的公众号思维改变生活可以看出，他在心理咨询方面很厉害。(从他解答一位女性的与丈夫相处的问题可以看出) 暗时间这本书，跟皮囊在某些方面有点像，就是博客合集，除了第一篇文章讲暗时间，其他的都在说与此无关的东西。有被骗的感觉。 讲心理学方面，确实长了很多知识，不过都是在分析和讲理论，有点不接地气。 讲思维、数学、计算机科学，没有一定的数学素养和计算机知识也是理解困难。高度太高了，导致底下的人带也上不去。我觉得还是在具备一定的知识素养之后再来读才好。 博客集合编成的书，最好还是不要买了，如果我知道是这样的话，我也就不买了。完全读懂特别困难但是又已经读了，对于强迫症来说是一种伤害。总之，这本书不适合现在的我读，这一点跟黑客与画家类似。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"周记9【颓废】","date":"2017-04-24T14:25:11.000Z","path":"2017/04/24/周记9【颓废】/","text":"好累，上班没动力，下班也没动力。并且身体也累，心累。 本来想满血复活，结果心有余力不足。 我想做的事情有很多，不光想努力掌握专业知识，还想涉猎一下其他专业，甚至发展一下兴趣。而实际中，我本就有做不完的工作。我想过，趁年轻，有想法就立即实施，试过才知道有没有兴趣，能不能坚持。想到最后，也只能是想想，还是要先做完眼前的事情。也许有一天，我有了明确的目标和动力，我想我会放弃所有的兴趣爱好，一心只想赚钱，而不是过自己的喜欢的生活。（到底怎样对，怎样不对，说也说不清）迷茫了就看书，所有的问题都能在书中找到答案。 本周基本没干什么正事，干什么都提不起劲来。看了2部电影，跳看一个电视剧，看了2本书。 我想业余画画来着，了解了点知识，还没执行。 人民的名义本来最高检出品的，应该跟公安部出的湄公河一个档次的。结果呢，注水严重，骗钱的。就算你主线故事再精彩，也不过是残次品，10我只给7分。 我的博客终于有第一个朋友看了。（嘻嘻） 对不起，这周我就是扶不起的阿斗，略短了。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"弗洛姆【爱的艺术】","date":"2017-04-24T13:00:39.000Z","path":"2017/04/24/弗洛姆【爱的艺术】/","text":"读之前知道是一本某个评论说的“每个女朋友都送一本”的百年经典书目。 一本关于人的关系与社会的类心理学书目。并且是我读的心理学类的第一本书。 读完后，使我对人与社会的理解，上了一个台阶。应该珍藏并不时拿来翻阅的一本理论分析书。 究竟什么是爱？爱首先不是能否有人爱自己，而是自己是否有爱的能力。 人作为一个独立的存在，有着与世隔绝的孤寂感。唯有爱可使人解脱。 在爱情中出现了两个两个生命合为一体，却保持两体的怪现象。 爱情首先是给而不是得。除此之外还有关心，责任心，尊重和认识。 爱的本质是创造和培养。责任心是对对方愿望的答复，成人之间表现为关心对方的精神要求。尊重是我爱的人应该以自己的方式去成长发展，而不是服务于我。认识是应该以他人的眼光看待他人，把自己的兴趣退居二位。 父母的爱对孩子的影响母爱是天生获取且不可赢得的爱，是一种消极的爱。 孩童式的爱情是：我爱，因为我被人爱。成熟的爱是：我被人爱，因为我爱人。幼稚的爱是：我爱你，因为我需要你。成熟的爱是：我需要你，因为我爱你。 父亲是教育孩子，向孩子指出通往世界之路的人。 一个好母亲不会阻碍孩子的成长，也不会鼓励孩子求援。 父爱是使孩子对自己越来越自信，最终成为自己的主人。 厌世往往同母亲的单一联系导致。 爱的形式爱以博爱为基础。母爱的本质是关心孩子的成长。检验一个母亲是否有能力爱的一点是母亲愿不愿意同孩子分离，以及分离后愿不愿意继续爱孩子。（关心孩子不是指关心孩子身体健康成长，还有人格的独立） 性爱到底是另个人之间的吸引力还是只是意志的行为，2者或者都对或者都错，没有定论。（身体是忠诚还是随性没有定论，因人而异） 爱别人首先有爱自己的能力。 爱的实践纪律、集中、极大的兴趣。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"晏凌羊","date":"2017-04-20T10:43:26.000Z","path":"2017/04/20/晏凌羊/","text":"书名叫《那些让你痛苦的，终有一天你会笑着说出来》。太长而把标题省略为作者。 前段时间听电台，读到作者一篇文章，文字写的细腻美丽，触动人心。经查阅，得知作者高考时曾是文科状元，还出了本书。豆瓣上看一下有将近8分，快赶上蔡崇达的《皮囊》了，就买了读了。 读完之后，失望透顶，对不起我那10元巨款。 一堆故事，读完就忘了。如果说有什么感想的话，就是我很年轻，真好。再有就是我真幸运，那么早就走出了感情的泥淖，笑看红尘。 作者本身有不幸的婚姻，写出来的故事也是支离破碎的悲惨故事。我本来以为作者会带给我一些些治愈，结果输出的全是负能量。这就是我讨厌它的理由。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"狐妖小红娘","date":"2017-04-17T23:43:38.000Z","path":"2017/04/18/狐妖小红娘/","text":"b站播放量破亿，国产第一个。 在豆瓣上，已近完结的3个剧场版，2个超过9分。 应该是腾讯动漫的代表作了。 补完来一发感慨。 动画以及游戏配音是配音界认为最能体现配音价值的形式。狐妖的配音以及音乐绝对给这个系列动画加了很多分。画面美术也是国风，美不胜收，特别是从第三篇往后，画质有了质的提升。 再来说一下剧情，没什么好说的，有老套的东西，也有新颖的东西。在得知作者说不想画一样的东西，所以力求创新，力求不一样，我觉得是值得追下去了，它不会变味。 很少有能让我产生想看第二遍的作品，但狐妖是让我产生了这种想法。这是美剧《权力的游戏》，甚至《仙剑奇侠传》《古剑奇谭》（通常许多玩家会有玩N周目的情况）系列游戏都不曾有的。总之，这部番应该能更很多年，就像知乎上有人说的，当多年后国漫发展成熟壮大以后，会有人说狐妖是早期值得一看的一部作品。 关于21集的万剑穿心终不悔，相视一笑轻王权。21集弹幕真个系列弹幕最多的一集，也是王权富贵篇的高潮。虽然弹幕多的异常疯狂，但我的心中应该是毫无波澜。为爱赴死，这种剧情我见得多了。我第一次感受到这种情感是金庸的武侠小说，比若《倚天屠龙记》里张无忌的初恋，就像金庸所说，第一次经历爱情的年轻人总是愿意赴汤蹈火、生死以之。对于感动到ta们的王权富贵跟感动到我的张无忌是一样的。对于王权富贵所说的道，其实很简单。道就是路，一个人要走什么路，就是我们现在所说的人活着的终极意义究竟是什么？这也是哲学上的问题，人贵在找到自己要走的路。 东方月初绝对是番剧的灵魂人物，潇洒又深情，在我的印象似是杨过一类的人物。特别是配上杰大的配音，帅到突破天际。在月红篇的主题中，爱进一步升华，如果说王权篇是中学生的爱情观，月红篇则是成年人的爱情观。中学生对爱是飞蛾扑火、奋不顾身。成年人则懂得爱要想对方之所想，让对方快乐，是无私的奉献。作者对于爱是有诠释意图的。 题外话，光合积木配音团队主要成员现在基本上都单飞了。季冠霖办了配音培训班，阿杰创办了729声工厂，边江创业，乔诗语深造等。当年正是玩仙剑认识的ta们，现如今各个都成了大佬。配音行业也发展的越来越好。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"周记8【令人着迷的东西】","date":"2017-04-17T22:57:16.000Z","path":"2017/04/18/周记8【令人着迷的东西】/","text":"一心只为它，再无别的东西。这种着迷沉醉的感觉，久违了。 趣事我初中时的班长跟我打听我一高中女同学，原来他/她们在相亲。我就挺好奇的，问班长怎么知道我跟女主认识的，他说在她朋友圈看到我的评论了。啊啊！朋友圈害死人啊！ 工作本周工作状态不错，连续几天每天效率工作4小时以上。 吐槽一下我们的美工，设计真是高标准高难度，考验我们的技术啊。 小组聚餐一次，加班到7点一次。另外，边听歌边工作效率也是很高的，我之前怎么没发现啊。 思考25岁之前多尝试，人生还有很多机会。除了从事的职业，还可以考虑一下发展别的职业，人不可能一辈子只干一个职业。我还想考虑一下，游戏、动画行业，对这方面我兴趣也很大的。 想起之前堂哥对我挺乐意帮助的，对他来说，我可能是个有用的人，并非没有用，笑。我也应该尽可能帮助后辈，毕竟我是过来人。 我是个三分钟热度的人，想法很多，做的太少。所以实际上是个咸鱼。是不是我有点懈怠了，是的啊，下面我会讲述原因。当然，也想了一下当务之急的2件事，下周开始回归看书模式。 科目二早上缺席一次练车，周六上午去的富阳，练了2天，周一考试，下大雨，线条看不清，不幸的挂掉了。同去的只有一个过了，心里稍稍安慰。大雨天，你说不影响，我是不信的。也有自己紧张着急的原因。 在富阳，一个考试带动了整个村的经济啊。吃的东西价钱都是外面的2倍，考场很大，周围被丘陵包围。我们每天下午3点到6点，早上5.30起床练到11点，吃饭睡觉都在宾馆。 关于考试，只能说运气有点差。回来的路上心情也很沉重，看着天空黑云白云交错折叠，有一种时空落幕的挫败感。再来吧。 因为考试，我的这篇周记拖到这周二才写。 国创讲一讲今年开始的动漫之旅。 我时常逛豆瓣，看一眼近期值得看的电视剧、电影、综艺节目之类，如果评分特别高，我就会去看一下。目前来说，电视剧是真的看不下去了，耗时又无聊，主要是耗时。 先是看了少锦，后又看了全职，觉得近年来国产动画值得一看啊。后来在b站看到一些推荐视频，说镇魂街很燃，就去看了，一点没失望，很好的番。再看到更多人关注的狐妖，再去豆瓣看了下评分，真是高的出奇，剧场版基本都在9分以上。就决定看一下了。 第一篇，中二无节操，是配乐和配音才让我坚持下去的。第二篇王权富贵，剧情来了个大虐，其实这也不能触动我，见得多了，远有仙剑奇侠传系列，近有唐七的古言小说，有点老套了。依然是音乐和配音让我坚持到第三篇。第三篇开始，我看到了美好的一面。音乐、配音、画质、美术，这是一个美的东西。就像是动画电影《侧耳倾听》，我们不拥有美好的东西，但至少我们向往美好的东西。纯粹的欣赏美，不谈个人、不谈共鸣之类美以外的东西。这应该是艺术价值的体现，让人们忘记其它，只记得美就够了。 几天时间补完了番，仍然意犹未尽，我就去看了漫画版，已经更新到讲述500年前的上一代的故事，依然是美丽凄哀婉转的故事。 很久没有这种着迷沉醉的感受了，不得不说这是一部很好很强的番。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"镇魂街","date":"2017-04-11T15:07:35.000Z","path":"2017/04/11/镇魂街/","text":"去年的精品国漫，补番中。比不良人好，少年热血，燃。 另外，不良人弃坑了，这个系列有点偏离初衷了。 再，希望少锦不要偏了，一直正下去就好。 4.12补完更新。 看到后面剧情绕了观众老爷一个弯，许多人看到这个转折之后直呼神作。原来哥哥叫曹玄亮，弟弟叫曹焱兵。观众很容易被先入为主的观念影响，以为高大的曹焱兵是哥哥，剧情也给观众下套，让他们兄弟称呼互换（哥哥死后开始叫弟弟为哥哥）。另外除了剧情神作，配乐也很燃。 其中引入的三国篇也是最热血的。不过在豆瓣上有这样一个评论，说我是一名党员，坚决反对吹捧迷信。我看到这个评论第一反应是抵触，说喜欢的东西坏话当然会抵触。不过很快我就思考了一下，这个评论到底对或者错。我觉得在当下仍然喊反对封建迷信的口号，不合时宜，或者说已经不需要喊了。过去没文化，不知道科学的人很多，当然需要这么喊。但是现在，谁还会去迷信，特别是现在从学校统一培养出来的学生更不会，动漫显然主要的受众是年轻人，反对封建迷信的口号对ta们已经过于遥远。 再说就是于禁的问题。弹幕中刷的最多的是于禁的出场台词：末将于禁，愿世代为曹家赴汤蹈火。历史上，于禁作为魏武的5良将之一，可谓是晚节不保。原因即是与关羽战时投降了，后来辗转经过孙吴回到曹魏。于禁去拜谒曹公墓时，曹丕羞辱了于禁一番，不久于禁抑郁而死。后人评价于禁，总会先说于禁最是毅重，可是却晚节不保。这就是于禁最大的污点，不忠的反面就是忠，在本作中于禁尽到了最大的忠，可以说是后人对于禁的惋惜或者同情大于责备。 关于引入的历史人物、神话人物等等，不免有人说歪曲了历史云云。前几天还有报道批评王者荣耀将荆轲设定为女性，李白设定为刺客。我觉得相反，中国文化博大而深，仍有很多人对历史等一窍不通，没有同一熟知的文化，很难有归属感。弹幕中有人说好想去了解三国历史，谁看到而不欣慰哉。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"周记7【练车】","date":"2017-04-09T12:50:56.000Z","path":"2017/04/09/周记7【练车】/","text":"7天中有5天早上不是5.30就是6点爬起来去练车，辛苦啊。 练车本周7天，4天休息3天上班，5天有练车。练车很消耗精力，被教练说精神上也很苦闷，所以本周无论是工作还是学习都陷入停滞的状况。 完整的有2天，第一天回来精疲力尽，睡了12个小时。后来早上开始练车，过去练1到2个小时。刚开始的时候，被教练说的很惨，虽然没有言语上的侮辱，但还是有讽刺的存在。比若，他说我，你这人怎么这样？我一哪点做的不对，教练就开始在边上巴拉巴拉一堆，不说关键点，就像老师教课说的引子，引子说了30分钟，进出来的课程才10分钟。后来干脆有一次，我练完了换人我就不坐车上了，听到他巴拉别人我也受不了。所以说，我找这个教练并不是他教得好，只是他跟我住的近，可以开车载我去练车这个便利点，他主要是人老了，废话多。并且，我学车学到的技巧都是跟其他学员交流得来的。目前倒库有80%的把握，S曲线还没把握，坡道80%把握。 工作问题我们的测试，真的要吐槽Ta了。首先不把功能走通完，净纠结一些细枝末节，与我们理念不符。 关于学习本周由于一些原因，学习停滞下来了。有点不想看，转而通过电影啊、动漫啊消解精神压力。学车压力挺大的，中间一度有排斥心理，还好总算刷完学时，没那么紧绷了。通过上班的闲时看书，总算落实了，初试效果不太理想，上班环境也是个比较嘈杂的环境。 下周的任务是回归到学习中去，并调整好工作心态。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"全职高手","date":"2017-04-09T06:33:13.000Z","path":"2017/04/09/全职高手/","text":"看了2集，画面写实，声优赞，精品之作。 国漫的春天，文娱产业的春天。 4.21补充 画质是真的好。 5.14更新 有点想弃了，剧情，画面都毫无新意。难道只是给低龄孩子看的吗？ 5.19更新 看了新的一集，总算跳出了游戏内容，回归到真实人物生活上去。可以预见，后面将会是重组战队，重回巅峰的励志故事，而故事的主角是一个20六七岁的电竞里的老人。总之，有期待吧。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"四月是你的谎言","date":"2017-04-09T05:10:14.000Z","path":"2017/04/09/四月是你的谎言/","text":"漫改电影，混b站知道有这么个动漫，人气很高，but，动漫我没看过。我并不是个动漫控。 其实我要说的是这个类型的电影，日本纯爱电影，明显这部可以归于此一类。 09年的《属于你的我的初恋》是我看的第一部此类电影。那时在读高中，正值青春懵懂期，看完满是憧憬，感动地稀里哗啦。大学时看的《恋空》亦同属于此一类。今天这部可以说跟《属于》差不多，感动的是此时读高中的孩子。我的话，只有笑点罢了，波澜不惊。 不同年龄，看同种东西，心情不同，体会不同。 另外，女主是演过《海街日记》的丝丝。很多人说女主丑，去看《海街日记》吧，哪里丑了，键盘侠可以歇歇。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"盗梦空间","date":"2017-04-04T08:52:30.000Z","path":"2017/04/04/盗梦空间/","text":"现实与梦境，你分得清吗？ 这是一部脑洞电影，并且是天才级的脑洞。现实中也有一定的依据，所以看地过程中汗毛倒竖，细思恐极啊。 剧情并不难理解，相对于文科的玄幻还是理科的玄幻好懂一些。电影中对于梦境中的人只要施加kick就可以将其唤醒，就好比我们做梦时，被梦里的人一拳打醒或者吓醒，需要的是强刺激。多层梦境就在多层同时施加kick，逐层唤醒。 电影中还有迷失域，指活在梦里，再也醒不过来。而在梦里时间的流逝跟现实中相比是极其慢的，这不得不让人想起我们的文明中轮回转世之说。人死了究竟有没有另一个世界？在想这个问题的时候，再回想其实都是我们的想法或者脑洞使我们陷入了这样的想象之中。所以，关于人的想法，或者说心理学，探知自我，着实神秘莫测，想来令人不寒而栗。 物理学让我们探知世界，心理学则是探知自己。人类对于自己的认知也和对世界的探知一样，知之甚少。比若说，关于梦，能科学的解释吗？或者对于精神分裂，能有效的治疗吗？对于存在的东西都容易探知，对不存在的东西那就不要太难了。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记6【收件人：张小东】","date":"2017-04-02T14:52:35.000Z","path":"2017/04/02/周记6【收件人：张小东】/","text":"刚跑完步回来，河边小径芳香馥郁，沁人心脾。路上遇见一件趣事，那个门口放了好几口大香炉的房子开门了。本来心中一直奇怪，为什么放几个大炉子在门口，今天总算有点眉目了。原来，那是个烧香的地方，也不知道是祭祀神仙还是祖先，今天那屋子里坐满了人，每人手里拿本书，念念有词。猜想是清明节祠堂祭祖，我还从未见过。 状态周一晚上头痛，8点睡觉。花了大约2个晚上时间把霍比特人看完了。其余晚上利用良好。现在是，一天晚上不学习会自责，一周不学习必定陷入巨大的恐慌，因此，习惯养成后就很难再改回去了。 琐事网上买的桌子、椅子都到了，花了3个小时拼装好，学习用挺好挺舒服的。现在暂时可以不用搬家了。另，驾校也去模拟了。 上班每天工作2小时，空闲6小时。真够闲的，如果空闲时间不能利用，真的是暴殄天物。首先，我把所有收藏的博客分了类，其次整理出了计划，最后开始了部分的学习、准备。虽然还没怎么走，但是已经上路了。 陈毅开国元帅也写过诗的。于江西南昌城外十几公里的梅山，陈毅曾被围，写下了《梅岭三章》。其中有一首的一句，着实打动了我，叫做：此去泉台招旧部，旌旗十万斩阎罗。百科上写了一堆什么体现了什么什么精神等套话。而我从这句诗里看到的是十万死去的兄弟，可能还更多，都是兄弟啊。将军的归宿只能是战场。 写给5年后的张小东亲爱的张小东： 当你收到这封信，你是1个28岁的中年了。不知道你在哪里？在从事什么工作？是不是你喜欢的工作？精神上愉快吗？生活充实吗？找到人生的价值追求了吗？以及最后一点，身边是否有人陪伴？我担心你独身生活了20多年，不再愿意别人插入你的生活，着实为你担心。 关于我为什么给你写这封信。我想你是清楚的，你从大学开始走入了一条歧路，一走好几年。23岁你才明白，你的道路应该是那样走的，所以你在23岁下定决心，一定要回到那条路上。我写这封信给你，除了想知道你的状况，还有一点就是，请你仍记得你的初心，一定要活得精彩。 当你收到这封信，请务必回信与我。告诉我你这5年来，过的是何等的精彩，获得了什么巨大的收获，有否珍惜每分每秒。点点滴滴都请分享与我，我期待你的回答将成为我取得进步的每一分养料。 --寄信人：张小东。日期：2017.04.02","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"闲话1【我的一众朋友们】","date":"2017-03-28T11:27:56.000Z","path":"2017/03/28/闲话1【我的一众朋友们】/","text":"今天比较特别，为数不多的，我跟许多朋友进行了不同的闲聊。 你羡慕我如同我羡慕你跟每天一样，我到了公司，第一件事打开微博浏览新闻。照例给一位朋友的微博评论了一个字“嗬”。她回：“哈”。我接着“哼”。然后她开始给我发私信了。 “在干嘛”“班，你呢”“我今天最后一天上班了”“然后呢，要去拯救世界了吗”“嗯”“嗯你个大头鬼啊，接下来要干嘛去”“不知道” 然后她开始说她工作上的事了，大概不被上司承认。“你不跟他谈一下？把你的想法说出来，再不行才走。”我开始尝试给出建议。“这种东西无所谓对错，一个人一种眼光而已，反驳他。”“如果他只是针对你，而不是针对工作，那就是没必要了” 她又说了很多，见我没回了。“我是不是和你说太多了”她如是说道。“没有，你只是在表达你的心情，然后我乐于倾听”。“决定是你的事，我只是尝试着看能否提供建议”。她回了一个太开心的表情。“看来事情也挺复杂，我也建议不了什么”我补充。“毕竟我也是23岁”。“可是你工作稳定，我工作不稳定”。她仍然很委屈。“你羡慕我如同我羡慕你”她又回复我太开心的表情。 完。 以上是一个从未谋面且相聊不多的一个网友，让别人开心我同样开心。 关闭朋友圈还有一个朋友微博上说，关闭了朋友圈，锁了空间，开始微博。我评论说有想法，然后她说又开了，2333。我就比较有毅力，朋友圈是真关了。 无fuck说我跟一个同学兼好朋友微信上聊天，说到清明节计划。我表示要去苦逼的练车，并跟他吐槽了这边学驾驶的各种麻烦。然后说到他，我说花都开了，正好出去浪。他说早樱都谢了，我说还有桃花、油菜花，不愁没得看。我说油菜花是好东西，花谢了还能榨油。他说是菜籽油(捂脸流泪)。我说你以为我不知道，我故意不说。当时5点钟左右，我说5.30下班了，他说他已经下班一个小时了，而且晚饭都吃了。我无话可说，无fuck说。 灵性QQ列表找人聊天，看到以前游戏里认识的网友。死活想不出来她游戏id叫什么了，就跟她这么说了。她回答了我，叫xx。我说，xx你还在玩那个游戏吗。她说，还在玩，应该快没时间了。我说你有没有点出息，我玩不会超过3个月。她说她在找工作，我问找什么工作。原画师，她说。然后我就让她发我看看她的大作，她发了3张过来。我说外行看热闹啊，有灵性。对的啊，现在找工作要求里面不都写着要有灵性嘛。她的画，人物确实不漂亮，我说有主题的吧。她说有，但是她哥说丑。 然后就没有然后了，她是一个来去如风的人。","tags":[{"name":"闲话","slug":"闲话","permalink":"https://amasawaseiji.github.io/tags/闲话/"}]},{"title":"记一次惊心动魄的考试","date":"2017-03-27T11:42:28.000Z","path":"2017/03/27/记一次惊心动魄的考试/","text":"“哇，题目怎么这么难，好多没见过啊。” “第98题了，我已经错了10个，再错就完了，过不了了。” ”1000？2000？3000？4000？到底选哪个，既然罚款都是200到2000，我选个2000吧。” “我擦，错了！完了，要补考了，补考不要紧，丢脸要紧啊！考个科目一不过，糗大了。” 我在位置上徘徊良久，直到下一个人过来要使用这个位置了，我慢慢走出了考场。 “没过去哪里？”我询问考场门口的人员。 “到那边大厅。” “没过怎么办？”我在大厅问里面的考场人员。 “过没过？” “没有。” “没有到那边排队重新考。” 我快步走出，心中一整窃喜，原来还可以立刻再考一次啊。我有希望，我只差一点。 “考试没过”我在同事群里这么写道。 他们炸开了锅，一顿讨论。没考的担心，早就有驾照的笑了。 再一次答题。 “比上一次简单，坚持住，不要错了，不要错了，不要错了。”我心中默念。 答到最后2题，错了8个，我确定已经过了，最后2题随便答了。91分，及格了！紧张，焦虑，失望，绝望。若然感觉过后，惊心动魄的考试过了！ “差点没过”考完，我把成绩单拍给教练看，并打字写道。 “过了，就好了”教练如是说。 过了，就好了。 苦中作乐最近沉郁太久了，自娱自乐一把。 话说《项脊轩志》有“庭有枇杷树，吾妻死之年所手植也，今已亭亭如盖矣。”一句。 曾有网友恶搞在后面加了一句：今伐之，为搏小娘子一笑。 又有人后面接了一句：小娘子一笑，恰似吾妻年少时。 朋友也在后面又加一句：小娘子为吾妻之女，今伐树，为小娘子造出嫁之物，愿伉俪情深，不输吾与吾妻。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"周记5【永远热泪盈眶】","date":"2017-03-26T16:27:55.000Z","path":"2017/03/27/周记5【永远热泪盈眶】/","text":"这周遭遇今年以来最大危机，情绪起伏特别厉害，思考也相当久，是时候来一场总结了。 琐碎杂事周一还做了一个梦，梦到好像是经人介绍，相亲遇到了一个互相喜欢的妹子，不知何解。 看到一个句子。天已经晚了，但路还有很长。颇受触动。 本周开始，周一还好。周二周三连续2天看了电影，晚上回来没做其他事。早起废了，天天睡到不得不起床上班时刻。电台订阅的十点读书天天更新不喜欢的文章（bobo除外，她选的文章读的声音太好了），后来干脆取消订阅了。长智齿，疼了一周，牙龈出血很难受。周四周五读完《挪威的森林》，周五干脆是熬夜读的。周六也在熬夜，想很多事情，失眠。 工作上想通了一件事，既然不再爱，索性就离开，然后开始为离开做准。 崩溃边缘当我连续2天只看电影，别的什么都没做的时候，意识到心态出现问题，需要及时止损。可惜，根本无法止住，一下子坠入胡思乱想的深渊。早上总是思想通透的时候，一天，我想到关于真性情相对的演。有2种演法，一种是为了适应这个社会不得不演，演给别人看，这种情况有时候假亦真时真亦假，不是没有可取之处，算是生存之道。第二种演法是致命的，演给自己看，掩饰自己，外强中干，自欺欺人，是一种虚荣。而我自己可能处于第二种演法，又想到大学班主任给我的评价，“活在自己的世界里”。这算是第一次反思自身。 在我看《挪》的过程中，当读到绿子父亲去世那段。我想到，当面对死亡时，回顾一生，是否曾留下什么，是不是只有遗憾。因此，当活着时，应该做出点事情来，就算才华有限，做不出事情，至少也应该做出点样子来。第二次反思自身。 《挪》这本书，读完之后，余威仍在，让我一天在恍惚中度过。打羽毛球时，看到师大校徽，想起了自己那段虚度的时光。芙蓉峰下，新月湖旁，初阳东升，历历在目景象；那时年少，那时轻狂，那时匆匆，未曾驻足凝望。 打完球，坐在车里，我感觉这世界于我那样陌生，那样格格不入。巨大的忧伤袭扰着我，仿佛回顾了一整个青春时代。周六下午，睡了一大觉，才渐渐回复到现实世界中。 炽烈是何物？神思游离之际，在知乎上看到这么一句话。很多人25岁就死了，但直到75岁才埋。大概表达的是，自由的灵魂被现实束缚住，从此跟现实沆瀣一气，那个自由奔放的灵魂死去了。 同时还看到一个描述《爆裂鼓手》电影的回答，竟然有5w赞，可能是我见过的最多的。人长大后，心越来越硬，不会再哭。失去了炽烈的感情，既没有炽烈的爱，也没有炽烈的恨，甚至连无助的绝望都没有。我想，这个回答之所以有那么多赞，无疑是它引起了太多人的共鸣。我忽然想起，之前看到过的报道，说日本的一个老人接受采访，说他后悔青春时代没有抓住心爱女孩的手，如果重来，他无论怎样都不要放手。感人至深吧？但我读完《挪》之后，我认为这不过是一厢情愿。如果重来，当你处在青春时代，你根本没法改变任何事情，你已经陷入泥淖，你的心境做不到那样。 深夜中心灵的无声哭喊周六晚上，我本打算熬夜读一下《世界尽头与冷酷仙境》，这周就这样浑噩的过去算了，下周再来。谁料，根本读不下去，白天睡了，晚上也睡不着。想找部电影看，既然是深夜，找个能让人深夜痛哭的吧。找了一圈，真没有。我就是单纯的想哭一下，做不到吗？当我发现，无论怎样我都哭不了，我陷入巨大的恐慌中。真被那个回答说中了，我已经不再会炽烈，没了热血。或者是冷漠，或者消解情绪的本领太强。总之，我已经丧失了哭的能力。在我悲哀的睡去时，忽然做了一个梦，梦中我的灵魂将要离开肉体，我挣扎着，我要反抗。于是我醒了，此时依然像梦中那样动不了，然后浑身表皮发热，热量迅速退去之后，我害怕的蒙上了被子。我想我是不是身体得病了，怎么身体会发热。后来当我起床浑身肌肉酸痛时，我想大概是运动后又熬夜，导致乳酸没法生成导致的吧。 无意间，又看到一句话。叫做：“永远少年，永远热泪盈眶。”这句话也跟那个炽烈的感情交相辉映。对，我们不应该在25岁就失去自由的灵魂，永远少年，永远热泪盈眶。 ps.也不知何故，我突然又重新燃起斗志，这股力量，足以使我一星期埋头苦读。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"挪威的森林","date":"2017-03-25T13:20:25.000Z","path":"2017/03/25/挪威的森林/","text":"早前看过电影版。今天注意到电影是2011年大陆上映的，观看时我在读大学。只记得当时看不懂，看完还去百度女主是不是自杀了，可笑。 后来从一篇博客看到博主读的书，有村上的书，国境以南太阳以西。买来读了，觉得很喜欢村上的文字。再有机会，就买回来了这本。 精妙的文字 《挪》既是死者的安魂曲，又是青春的墓志铭。 死并非生的对立面，而作为生的一部分永存 哪里会有人喜欢孤独，不过是不喜欢失望。 我要说的，只是希望你不要用不自然的方式磨损自己。懂吗？那是最得不偿失的。十几岁二十岁，对人格的成熟是至关重要的时期，如果在这一时期无谓地糟蹋自己，到老时会感到痛苦的，这可是千真万确。 小时候凭一点小聪明，不用功也弹得不错，对此大家免不了夸奖一番，于是本人便把用功看成了无聊勾当。 就这样，他们不懂得下苦功夫，忽略了对人格形成必不可少的这一主要因素。 对于只身独处的人来说，四月实在是不胜凄寂的时节。 四月过去，轮来五月。五月比四月还要难以打发。 当然我很遗憾，遗憾你同直子未能迎来大团圆的结局。然而归根结蒂，又有那个人能明白哪个算是好结局呢！因此你无须顾忌谁，若你认为可以获得幸福，那就即时抓住机会！以我的经验来看，人的一生中这种机会只有两三回，一旦失之交臂，一辈子都将追悔莫及。 绿子 恕我免去客套。这封信是在你去买可乐的时候写的。给坐同一条凳子的人写信，在我还是初次。但不这样做，似乎很难把我想说的传达给你，因为无论我说什么你几乎都听不进去，是吧？嗯，你可知道？今天你做了一件十分使我伤心的事：你甚至没有注意到我发型的变化吧？我辛辛苦苦一点点把头发留长，好不容易在上周末把发型变得像个女孩模样，可你连这点都未察觉吧？我自以为十分可爱，加之久未见面，本想吓你一跳，然而你根本无动于衷，这岂不太跟人过不去？反正你现在恐怕连我穿什么衣服都记不起来了。我也是个女孩！你就是再有心事要想，也多少该正眼看我一下才是。只消说上一句“好可爱的发型”，往下无论你做什么，哪怕再心事重重，我都会原谅你。所以，我现在向你说谎，什么要同姐姐在银座会面，全是谎话。本来我打算今天住在你那里，睡衣都带在身上。是的，挎包里装有睡衣和牙具。哈哈哈，傻瓜似的。但你偏偏不肯邀我去你住处。不过也好，既然你不把我放在心上而似乎乐得一人孤独，那么就让你孤独去，去绞尽脑汁想各种事情，想个彻底！不过这也并非说我对你有多么恼火。我仅仅是感到寂寞。因为你对我没少热情关照，而我却一次也没为你效力。你总是蜷缩在你自己的世界里，而我却一个劲儿“咚咚”敲门，一个劲儿叫你。于是你悄悄抬一下眼皮，又即刻恢复原状。现在你手拿可乐回来了，一副边走边沉思的样子，我恨不得跌你一跤才解气，可你并未跌跤。你正坐在旁边，“咕嘟咕嘟”喝可乐。买可乐回来时，我还在期待你注意到我的发型，说上一句“嗬，发型变了嘛”，结果还是落空了。假如你注意到，我会把这封信撕得粉碎，说：”喂，去你那里好了，给你做一顿香喷喷的晚饭，然后和和气气地一起睡觉。”但你像一块铁板似的麻木不仁。再见。附记：下次在教室见面不要打招呼。 “为什么？”绿子吼道，“你脑袋是不是不正常？又懂英语虚拟语气，又能解数列，又会读马克思，这一点为什么就不明白？为什么还要问？为什么非得叫女孩子开口不可？还不是因为我喜欢你超过喜欢他吗？我本来也很想爱上一个更英俊的男孩，但没办法，就是看中了你。”“我可是有血有肉的活生生的女孩，”绿子把脸颊擦在我勃颈上说，“而且现在就在你的怀抱里表白说喜欢你。只要你一声令下，赴汤蹈火都在所不惜。虽然我多少有蛮不讲理的地方，但心地善良正直，勤快能干，脸蛋也相当俊俏，乳房形状也够好看，饭菜做得又好，父亲的遗产也办了信托存款，你还不以为这是大甩卖？你要是不买，我很快就到别处去。” 我的理解看完书，又去看了电影，电影真的很糟，本来忧郁凄美甚至还有治愈有哲理的故事，变成了阴森恐怖甚至可怕的东西。或者说电影对于故事中的人物的死去理解的不好。 序言中也说了，故事中人物一个个死去，干嘛要死？村上解释说死意味着消失。可能真实中就是失去而已，只不过小说的情节上表现为死去了。死还意味着，这种失去，是无法复得的。电影中对于死表现的太过，简直是恐怖。 简单说，这就是一部青春小说，只不过表现形式上，比较另类，这也就是村上之所以是村上的原因，他有他的风格。首先对于渡边的第一次，处理成性冲动，不存在感情，称不上为初恋，对应于青春期的性幻想。对于直子，是真真切切的初恋，存在着究竟爱不爱的问题。渡边绝对是爱上了直子，最后一章提到渡边孤魂野鬼似的一路游荡，并且说，失去心爱之人的悲伤是无法治愈的，爱之深痛之切。直子对渡边，就像她的病一样，是病态的。她忘不了木月，却也没忍住冲动，跟渡边睡觉了。她渴望渡边能一直留在她身边。也许如果渡边也不去上学一直陪在她身边结局会不一样。但是青春是没有如果的，由于一些原因，渡边跟直子无法待在一起，最终失去了直子。对应于我们可能就是异地恋之类的。而且渡边认为对直子他是有责任的，就像我们认为我们也应该一生只爱一个人，绝不始乱终弃一样，也算是一种责任。而在渡边生活的身边，有绿子那样敢爱敢恨，直白大胆的女孩子。面对这样独特的女孩子，渡边简直无法抗拒的爱上了她。对于我们，生活身边同样存在这样独特而无法抗拒的人或事或东西。最终我们失去了，懂得了，在下一次机会来临时，才更加珍惜的把握。正如小说最后说，失去心爱的人的伤痛无法被治愈。我们也是带着那份失去的伤痛继续上路。 我的感想无疑，这本小说给我的触动很大。上一次是在看了电影情书之后，上上一次是在去年读了白夜行之后。有种颠覆了整个认知世界的恍惚感，感觉活的这个世界不真切，沉浸其中，有种周梦蝶的情境。睡了一觉，才从那个世界走出来。 上午去打羽毛球，在师大杭幼师学院，看到师大校徽，记起大学时代的时光，尽管于我那是段糟糕的时光。心中想到一些句子。那时匆匆，未曾驻足凝望。非常怀恋，甚至怀念大家一起打游戏，没人愿意下楼拿外卖的场景。然后打球心不在焉。下午睡了一觉，醒来后那种感觉才渐渐淡去。因此，这本书是我今年目前为止独到的最喜欢的书，并且值得不同时期，多读几遍。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"给孩子的诗【北岛选编】","date":"2017-03-22T13:44:56.000Z","path":"2017/03/22/给孩子的诗【北岛选编】/","text":"源于一个给我深刻印象的博客作者，在他的博客中引用过北岛的诗。本来打算买北岛的两本诗集，但我不确定我是否对诗歌有那么大的兴趣，索性先买了这本给孩子的诗。其中不乏耳熟能详的名篇，如普希金的【假如生活欺骗了你】，叶芝的【当你老了】，余光中【乡愁】，海子【面朝大海，春暖花开】。也有一些闻名却不详知的诗人，以及惊艳到我的诗篇。 the road not taken高珊唱过的同名曲，当初在电视剧何以笙箫默中听过。百度百科上译作未选择之路，书中译作未走之路。有意境而又富有哲理的诗，作者叫做弗洛斯特。 你不快乐的每一天都不是你的 你不快乐的每一天都不是你的 你只是虚度了它。无论你怎么活 只要不快乐，你就没有生活过 … 积雪 （金子美玲） 上层的雪很冷吧冰冷的月亮照着它 下层的雪很重吧上百的人压着它 中间的雪很孤单吧看不见天也看不见地 在风中飘 一个人要走多少路别人才把他称为人一只白鸽要飞越多少海才能在沙滩沉睡炮弹要发射多少次才会被永远报废我的朋友，答案就在风中飘答案就在风中飘… –新晋的做贝尔文学奖得主鲍勃迪伦，才华堪比莎士比亚 我是一个任性的孩子 (顾城) …我想在大地上画满窗子，让所有习惯黑暗的眼睛，都习惯光明…","tags":[{"name":"诗歌","slug":"诗歌","permalink":"https://amasawaseiji.github.io/tags/诗歌/"}]},{"title":"周记4【自由之思考】","date":"2017-03-19T11:05:13.000Z","path":"2017/03/19/周记4【自由之思考】/","text":"工作本周工作状态不错，有一天上班走在路上，感觉心情愉悦。 工作也不是一直有事情做，空闲的时间怎么好好利用呢？我先是准备读读专业书，带了书去。结果发现根本没有此条件，我的座位就在领导办公室门前，不太好意思把电脑放一边，把书拿出来读。而且会让别人觉得你这个人好闲，没事情做。就此作罢。但是有个没什么遮拦的同事，讲我拿书了，还大声说出来，翻了一翻我的书，看到上面有标记，问我看了几年了。虽然心中愤怒，但我不会发作，鄙视别人看书的人很浅薄。 那这个空余时间怎么利用呢？我所想到的是，多学学专业知识，提高编程水平。 有一天打卡出现故障，我们公司系统天天出故障。然后很晚才下班，坑死。 面对上司的批评，有点不服，后来想想也是自己做错了，没按要求来，也没跟别人沟通，涨涨记性吧。但是作为组长，直说别人做出来的东西丑，很不利于凝聚人心，拉远跟成员的距离吧。如果我作为上司，我会注意这点。 个人生活就博客终于整理完了，填了一坑。 对于别人的帮助，不能草草回应，更加不能不回应，这是最起码的礼貌。 本来想搬个房子的，结果周末有点累，有点懒，只能下星期来做了。 然后还要开始记账，原因是去超市买东西，一个陶瓷水杯30块钱，我淘宝不到10块好吧，能在网上买的东西，坚决不去实体店！ 电台里听来的歌放入了一个单独的歌单，年末总结可能用得到。 电台轶事听到一篇句子写的很美的文章，名字叫做我离婚了，作者叫晏凌羊。好奇查了下，是文科状元呢，并且出过书，评分有7.6，已加入预购书单。 挤时间本周杂事太多，正事做得少。并且周末依旧没能充分利用，周六下午睡了觉，周日早上晚起，并且看了一个3个多小时的电影，也浪费了一些时间。 时间还是很不够的，要做的事情有点多，接下来就要思考如何挤出时间来以及怎么充分利用时间了，这将是下周的研究课题。 自由之思考这周读完了三毛的撒哈拉的故事，每天读个2到3章，300页也挺快就读完了。这本书不多说。三毛在家书中提到了对父母的感恩，说到孝亲。今天，偶然看到在b站的复旦教授陈果的公开课视频，虽然只短短看了一小段（全部足有3小时），还是得到了2个重要的东西。一个是真，真性情，不做作，不表演，真为美。二就是感恩之心，我们需要感恩的人足够多，我最觉得亏欠的是父母，从来不曾有过给予，甚而有些抱怨，我已在改了。多读书，多思考，做一个无愧的人。陈果的视频抽时间再看吧。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"撒哈拉的故事","date":"2017-03-19T02:01:08.000Z","path":"2017/03/19/撒哈拉的故事/","text":"在豆瓣哪篇（好像是王小波的书）的书评区看到的这本书的推荐，推荐语大概是生活的情趣之类的字眼。 初读前面几章，感叹道，这才是有趣的人啊，给我的惊喜让我觉得这可能是本年度到目前为止读过的最好的书了（超过追风筝）。 再读，有一些地方觉得有哗众取宠之嫌。 后来，还是被作者的人格魅力所折服，这已经无关文字，更无关文学。 我想人们推崇三毛，不是因为她的文字，而是人们喜爱她这个人，甚至有的人视她为精神偶像。她的生活，她的感触感染了我们，我们向往她的经历和浪迹天涯。无疑，她所代表的就是那诗和远方。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"周记3【睡觉是个大问题】","date":"2017-03-12T15:38:40.000Z","path":"2017/03/12/周记3【睡觉是个大问题】/","text":"有关工作一个是遇到一时解决不了的问题怎么办，这是个心态的问题，只有慢慢来，着急解决不了问题。另一个就是加班加吗？我讨厌加班，讨厌承诺制。但是有必要时还是要加班的，而且是要有效率的，这一点这一周我做的还算好。 熬夜晚起上周我说的控制意志力，但是这个太难控制了。无法做到不去娱乐一下，还是不要灭人欲了。重要的是娱乐不能太过，需要止损，最好不要超过1天，就要回到自律状态中去。到目前为止，我是没有超过1天的，还算欣慰。 然后就是大问题，该睡的时候睡不着。睡不着就熬夜了，刷微博看视频，持续兴奋着。这就导致第二天计划完全打乱，甚至迟到。找了一些如何入睡的办法，有一个有点效果。持续四肢完全崩直，慢慢全身血液贯通，非常舒适，舒适的状态下才容易睡着。 另外，开辟了一个新的小习惯，听电台。不愿意睡去是对今天放不下，对明天的到来恐惧。今天就需要做点有满足感的事情才好，比如看一段完整的视频、读一篇文章。电台里可以听一篇文章，很容易产生满足感，睡前听电台。还有就是明天早起的动力，可以早上起来干点兴奋的事情。如果知道第二天早起有事情做，很容易早起，睡醒也可以听电台，听励志的。 驾考周末去了理论上课，才意识到驾考这个流程太繁琐了，预约理论上课、预约结业鉴定、预约科目一。所有事情都要预约，我对我何时能学完感到很迷茫。 时间管理发现时间太少，要做的事太多。时间管理将是下周研究的内容，目前还没有什么想法。只知道，完整的时间段不要做碎片化的事情，碎片化的时间就用来做碎片化的事情吧。 整理博客有感最近分了几次对2016年的写的东西贴到这里。看到旧时写的一些东西，有点感触。旧时的我戾气很重，现在看到那些负面的文字，觉得自己以前真是不该啊，蠢了。然后意识到可能自己又成长了一些吧。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"计算机是怎样跑起来的【计算机知识大纲】","date":"2017-03-09T22:51:58.000Z","path":"2017/03/10/计算机是怎样跑起来的【计算机知识大纲】/","text":"知识点 GBK字符编码，汉字占用2字节。UTF-8，3个字节。 硬件由大量IC(集成电路)组成，上的引脚，有的用于输入，有的用于输出。 编译：把编程语言编写的文件(源文件)转换成机器语言编写的文件。 .NET是微软提出的技术。 2种编程方法：面向组件编程、面向对象编程。 GUI(图形用户界面) 算法 字符串的末尾用0表示，链表的末尾用-1，这些特殊字符是哨兵。 辗转相除法，机械求解最大公约数。2种方式，减法和除法。减法：2数中大数减去小数，直到两数相等，相等的这个数就是最大公约数。 典型算法。 名称 用途 辗转相除法 求最大公约数 埃拉托斯特尼筛法 判定素数 顺序查找、二分查找、哈希查找 检索数据 冒泡排序、快速排序 数据排序 最小公倍数。2数乘积除以最大公约数。 埃拉托斯特尼筛法，用待判定的数除以比它小的所有正整数，余数为零，可以整除，不是素数。利用的是计算机的处理速度，同样适用于计算鸡兔同笼问题。 执行时间短的算法更优秀。如，判定素数，只需要从2到待判定数的平方根即可。 线性搜索，从头到尾依次查找。哨兵，多用于此。加个特殊元素，减少判定次数。 数字间的规律，如石头剪刀布游戏判定输赢，0、1、2表示三情况，B+1除以3的余数与A相等，就是B获胜。 数据结构 栈和队列，栈存取形式是LIFO(后进先出)，队列是FIFO（先进先出）。 每个存储单元，8比特数据。 数组应用于线性搜索、冒泡排序。 123456789for (i = 999; i &gt; 0, i--) &#123; for (j = 0, j &lt; i, j++) &#123; if(x[i] &gt; x[j]) &#123; tmp = x[i]; x[i] = x[j]; x[j] = tmp; &#125; &#125;&#125; 典型数据结构 名称 特征 栈 小山堆积一样 队列 排成一队 链表 任意改变数据排列顺序 二叉树 把数据分为两路排列 二叉树是链表的特殊形态。 数组可以转化为栈或队列。 栈需要一个数组，一个变量。变量是索引，指向栈顶数据，是栈顶指针。数组、栈顶指针、入栈函数、出栈函数组成了栈。注意：栈顶指针指向的不是栈里顶端上的数据的地址，实际上是这个数据上面的地址。 1234567891011121314char Stack[100];char StackPointer = 0;/*入栈函数*/void Push(char Data) &#123; Stack[StackPointer] = Data; StackPointer++;&#125;/*出栈函数*/char Pop() &#123; StackPointer--; return Stack[StackPointer];&#125; 队列。数组、存放队头数据索引的变量、存放队尾数据索引的变量、存取函数。尾部存储满到最后，会折回数组的开头。逻辑结构变成圆环，循环利用。 123456789101112131415161718192021char Queue[100];char SetIndex = 0;char GetIndex = 0;void Set(char Data) &#123; Queue[SetIndex] = Data; SetIndex++; if (SetIndex &gt;= 100) &#123; SetIndex = 0; &#125;&#125;char Get() &#123; char Data; Data = Queue[GetIndex]; GetIndex++; if (GetIndex &gt;= 100) &#123; GetIndex = 0; &#125; return Data;&#125; 链表。c语言中用自我引用的结构体组成的数组表示链表。 123456struct TestResult &#123; char Chinese; char Math; char English; struct TestResult* Ptr;&#125;; 二叉树。有2个自我引用结构体的链表。用于搜索数据的算法，如二分查找，更快。 1234567struct TestResult &#123; char Chinese; char Math; char English; struct TestResult* Ptr1; struct TestResult* Ptr2;&#125;; 面向对象编程 缩写为OOP。C++在C的基础上增加了面向对象的机制。Java、C# 是对C++进一步改良。 结构体，操作数据的函数在外部。而面向对象编程可以把函数也放在内部。技巧有封装、继承、多态。 面向对象编程和面向过程编程是一对反义词。 多态指的是，针对同一消息，不同对象可以进行不同的操作。 .NET支持C# 数据库 DBMS缩略语。一张表由行和列组成，列被称为字段、属性，行被称为记录、元组。 SQL，结构化查询语言。 关系型数据库。 客户端、服务端。 主键和复合主键(多个字段组成) CRUD.插入（CREATE）获取(REFER)更新（UPDATE）删除（DELETE） TCP/IP网络 LAN（局域网） 传输控制协议和网际协议(TCP/IP) MAC地址：网卡编号 WAN（广域网） 集线器连接计算机，路由器连接互联网。 以太网网卡 CSMA/CD 带冲突检测的载波监听多路访问，是连接LAN计算机的方法。多路复用，是多个设备同时访问传输介质。 MAC地址由厂商编号和产品编号组成，每个都独一无二。 IP地址是软件上的编号。TCP/IP中传输数据都要带MAC地址和IP地址。IP地址是32比特的整数，8个一组，分4段。IP地址的范围，0.0.0.0~255.255.255.255.前三段是网络地址，后一段是主机地址。子网掩码就是标识出网络地址和主机地址。子网掩码转换的二进制数中，值为1表示网络地址，0的表示主机地址。与MAC地址一样，IP地址也是唯一的。 DHCP（动态主机设置协议）服务器获取IP地址和子网掩码。 默认网关存放路由器的IP地址。 DNS(域名系统)，解析域名为IP地址的服务器。其中记录着域名和IP地址的对应表。 ARP（地址解析协议），把IP地址转换为MAC地址。使用广播的形式。也有缓存表，记录对应表。 IP协议指定目标IP地址和路由器转发。TCP协议是双方相互回应确认信号，可靠传输数据。称作握手。通过包这种数据单元。 MAC信息 IP信息 TCP信息 数据 错误检查信息 网卡-设备驱动程序-IP协议程序-TCP协议程序-应用程序。层级结构。 TCP端口号识别上层的应用程序。web使用80，发送邮件25，接收邮件使用110. 数据加密 秘钥，用于加密和解密的数字。 XOR，逻辑异或运算。二进制，同则0，不同则1. 对称密钥加密技术，特征是加解密密钥相同。密钥的通知不安全，不适用于互联网。 公开密钥加密技术。加密密钥公开，解密密钥私有。公钥和私钥。 RSA，实现公开密钥加密技术的算法，三个字母代表三个三个发明者。 数字签名。MD5,信息摘要。 XML 可扩展标记语言。元语言。 HTML，超文本标记语言。 &lt; &gt; &amp; “ ‘ 5个特殊字符用&amp;lt &amp;gt &amp;amp &amp;quot &amp;apos 表示。&lt;![CDATA[ ]]&gt; 括起来就可以直接使用上述5种特殊字符了。 表示注释。 W3C(万维网联盟) CSV，只记录了信息，没有给信息赋予意义，比XML差一筹。 XML命名空间。xmlns=命名空间 的形式。 SOAP（简单的对象访问协议）用于分布式计算。分布式就是把程序分散在网络连接起来的计算机上。","tags":[{"name":"计算机科学","slug":"计算机科学","permalink":"https://amasawaseiji.github.io/tags/计算机科学/"}]},{"title":"情书","date":"2017-03-05T16:20:11.000Z","path":"2017/03/06/情书/","text":"真的很惭愧，直到现在才完整看完这部电影。 大学时代曾看过一点，只是没看下去。毕业后，偶然有个人谈论电影这个话题，他一定对这个电影非常喜爱，所以介绍起这个电影起来滔滔不绝。如今，我是在top250里再看到这个标签，才重新拾起。 微博上曾有过某中学发现学长藏在墙壁里的情书，火极一时。大家纷纷要找到那情书所说女主，找到后，女主表示都过去多少年了，早就忘记了。 我们欣赏那种美好，向往那种美好，尤其是暗藏的，更加稀有。因为我们都有过。这个电影表现出了那种美好，无论是景物、人物、所有的一切，它本该美好，又讲的是这种人人都经历过的美好的故事。足以载入影史。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记2【我不相信】","date":"2017-03-05T12:48:28.000Z","path":"2017/03/05/周记2【我不相信】/","text":"这周主要是工作上的问题，还有就是个人也有了一些问题，结果就是有点糟糕。 同桌走了去年来的实习生，坐我旁边的。周一突然说家里叫他回家，他女朋友也回去了，于是他也就要回家发展了。真是突然呢！ 工作困扰工作上呢，我主要问题就是业务理解能力不足，也没有技术架构能力。结果呢，有些问题我就无法彻底且妥善地解决。最后也就只有跟上级沟通，搞一些暂时做法。 优秀同事我有一个非常优秀的同事，就是那种大学里是学霸的那种。他业务能力很强，工作极其认真。有时候就感觉我跟人家有差距，有些不服气。换个角度，这其实也是提升自己的一个榜样，多跟人家交流，紧跟人家步伐，这样的话自己差不多也会变得更优秀吧。 驾考这种自己的事一定要自己积极一些，要不然，考试的人那么多，排队排到黄花菜都凉了。 关于读书这两周，确实读了挺多书。但是呢，都是杂书，我想以此为引子锻炼一下状态，接下来开始真正的学习。所以接下来就是读专业书，专业学习为主了。还有读书的方法，不同的书应该有不同的读法。小说就通读一遍，结论性的书应该做记录笔记。 效率意志我发现上周这方面还挺好的，这周明显有下滑。主观认为这跟我三分钟热度的性格有一定关系，凡事没能坚持多久，去年就是这样。容易心有杂念，就坚持不下去了。周末更是，干脆一整天都在刷直播。完了又开始懊悔，进而产生极大的负能量。这种情况周而复始，人就被拖垮了。关于效率和意志，真的要找办法好好治治了，要不然就如上瘾一样，一点点蚕食，最后人生就这样虚度了。这是下周首要需要解决的课题，目前只想到读一些诗或许能缓解一些。 北岛的诗，作为结语。 告诉你吧，世界 我–不–相–信！ 纵使你脚下有一千名挑战者， 那就把我算作第一千零一名。 我不相信天是蓝的 我不相信雷的回声 我不相信梦是假的 我不相信死无报应 如果海洋注定要决堤， 就让所有的苦水都注入我心中 如果陆地注定要上升， 就让人类重新选择生存的峰顶。 新的转机和闪闪星斗， 正在缀满没有遮拦的天空 那是五千年的象形文字， 那是未来人们凝视的眼睛 。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"恶意","date":"2017-03-04T13:22:17.000Z","path":"2017/03/04/恶意/","text":"本来不打算再写一篇的，因为相较于嫌疑人、白夜行还是有差距的。但是可能接下来不会再读东野的书了，就对东野圭吾做个总结吧。 最初只看过电影嫌疑人x的献身，当时震撼挺大的。后来一个同学对嫌疑人的电影的评价，让我回忆起这个故事，于是买来实体书来看了。迅速读完，只是对于已知的故事，震撼没那么强烈了。 后来恰巧有 kindle 购书券，就一下买了解忧杂货店以及白夜行。先读的白夜行，是在一个假期读的，读完我就认定这本是我当年度读的最好的书了。就像评语说的，《白夜行》中的爱情极度炽烈，令人粉身碎骨。我认为则是，读完之后有种貌似读完的感觉，好像什么都没太说清楚，但其实已经说清楚了，给人以莫大惆怅感的结局。甚至需要一些时间来平复这种震撼的心情。 解忧杂货店，可能阅历不够，读不出太深层次的意思。 今天又读了一本东野早期作品，就是这部《恶意》。相较于《白夜行》、《嫌疑人》差了些，读完也没什么想说的。 对于作者东野圭吾，引用一段我也生以为然的评语作为评价。 后期笔锋越发老辣，文字鲜加雕琢，叙述简练凶狠，情节跌宕诡异，故事架构几至匪夷所思的地步，擅长从极不合理之处写出及其合理的故事，功力之深令人瞠目骇然。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"向前一步","date":"2017-03-03T12:54:37.000Z","path":"2017/03/03/向前一步/","text":"作者是 Facebook COO（首席运营官），1969年生，成功女性。 才意识到这类讲观点和经验的书是要做读书笔记的，不然看完差不多也忘完了。好在中途也开始了一些摘录。 不自信时，假装自信。 征求他人的建议有助于人际关系的建立。 分享自己的情绪，有助于建立更深层次的人际关系。（深表同感） 如果一个等着别人来告诉你应该做什么，就不可能成为领导别人的人。 只谈公事并不总是最佳的工作方式，将工作和生活完全分离就没什么意义了。不要害怕工作时谈起家里的私事。（又上了一课） 真正的领导力来自真诚的表现，以及不太完美的个性。 一个人对自己的工作越满意，就越不可能辞职。 如果你想要一位能平等相处的伴侣，那么从一开始就要建立平等的关系。（有用） 我们创建的家庭模式其实根植于童年的记忆。 完成，胜过完美。（作者座右铭，也对我启发很大） Facebook初创时期，天天晚上黑客长跑大赛。扎克伯格本人是个夜猫子，难怪有人说他睡觉都在编程。 成功是为自己做出最好的选择，并且接受它们。（独到的见解） 准时下班回家是件很重要的事。（有启发）","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"富爸爸穷爸爸","date":"2017-02-28T17:42:56.000Z","path":"2017/03/01/富爸爸穷爸爸/","text":"一本颠覆思想的财物启蒙书。对于一个小白来说，书中提到的很多观点是具有颠覆性的。以下仅记录我从中领悟到的。 努力学习，找一份工资高的工作，努力工作。这种模式犹如老鼠赛跑，很难从中跳出。不能为钱而工作。 理解资产和负债。增加资产，减少负债。按揭买房是一大负债。分期付款、信用卡都是。 除了职业，还应拥有事业。事业是资产项，资产产生收入。 财商包含会计、投资、市场观察力、法律知识。 投资自己的头脑，不应只了解一个专业技能，不断学习新东西。克服懒惰，自律。 这本书算是启蒙书，给你提供一种新思路。并且年龄越小的孩子读这本书收益越大。大人读由于丧失一些优势或者固有观念难以改变效果大打折扣。 仍然有一些指导性的东西。比如对于现阶段的我，应该怎么做呢。首先需要攒一笔资金，这需要适当的消费观念。同时学习财务方面的专业知识，再开始投资。再然后，不断用钱赚钱，开公司，实现财务自由。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"影视书（2017）","date":"2017-02-26T14:59:12.000Z","path":"2017/02/26/影视书（2017）/","text":"电影 序号 片名 上映时期 豆瓣得分 评分人数(万) 影评 1 勇敢的心 1995 8.8 28 95年的水平，相当震撼了。以及对于苏英战争欧洲史的一点开荒。 2 七月与安生 2016 7.6 23 实话说，有点强。周冬雨演技爆表了。 3 星球大战外传：侠盗一号 2017 7.3 9 这电影看的，全程一半在睡觉。如无装逼需求，弃坑。 4 西游伏妖篇 2017 5.7 20 春节档的商业片，经典的配乐还能唤得起多少情怀 5 面纱 2006 8.2 8 06年西方人到中国拍的电影。吕燕真是丑的可以，西方人反以为美？当爱与责任合二为一，恩典便与你同在！结局也是现实中正确的结局。 6 奇迹 2011 8.7 1 看完小说再看电影，总觉得哪里不够。文字传达的东西比影视信息量大吧。 7 阿甘正传 1994 9.4 68 人生是由命运和偶然共同构成的。影评 8 比利林恩的中场战事 2016 8.4 17 没经历过战争，无法理解他们。比利数度落泪，为自己也为他的宿命。影评 9 步履不停 2008 8.8 5 关于家庭、关于生死，淡淡的、安静的、细腻的体会感知。多珍惜与亲人在一起的时光… 10 如父如子 2013 8.3 4 怎样为父，未来的课题。我还是喜欢这样的讲好故事的是枝裕和。 11 情书 1995 8.8 35 揭秘暗恋。影评 12 言叶之庭 2013 8.2 10 快去看豆瓣有用最高的长评论，笑疯！ 13 无人知晓 2004 8.9 4 生命的悲壮 14 宾虚 1959 8.6 1 耶稣可以带走人的苦痛、怨恨，太他妈神了！ 15 活着 1994 9.0 25 草菅人命啊！演员们演的太好了 16 乱世佳人 1939 9.2 26 名不对题！什么乱世佳人，叫飘还契合点。 17 驴得水 2016 8.3 26 每个人都代表了一类人 18 挪威的森林 2010 5.9 9 看过小说就知道，不对路。影评 19 死亡诗社 1989 8.9 26 大多数人都是平静而绝望的活着，绝少的人走那条少有人走的路，这条路激动人心，却也在危险边缘。设法不被永远困住，不妥协。 20 霍比特人1：意外之旅 2012 8.1 21 悠扬辽阔的音乐，壮丽雄伟的景观，还是魔戒的味道。 21 霍比特人2：史矛革之战 2013 8.2 18 没能在电影院欣赏3D效果很遗憾，精灵王子武戏太帅了。 22 霍比特人3：五军之战 2014 8.2 18 毕竟魔戒在前，整个三部曲实在是平庸了些，再见了中土世界。 23 阳光灿烂的日子 1994 8.7 25 看看身边的大爷大妈，你可别小看了，TA们的青春也曾壮怀惨烈 24 燕尾蝶 1996 8.6 10 里面的歌曲比较好听 25 盗梦空间 2010 9.2 73 天才电影。影评 26 教父 1972 9.2 33 男孩成为男人，言过其实。少年如何做大事，胆气罢了。当大佬多生孩子是有道理的，总有一个有能力的。 27 枪火 1999 8.6 8 很抓人的电影，剧情真的厉害。 28 教父2 1974 9.1 17 最后一段神了。 29 教父3 1990 8.7 12 那一声悲鸣令人动容。 30 纵横四海 1991 8.7 13 属于那个时代的浪漫主义，难忘的3人组，每个都光彩夺目。 31 四月是你的谎言 2016 5.7 0 为丝丝打3星。影评 32 白鹿原 2012 6.2 7 看了电影想去看原著，电影有点片面，快拍成西西里了。 33 情人 1992 8.0 8 一赴别国，两情永诀。跟《面纱》格调很像，西方人到东方拍的片子。 34 辛德勒的名单 1993 9.4 36 救一个人就是救了一个世界。 35 蓝色大门 2002 8.2 25 如果你1年后，或者3年后，开始喜欢男生，一定第一个告诉我。 36 彗星来的那一夜 2013 8.3 14 平行世界，想来就够惊异的了。 37 哈利波特与魔法石 2001 8.6 23 正太是正太，萝莉是萝莉的。 38 心灵捕手 1997 8.7 25 那不是你的错，泪湿眼眶。外表再强悍，心理防线溃败的时候，也哭的像个孩子。影评 39 爱乐之城 2016 8.4 28 歌舞的元素引人入胜，剧情有点俗套，不禁想起了One Day 40 卡罗尔 2015 8.2 11 为同性恋发声。 41 黑鹰坠落 2001 8.5 10 大场面的战争片，决策者的错误导致士兵送命。 42 中央车站 1998 8.7 7 人性的真情，天边的朝云。 43 疯狂动物城 2016 9.2 45 树懒飙车太逗了。 44 倩女幽魂 1987 8.6 22 演员胜过剧情，原故事比较好，只是不能拍出来。影评 45 萤火之森 2011 8.7 14 东方禅学，物本无价，与我交流乃有价。 46 人工智能 2001 8.6 17 狗血，脑洞太大，而且有点毛骨悚然。 47 东邪西毒 1994 8.6 23 披着武侠的外衣诠释情、人生。少有的大师级电影。 书籍 序号 书名 豆瓣得分 书评 1 你一定爱读的极简欧洲史 8.3 从另一个维度解读欧洲史，但也多是对中学历史知识的一点回顾。书评 2 奇迹 7.7 最初怀着美好的愿望制定目标，阻挠总会如期而至。但要相信，当你达成目标而收获的绝不仅仅是当初的那点愿望了，会有很多很多收获！致敬那些为目标百折不挠奋斗的人儿吧，因为那才是真正的勇者！书评 3 国境以南太阳以西 8.4 文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。书评 4 追风筝的人 8.8 无愧为文学的经典之作，大学图书馆里借阅榜榜首。一份愧疚，一场救赎，一丝悲悯。书评 5 皮囊 7.8 这是一本凑出来的书，写家人可以打9分，写家乡让我想到草房子，写朋友就真的是过目就忘了。总的来说，及格以上，上乘不达，比刘同强。书评 6 富爸爸穷爸爸 8.2 提到的很多观念对于一个完全没有财商的小白具有颠覆性，不错的启蒙书。说从中学到具体的知识，还是没有的。书评 7 向前一步 8.1 虽然主要是讲女性职业发展和女权的，但还是从中学习到一些关于职业职场的有效方法。书评 8 恶意 8.4 天王套装第四本。开头和结尾精彩，手记体写法也很惊艳。过于注重推理和技巧使得真实感不强烈。关于主题所说的那种恨意体会不来。书评 9 计算机是怎样跑起来的 7.8 计算机科学入门读物。书评 10 撒哈拉的故事 9.3 把生活过成了诗，奇女子三毛何其幸运也。书评 11 北岛选编·给孩子的诗 8.1 看来我对诗没什么兴趣，只喜欢名句。书评 12 挪威的森林 8.4 以前电影看不懂，现在却能读懂了。值得不同阶段多读几次。书评 13 世界尽头与冷酷仙境 8.7 看不懂的文科脑洞文。 14 那些让你痛苦的，终有一天你会笑着说出来 7.8 作为一个20多岁的男性读者，我想说年轻真好。书评 15 爱的艺术 8.9 爱全在于自己是否有能力并愿意与对方共同成长成为一体。书评 16 暗时间 8.4 有种被标题骗了的感觉，关于数学与计算机科学那块，没有一定的基础也是看不懂的。书评 17 你的名字 8.2 还是电影更好书评 18 你的名字。AnotherSide:Earthbound 9.3 经过外传的补充，人物和情节更加完整了。书评 19 网络是怎样连接的 9.3 果然是介绍了网络的全貌，很容易看懂的书。笔记 20 红楼梦 9.5 伟大的悲剧，恨不能看完全。体会 21 算法图解 7.6 虽然是入门，但有点少而浅。笔记 22 两晋风云 9.0 豆瓣阅读上的，出了三部。笔记 23 小王子 9.0 忧郁的童话。 动画 序号 名称 状态 首播时间 豆瓣得分 评价 1 镇魂街 第一季 完结 2016 8.3 剧情、配乐上乘。评论 2 少年锦衣卫 完结 2017 8.6 国产武侠动画力作。评价 3 全职高手 连载 2017 8.4 画质太好了。评价 4 狐妖小红娘 连载 2015 8.7 大爱，不解释。评价 5 我们仍未知道那天所看见的花的名字 完结 2011 8.7 只有那首歌好听。还有就是第一次见识到了女装大佬。 6 幻境诺德琳 连载 2017 9.2 科幻类型 电视剧 序号 名称 首播时间 豆瓣得分 评价 1 人民的名义 2017 8.5 2.0倍速加不看的支线打7分。剧评 公开课 序号 名称 首播时间 豆瓣得分 备注 评价 1 汉代风云人物 2005 8.7 只看了易中天讲的部分 易中天处女秀。笔记 2 刘心武揭秘红楼梦 2005 7.9 落最后3集 虽说有些地方扯，但却正是这个带我走进红楼，觉得有趣才去读的书。笔记 3 中国古代历史与人物：秦始皇 b站投稿 笔记","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记1【完不成的目标】","date":"2017-02-26T09:53:05.000Z","path":"2017/02/26/周记1【完不成的目标】/","text":"日记太繁琐，周记则恰好。记录一周思考，这是第一篇，还是说一下（笑）。 制定计划开始只是有一个大目标，没做具体的细化。直到看到了一个极度自律的人写的一篇血泪日记，为了完成每日目标，半夜也要完成。就开始细化每日目标了。使用贴纸写下月度计划，每天晚上回来再日记本上写下日计划。算是开了头。 估算时间计划写得太满，导致完不成。因此，制定计划时，准确预估完成所需时间格外重要。 安排顺序有时候顺序不对，就完全打乱了一系列计划，制定计划和实施时需要随机调整，以免某个时间段无法完成特定任务而打乱一切。比如，跑步不能安排在吃饭后吧。 调整作息规律过去一周这个问题是最大的问题。现在已经昼夜颠倒了，怎样在指定的时间睡觉，已经成了困扰我的问题。希望下周能调整一些。 心事打断我想我错了。春节回家被家人灌输了一定要找对象的观念，导致我真的以为我需要找对象了。回来为此苦恼很久，怎么找对象困扰了我。后来我终于想起了之前看到的一些文字，在拥有爱的爱的能力之前，找什么对象。我想也是，当我拥有除了照顾好自己还能照顾另一个人的时候，我再考虑找对象的事吧。 迷茫了就去读书一切迷茫，不知所措，都是因为知道的太少而想的太多。多读书，广泛读书，总会找到适合你的那本，打动你，给你方向的书。","tags":[{"name":"周记","slug":"周记","permalink":"https://amasawaseiji.github.io/tags/周记/"}]},{"title":"少年锦衣卫","date":"2017-02-26T09:09:32.000Z","path":"2017/02/26/少年锦衣卫/","text":"三维动漫，比不良人还要用心啊，剧情目前看起来也挺好啊，没有不良人略显狗血的拖沓啊。已经超越不良人了，建模真是美哭，国漫新扛把子。 4.27日，看完第12集更新一下。 第12集最后，导演和制作组都亮相了。制作组辛苦了，500多个日夜。 动画质量没的说，全职高手逊色了呀。豆瓣分数一直稳定8.6分，全职高手却一点点下滑，都滑到8.3了。 就是量少，动画公司到底是什么样的，有点好奇。 5.14日，完结更新。 最后一集，展开了鬼街的场景，据说这个场景也是制作组花了很大力气的，就目前的效果看，应该说是震撼。最后一集给整季动画加分不少。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"皮囊","date":"2017-02-26T07:58:14.000Z","path":"2017/02/26/皮囊/","text":"每个读者只能读到已然存在于他内心的东西。书籍只不过是一种光学仪器，帮助读者发现自己的内心。 不可否认，这是今年读到的第一本触动我的书，或者说感受到的共鸣更多。这本书也有很大的毛病，后面的内容水平直线下降，甚至看到后面我联想到了刘同。刘同的书借用一个网友的评论就是“妈妈给的零花钱又被骗了”这种感觉。虽然有毛病，但是这本书还是值得看的，哪怕你只看一半也可以。 首先刺痛我的是，作者嘲讽那些在大城市打拼，跟老家的人产生了隔阂，已经回不去了的那些人。说他们是无家可回孤魂野鬼，庆幸自己还有家。然后作者着力想表达的是，我们这代人，从小镇到县城到地级市到大城市，慢慢的失去了家。呼吁我们小镇才是生我们养我们构成我们的家。作者最后说，我们都是既离开了家，又无法到达的人。我想，我们这代人是城市化进程的结果，城市化也是构成我们的一部分。我们想回到过去，谁不想呢，这也是无奈的事情。也许家里的事情于我们已变陌生，但我们终归还是拥有家人、亲戚，只要我们时常回去走走，即便是在陌生的城市，也不一定就是失去了家。 当作者写到闽南的乡土情怀时，我联想到了曹文轩的盐城农村，蒲松龄的山东，透过文字传达的家乡记忆，也足以令人动容。比如，作者说他们那拨人是晋朝时迁过去的，至今还保留着很多风俗，封建理想也根深蒂固。瞬间觉得自己这种明代山西迁往淮河流域的人，流传下来的文明简单的可怜。 作者由于家庭原因（父亲中风），早早担负起一家之主的责任，在大学时代就成熟老道地规划好了自己的人生。读到这里，令我汗颜，想到自己直到大学毕业依然迷茫不堪，没有任何规划。不得不感叹家庭对于塑造子女影响巨大。当然，健康家庭出身的孩子也相对来说更比较不会有心理创伤，谁又能说哪样的结果更好呢。 最令我感动还是作者描写的关于阿太，母亲，父亲，他的家人。这也是全书的精华，一个艰难家庭更容易催生出坚固的亲情，当然这也是人为努力的结果。毫无疑问，作者笔下的母亲是一位伟大的母亲。关于后半部分写到朋友、发小等，批评的人批评过了。我觉得这还是跟作者有关系，急于成名了，内容难免良莠不齐，或许这也跟作者心理创伤有关。现代大部分人都多少有心理问题。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"比利林恩的中场战事","date":"2017-02-24T15:11:16.000Z","path":"2017/02/24/比利林恩的中场战事/","text":"一部描述美国真正的参战士兵心境的电影。 在美国，有很多参战过的士兵，患有跟战争有关的心里疾病，称为战争后遗症，没参与过战争的人无法理解。 比利林恩数次落泪，因为他通过短暂的中场休息，看清了自己和这个国家的本质，看清了人们无法理解自己，看清了宿命。透过他的视角，是否能让人们能反思战争。 附上片尾音乐。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"追风筝的人","date":"2017-02-24T14:17:18.000Z","path":"2017/02/24/追风筝的人/","text":"经典无愧为经典。 早在我大学时代，这本书长期是学校图书馆里借阅榜第一。去年在朋友圈里看到一个朋友发的出自书中的一句话。 我看见镶木板的墙上挂着照片，照片中的人都将成为我的亲人。 配文：阿米尔到索拉雅家中提亲。那时我便将书购来，拖了很久，终于看完。 之所以没能一气呵成读完，我认为是这样的原因。前面部分描述的一直是安静祥和的小孩之间的真挚友谊，虽然处处预示着将会发生悲惨的事情，但着实是陌生的另一个国家的事情，难免让人感到晦涩、不理解。直到某次乘车途中，读到了发生的那件惨事，一发不可收拾读到大半。再后来，当我把此书列入计划中，方才读完剩下的部分。最后一部分，本来看得我觉得这书可能也就中上水平了，没有传说的那么神，但是后面纷至沓来的一波高潮，改变了我的看法，这本书是实至名归的上上之作。 我庆幸自己有足够的理解能力，能读到书中想表达的东西之一，人性。 没有良知、没有美德的人不会痛苦。 我想我们普通人都是有良知、崇尚美德的人。我们想努力弥补的都是我们愧疚的东西。诚然，有的人面对愧疚，选择逃避。但是，这种人内心深处是有创伤的，他/她们的灵魂是不完整的，当他/她们遭遇不幸，他/她们是容易怀疑人生的。敢于弥补愧疚的人都是勇敢的人，当他/她们完成赎罪，伤口会自愈、灵魂会完整，也便活出了人生的最高境界。 而是对生活曾有过的黑暗忍气吞声的照单全收。 哈桑、索拉博、无数承受战火的阿富汗人，作者还表达了悲悯。哈桑忍受着一切，哈桑依然是那个深爱着阿米尔的哈桑，就像他热爱生活一样。当你经历过地狱，并且从那里走出来，你将无所畏惧。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"阿甘正传","date":"2017-02-22T14:37:36.000Z","path":"2017/02/22/阿甘正传/","text":"印象中这是一部励志电影。 以我粗浅的阅历来看，美国的励志电影中的励志跟我们印象中的励志是不一样的。通常关于刻苦、努力啊基本不说，说的多的往往是运气或者天赋。这类电影通常更多的是探讨生命的意义，你要说它是励志电影真的是不走心。这是一部探讨残障人士的生命的意义的电影。 电影中有一段台词可以作为点睛之笔，摘录如下。 是否我们每个人 都有注定的命运 还是我们的生命中只有偶然 像在风中飘 但我想 也许两者都有吧 也许两者都同时发生着 我们每个人都有着好的或者不好的命运，但人生仅仅是这样吗？不是啊，还有偶然，就像那片随风漂浮的羽毛，时而扬起，时而下落，最终还会落地。我们能做的只是在风雨中承受着这一切，就像詹妮像鸟一样飘零、中尉在飓风中咆哮、羽毛飞舞…","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"国境以南太阳以西","date":"2017-02-20T14:26:18.000Z","path":"2017/02/20/国境以南太阳以西/","text":"文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。 借由其中一首歌在网易云音乐上的热评剧透作为读后记吧。 结尾泉的出现更让我觉得岛本或许真的就不存在。从国境以南来，到太阳以西去，可能岛本只是初一厢情愿的幻象吧。不得不说，初活出了大部分人的理想，有一个带你尽人事尝甘涩的初恋，有一个陪你立黄昏问你粥可温的爱人，有一次让你甘愿放弃一切的精神出轨，有一次回到现实却无奈下半身的肉体出轨。 附上书中反复提及的钢琴三重奏。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"半世伶俜空自许","date":"2017-02-19T13:15:39.000Z","path":"2017/02/19/半世伶俜空自许/","text":"读史使人明智，读诗使人灵秀，数学使人周密，科学使人深刻，伦理学使人庄重，逻辑修辞使人善辩，凡有所学，皆成性格。–培根 查阅寒伧（chen，同寒碜）时，相关词汇给到了伶俜（líng pīng），查伶俜看到了一首诗。 冰骨云绡雪数枝，清幽香冷与尘离。 深山有韵风摇影，古涧无人月弄姿。 半世伶俜空自许，一生风雨却谁知。 都言此萼非凡数，谁道花中最是痴。 这不是一首古诗，而是一位小才女写的诗。多好的诗啊。","tags":[{"name":"诗歌","slug":"诗歌","permalink":"https://amasawaseiji.github.io/tags/诗歌/"}]},{"title":"桃栗三年柿八年","date":"2017-02-19T06:43:14.000Z","path":"2017/02/19/桃栗三年柿八年/","text":"是枝裕和的风格就是讲述平凡的、淡淡的生活，讲述生活的本质。这个故事与电影海街日记一样充满温情。 小学生集体大出逃，7人和一只死了的狗，开始了一段冒险之旅，为了在新干线列车交错的地方许下愿望，让奇迹发生。 这是一个儿童题材的故事，火山灰、波斯菊、燃放的烟花、种子、生活中的一切事物，你喜欢也罢，不喜欢也罢，你通通要接受。生活也是一样，你也必须接受。 也许所谓的奇迹只是需要发泄而已。学会接受讨厌的事物，就是成长。 桃栗三年柿八年，达摩九年我一生。 书中出现的一句台词，原来是一句日本诗。人生需要时间的积累，才会开花结果。 小说是根据电影剧本写出来的，而电影是为了纪念九州新干线全线通车所拍的广告。你不得不佩服这位导演，一个广告电影，一个命题作文，选择了这样的题材，拍出了这样的作品，除了赞叹还能说什么呢。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"极简欧洲史","date":"2017-02-17T14:55:42.000Z","path":"2017/02/17/极简欧洲史/","text":"销量高不一定就好，充其量是对中学世界史的一点回顾。 副标题为为什么欧洲文明对现代文明影响这么深？我来回答一下这个问题。 因为欧洲工业革命，因为大航海，因为殖民。为什么欧洲能近代能够先崛起？因为科学的发展。为什么欧洲人能发明科学？因为欧洲古代有牛人，然后出现了文艺复兴。 这本书单只讨论了近代欧洲文明为什么能超越亚洲文明。给出的解释是：欧洲多国林立，强敌环饲，所以向海上扩张。王权为打压贵族，倚重商贾与科技。中欧一直小国并存，人才可以充分发挥才能，为文艺复兴打下基础。 从另外一角度讨论，中国历代关于科学的著述，偏向于经验总结。而欧洲则是科学方法论，欧洲有逻辑体系和实验方法2个方法论，这才是欧洲可以爆炸性增长的原因。 我们都知道古希腊罗马，罗马的灭亡是因为日耳曼蛮族入侵。蛮族在侵占的土地定居下来，罗马皇帝无地可辖所以才灭亡。所谓中世纪指西罗马帝国灭亡之后的一千年，日耳曼人建立国家，加入基督教，欧洲多国林立。 第二次入侵来自穆斯林，占领欧洲东部，跨越地中海控制到南欧的西班牙。所谓十字军东征即是征讨穆斯林，夺回圣地耶路撒冷。耶路撒冷是基督教发源的地方。 第三次入侵是来自北欧的维京人，维京人使用长船沿河掠夺，后来也定居下来。 英国原住民叫凯尔特人，日耳曼人、维京人入侵之后，才形成英语。 法国是由法兰克王国一分为三后才形成的。而另一支德国却很晚才统一。原因是教皇跟皇帝的争斗导致很分裂。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"马云山教练","date":"2017-02-17T14:36:54.000Z","path":"2017/02/17/马云山教练/","text":"又历时2天，终于可以写点了。这个主题不错吧！当然我没有功夫去学自己打造主题（摊手）。来不及了，车已经出发了。 马教练56岁，做教练20多年。很是健谈、做事麻利、头脑灵光、视野广阔、照顾后辈，当然这个年龄的人一般都会照顾后辈。 再谈公职人员态度。一个跟年期大妈一般态度恶劣，还是年轻好，对，年轻的好！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"影视书2016","date":"2016-12-31T13:09:20.000Z","path":"2016/12/31/影视书2016/","text":"总结这篇记录实写于2017年3月15日早上7点多。因为2016年写博客没能坚持住，后来荒废于玩游戏。2016只做了一个开头，却没有结尾，于我来说是糟糕的一年，但也不是没有收获。2016的历程，从我的一些点滴记录也可看得出来，开头很勤快，然后囿于观看以及记录一些不重要、不相干的东西，如纪律片、电视剧等，磨掉了很多意志。后来直接放弃了，所以说，做事千万要专一，不要拓展太多，事情一多，原来要做的事情都做不好了。总之，2016是挺惭愧的一年，最初怀着美好的理想，最后却是放弃了。所以2016看的电影、书籍参差不齐，也有一些是完全浪费时间的。我在2017年迁移博客时，还是费了很大劲才完成，虽然2016年没写什么东西，但是记录还是保存下来的好，因为2016确实是开始的时间。本来还想写一写2016年之前的一些记录，但是想想过去之事不可追，没必要记录那些记忆中的东西，因为记忆总不完整。所以最终放弃了。大体上，大学之前，没怎么看过电影、书籍。大学中囫囵吞枣地看了一些电影以及极少的书籍，终不能成记录罢了。 电影 序号 片名 上映时期 豆瓣分数 评分人数 影评 我的评分 1 她 2016 7.7 1.4万 女强者典范 ⭐️⭐️ 2 湄公河行动 2016 8.2 7.5万 主旋律，好莱坞水准 ⭐️⭐️⭐️ 3 海街日记 2015 8.5 8.0万 花开花落，人聚人离，海边继续漫步 ⭐️⭐️⭐️ 4 海蒂和爷爷 2015 8.9 1.2万 方寸之间，最为感动 ⭐️⭐️⭐️⭐️ 5 爆裂鼓手 2014 8.6 18.0万 虐你哦 ⭐️⭐️ 6 破风 2015 7.2 6.2万 7 风雨哈佛路 2003 8.2 6.7万 关键是智商吧 ⭐️⭐️ 8 垫底辣妹 2016 8.1 9.7万 与中国一样的高考 ⭐️⭐️⭐️⭐️ 9 你的名字 2016 9.1 2.5万 票房仅次于千与千寻的又一神作 ⭐️⭐️⭐️⭐️ 10 箭士柳白猿 2016 7.2 2.3万 纯粹的武术格斗 ⭐️ 11 Hello！树先生 2011 7.1 3.7万 反映社会 ⭐️⭐️ 12 不忠 2002 7.4 1.5万 13 闻香识女人 1992 8.9 27.2万 震撼心灵 ⭐️⭐️⭐️⭐️⭐️ 14 辩护人 2013 9.1 14.6万 燃 ⭐️⭐️⭐️⭐️ 15 指环王1：魔戒再现 2001 8.9 26.3万 光荣与勇气 ⭐️⭐️⭐️⭐️ 16 指环王2：双塔奇兵 2002 8.9 23.6万 ⭐️⭐️⭐️⭐️ 17 指环王3：王者无敌 2003 9.1 24.8万 ⭐️⭐️⭐️⭐️ 18 天国王朝 2005 8.2 3.8万 古战争片的强音 ⭐️⭐️⭐️ 19 赛德克·巴莱(上)：太阳旗 2011 8.8 4.7万 台湾土著抗战 ⭐️⭐️ 20 热血警探 2007 8.3 7.3万 21 无耻混蛋 2009 8.4 18.9万 复仇 ⭐️ 22 大话西游之月光宝盒 1995 8.9 33.0万 共鸣最多 ⭐️⭐️⭐️⭐️⭐️ 23 大话西游之大圣娶亲 1995 9.1 38.0万 ⭐️⭐️⭐️⭐️⭐️ 24 山河故人 2015 7.8 9.0万 时空荏苒 ⭐️ 25 一次别离 2011 8.7 10.9万 影射的太多了 ⭐️⭐️⭐️ 26 烈日灼心 2015 7.8 19.4万 邓超演技卓越 ⭐️⭐️ 27 师父 2015 8.1 11.6万 武术武人的诠释 ⭐️⭐️⭐️ 28 老炮儿 2015 8.1 33.3万 什么是男人 ⭐️ 29 如晴天，似雨天 2014 8.2 4.7万 情感治愈 ⭐️⭐️ 30 一天 2011 7.8 25.0万 虐个痛快 ⭐️ 31 他是龙 2015 7.4 6.8万 冲着画面美 ⭐️ 32 毕业生 1967 7.9 10.2万 歌曲太经典了 ⭐️⭐️⭐️ 33 春心荡漾 2005 7.3 0.6万 34 朗读者 2008 8.5 24.4万 羞耻感 ⭐️⭐️⭐️ 35 姐弟恋 2009 7.0 2.5万 36 邻家女优 2004 6.7 2.6万 37 西西里的美丽传说 2000 8.6 28.5万 美女很悲剧 ⭐️⭐️⭐️ 38 钢铁侠 2008 7.8 18.8万 39 钢铁侠2 2010 7.1 13.9万 40 致我们终将逝去的青春 2013 6.7 31.1万 有共鸣 ⭐️ 41 三少爷的剑 2016 4.9 3.8万 电视剧/动漫/纪录片 序号 剧名 首播时间 豆瓣分数 评分人数 短评 我的评分 1 大清盐商 2014 8.4 0.2万 到最后，每个人都成长了 ⭐️⭐️⭐️ 2 正阳门下 2013 8.1 0.2万 爷们儿 ⭐️⭐️ 3 画江湖之灵主 2015 7.9 0.2万 武侠动漫化，国漫的一个趋势 ⭐️ 4 余罪（第一季） 2016 8.2 5.3万 看演技 ⭐️ 5 余罪（第二季） 2016 7.0 3.3万 6 欢乐颂 2016 7.3 7.1万 真实 ⭐️⭐️ 7 温州一家人 2012 7.8 0.4万 改革开放大潮 ⭐️ 8 权力的游戏（第一季） 2011 9.3 14.3万 奇幻而逼真 ⭐️⭐️⭐️⭐️⭐️ 9 权力的游戏（第二季） 2012 9.4 9.7万 ⭐️⭐️⭐️⭐️⭐️ 10 权力的游戏（第三季） 2013 9.4 8.7万 ⭐️⭐️⭐️⭐️⭐️ 11 权力的游戏（第四季） 2014 9.5 7.4万 ⭐️⭐️⭐️⭐️⭐️ 12 权力的游戏（第五季） 2015 9.1 6.4万 ⭐️⭐️⭐️⭐️⭐️ 13 权力的游戏（第六季） 2016 9.4 6.0万 ⭐️⭐️⭐️⭐️⭐️ 14 舌尖上的中国（第一季） 2012 9.3 9.3万 地理美食志 ⭐️⭐️⭐️⭐️ 15 舌尖上的中国（第二季） 2014 8.3 2.9万 ⭐️⭐️⭐️⭐️ 书籍 序号 书名 豆瓣分数 书评 我的评分 1 草房子 9.1 净化心灵，使人安静。书评 ⭐️⭐️⭐️⭐️ 2 岛上书店 7.7 书评 3 嫌疑人x的献身 9.0 被石神的智商和巨大的牺牲折服。书评 ⭐️⭐️⭐️⭐️ 4 明朝那些事儿 9.2 一开始以为讲历史，结果啥都讲，波澜壮阔，引人入胜。1、洪武大帝2、万国来朝3、妖孽宫廷4、粉饰太平 ⭐️⭐️⭐️⭐️ 5 纵横十六国 7.3 讲述东晋-十六国的历史，文笔还可以 6 悠悠南北朝(上、下) 7.6 讲述南北朝的历史 7 一瓣河川 9.2 有韵味的中篇武侠 8 黑客与画家 8.8 创业书 9 白夜行 9.1 让人久久无法平复 ⭐️⭐️⭐️⭐️⭐️ 10 史蒂夫·乔布斯传 8.7 苹果的缔造者乔布斯一生的传奇。书评 ⭐️ 11 北京折叠 7.4 中篇科幻，阶级、现实 12 西游局中局（上卷、中卷） 8.3 权谋论，太上老君为boss 13 我们台湾这些年 8.0 原来在大陆从小到大经历的一切惊人的与台湾相似，不够了解，才会隔阂 ⭐️ 14 解忧杂货店 8.6 也许对人生路上的你有帮助 ⭐️⭐️⭐️","tags":[{"name":"电视剧","slug":"电视剧","permalink":"https://amasawaseiji.github.io/tags/电视剧/"},{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"},{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"},{"name":"纪录片","slug":"纪录片","permalink":"https://amasawaseiji.github.io/tags/纪录片/"}]},{"title":"日记06【国庆沉思】","date":"2016-10-07T14:16:54.000Z","path":"2016/10/07/日记06【国庆沉思】/","text":"尴尬的会议从9月的频繁放假说起，这导致我整一个月工作都不在状态，总是想着放假回家，心驰神往，工作就不用心了。9月30开总结会议，我的进度是最慢的，难辞其咎，领导虽然没说什么，但我已经感到了巨大的压迫力。并且也领悟了一些道理，就是领导之所以成为领导，总是有些能力的。 灾难的归途开会到6点多，我急着走，回来耽误了一会，到那边又在犹豫是坐公交还是滴滴。7点多才上了滴滴，路上巨堵，本来很快的路程，硬是没赶上火车，不过我也提早退了票。到了火车站，总不能回去吧，就看看能不能刷到票，直到10点多，仍然没买到，期间对12306的客户端崩溃也是无能为力，有摔手机的冲动。10点多，眼看没希望了，路边看到有汽车售票中心，就买了票220块。用小车拉到大车，夜里出了城。之后就是休息，到早上才又出发，路上巨堵，跟春运一样。好在我有电影看，看完电影，又有书看，路上倒不是很痛苦。一天一夜之后到了，结果停在了服务区，才知道被坑了。找不到车，给表哥打电话，叫来接我。一路上跟高中同学聊聊天也很是愉快，张将比我还晚到，悲催的孩子！ 同学的婚礼到家之后，把带的特产给大姑，又跟子龙聊聊天。2号参加高中同学陆超的婚礼，早上有人接，跟王茹南，张冲一起。没想到张冲也在，都结了婚生小孩了。到陆超那之后，婚礼正在进行，他们那边都好早。还有一个奇葩的习俗，不准盖楼，都是平房上接一间小屋，很奇特。拍了一些照片，后又跟王茹南聊天，聊的都是人生大事的问题。听她说她也没男朋友，说我，我就说不急，家里不催。吃完就走，一路上跟王茹南又聊了些工作之类的事情。感觉王茹南变了，不是高中时期那样女汉子了，成熟了吧，毕竟为人师表。 爸妈的催逼回家后，万万没想到，我以为他们不着急，结果变成了特别着急。邻居们都来问我有没有对象了，所以他们也很着急。 四人的聚会4号，我与小伙伴约定的日子，聚会了。我去的最晚，先是见面聊了一会，马乐，张将都有点胖了啊哈哈。之后去吃烤肉，喝啤酒，聊的很嗨，都是没心没肺的小伙伴。马乐中间还出去了一次，他妈给他买衣服。打车都是马乐，吃饭张将，我负责电影票。在华夏影城看了湄公河行动，大赞，他俩都说牛逼，我也就满意了。电影看完，崔涛来了，一起回梦蝶广场，跟崔涛聊天，又去逛了地下超市，然后，马乐张将都走了，我跟崔涛单独聊天。聊了很多，也很深，崔涛也是来家相亲的，他比较大，比我大2岁。晚上，崔涛跟我去吃饭，正好二姐也回来，我就叫了二姐跟我们一块吃。等了挺久二姐才来到，一起吃了饭。吃完，送走崔涛。我跟二姐一路去买我的衣服，买了一件衬衫，一条裤子。 寂寥的远行5号，就在大姑家，中午，二姐过来吃了饭。下午好黑，我才走。6号，去外婆家，给他们拿了挺多东西。老人最需要的不是物质，不是金钱，仅仅是去看望就可以让他们心满意足了。回家来去了三奶奶家，稍微坐了一会。晚上，上吐下泻，搞得我不得安生。7号，早起，爸把我送到双涧，才走。一路无座，艰苦。 积淀的沉思每次回家，对我刺激都挺大的，一般是让我燃起奋斗的欲望。这次当然也有，还有一些其他的。比如，同学结婚了，毕业才一年，家里买了房子，这是我望尘莫及的。而且他们结婚是初中同学，羡煞旁人。还有一个就是前途的问题，最近才意识到现在就是要抓紧时间搞钱，要奋斗，要搞钱。同时要学习，家里三爷爷、外公都说了，三爷说要坚持学习，搞好业务，外公说要处好人际关系，不能任性。","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"日记05【从中秋到国庆】","date":"2016-09-27T15:38:20.000Z","path":"2016/09/27/日记05【从中秋到国庆】/","text":"中秋的团圆西湖之行后，慢慢策划着中秋节，工作不在状态，只想快点放假。15日，起床起晚，没赶上高铁。又下雨，没打到车，总之做了一件傻逼的事。明白了一件事，高铁开车前半小时内不能改签，所以说我亏了一张票钱。中午到，吃大盘烤鱼，一家人都在，温馨。 中秋大雨，烦躁。索性刷电视剧，正阳门下，挺有意思的，中秋节期间看完。我陪着大姐跟沐汐宝宝去逛了趟超市。17日，二姐早上走了。也不下雨了，雨后的宁静与人去的散场气氛冲撞，令我怀念起儿时家乡的情景。莎莎的风，翠绿的竹，巨大的树冠，宽敞的地，疯跑的我们，时光一去不返。回来后第一周，比较空落，没心情好好工作，想很多事情。又刷了大清盐商，周末刷完。周日看了新海诚的新作，你的名字，挺不错，我还在QQ空间安利了一番。 琐事与志向工作忙碌，加班，与同事一起下班。压力太大，中午去5楼，我开辟的秘密场地，一个人待着，减压，放松，也去了楼下走走。最后是，垫底辣妹这部电影，看完之后，有一股汹涌的力量涌起。我想拥有更好的生活，为此我将奋斗在每个日日夜夜。十一国庆，同学结婚，回家，找同学玩。","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"日记04【家人】","date":"2016-09-10T13:09:40.000Z","path":"2016/09/10/日记04【家人】/","text":"一天8号白天我都沉浸在白夜行的回忆中，晚上写了篇日记。之后，二姐就微信跟我说，10号11都下雨，她9号就要来。我本来以为可以等2天我收拾一下，准备一下，她们来，我可以安排一下，而且8号没发工资，刚交房租，没钱。他/她们是指我爸、妈、二姐、大姐和她的孩子沐汐。于是我请了假。9号早上，起来开始收拾，主要是屋里太脏乱，需要打扫。上午她们告诉我说9点多出发的大巴，我想着11点多到，12点多到西湖呗。然后继续打扫，打扫完11点多了。她们也到了，我赶着去坐公交车。他们说打的，问我到什么地方，我看了下地图，有联想到前一天刚看过的一条旅游新闻，就说到吴山广场下。我本想着，她们沿着西湖，边走边逛，我从北边跟她们汇合。结果我漏算了，她们不知往哪走。我赶着去跟她们汇合，12点多汇合了，就近吃饭。吃完，我很快领他们去了西湖，不该从涌金门那里开始逛的，这要逛到雷峰塔，走断腿啊。我之前来过2次，一次逛到雷峰塔，那是大二的时候吧，一次就在湖边走一走，那是去年。完全忘记逛一圈是什么概念，我意识到这个问题已经太晚了。路上呢，走走停停，毕竟带着个孩子。下午5点左右逛完白堤，开始走苏堤，然后大伙半道不走了，全都歇着。歇了一会出来，找了个地方吃饭。吃完啦，去雷锋塔，不过不开放了，遗憾，只好打车回去。我没装打车软件，好在有第三方打车平台，用微博叫了个车，我本来以为最多坐4个人，晚上人家愿意带，49块打车费。后来给他们买了回去的高铁票，就带他们找了个旅馆住下了。 难免感伤为什么写这篇日记，绝不是因为带着家人逛了遍西湖，而是我要忏悔。我没把他们要来西湖玩的事放在心上，结果玩的吃的住的不如人意，还让她们带着遗憾走了。这件事，我有很大的责任。今天一天直到下午确定他们到家，我内心才算平复下来。聚散离合，难免感伤。今天早上，7：30我起来，洗漱，交代一下我爸，我走了。走在路上，恍如隔世。上午关心他们有没有吃早饭，去哪玩，要不要去看个电影。下午关心他们有没有出发，坐车，到家。我想到一个事，就像二姐说的，她不会待在大城市，而我目前只能待在大城市。晚上回来，看到妈妈给我收拾过的房间，我记录了下来，所有东西永久按照那样摆放，直到我从这里搬走。","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"日记03【G20】","date":"2016-09-08T12:29:14.000Z","path":"2016/09/08/日记03【G20】/","text":"放假前看专业书停下了，看了舌尖上的中国，看了当年明月的明朝那些事儿，看了权力的游戏1~6季，看了东晋到南北朝的历史，看了画江湖之灵主，看了秦时明月之君临天下，看了一堆电影，看了欢乐颂，看了一些杂七杂八的一些电视剧。 7月份开始，工作上忙了起来，加班做不完。除了工作，我连看书看电视的时间都没有了，日子过得人不人鬼不鬼。 假期日常G20杭州峰会，公司放假7天，我一刻不耽误地回了。不幸的是，9月2号，我去了医院，割了一刀，换了3次药，大约花费500元，治了一次病。悲催啊！还好我是喜欢看书的。前几天，把西游局中局的上卷、中卷看完了，共计24w字，下卷没出来。这本书是权谋论，以太上老君为幕后大boss为主要观点，解读了一些非常有趣的故事，让我有读一遍西游记原著的冲动。接着又读了北京折叠，作者刚获得雨果奖，看到了阶级的分层，现实的残酷，2w字，中篇科幻。一瓣河川，4w字，较有韵味的武侠中篇。你说的不朽，中国古代的群星闪耀时，3w字，品诗，品人，曹丕、萧绎、杨广、萧纲、赵佶、李煜、曹操、庾信、杜甫。又看了两章黑客与画家，实在没什么感兴趣的书了。翻到kindle，开始看之前用送购书券买的白夜行，这是我看的东野天王的第二本书，第一本是嫌疑人x。 冷的书看嫌疑人的时候，我早就看过电影了，了解的比较多，看到最后只能说是惋惜，遗憾，悲痛。然而这本书悬疑性太强了，一共13章，到第10章才开始解密，环环相扣，欲罢不能。虽然大概知道结局不好，但没想到是那样的结局，意犹未尽的感觉，好像作者解密没有解完。再回想一下，其实作者伏笔很多，猜也大概猜的出来，很多地方没有明说，都是借别人的心理猜想还原事实。看完结局，一个字，冷!太冷了！这就是社会！像前一部一样，男的牺牲，也堪称伟大。不是指犯罪，亮司无遗是个牛人，他其实也是个好人，估计园村友彦一辈子都会这样想。这个故事，我不忍去看电影版剧版，这样的故事，听说一遍就够了！ 杭州书是回来后的晚上，也就是9月7号的晚上读完的。到今天上班，依然无法释怀，老是想起这个故事，想起那个死法，不寒而栗。今天得知我的家人都要来杭州西湖游玩。我要准备一下，请个假。但愿尽快从这个故事里走出来，开启一波积极一点的生活。","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"舌尖上的中国【第一季、第二季】","date":"2016-08-27T07:46:13.000Z","path":"2016/08/27/舌尖上的中国【第一季、第二季】/","text":"当年火当年没看，后来不知为何就看了,看了之后发现这是一部乡土情结极重的纪录片。如果快过年了，你在回家前看到这个，怕是会潸然泪下。这部讲美食的纪录片，包含的信息量博大。 条目 地理位置 环境 菜品 烹饪 介绍 出自 松茸 云南 迪庆州 香格里拉县 吉迪村 原始森林 松树、栎书 松针下 碳烤松茸 酥油煎松茸 黑陶土锅 食用菌 野生菌贵族 菜品贵达1600元 香 80-&gt;卖700元(东京) 1.1自然的馈赠 冬笋 江浙一带 浙江 遂昌县 竹鞭 油焖冬笋 易吸收滋味 搭配肥肉 – 大头甜笋 广西 柳州市 夏天生 柳州酸笋 黄豆酸笋小黄鱼 螺蛳粉 鞭笋 辅料酸笋 – 春笋 腌笃鲜 江浙菜 笋加咸肉 – 盐井 云南 大理 云龙县 诺邓村 诺邓山区 诺邓火腿 莴笋炒火腿 血肠 卤水熬盐 – 莲藕 湖北 嘉鱼县 两湖平原(云梦泽) 珍湖 淡水湖泊 湖北产藕 遍布淡水湖的大省 藕夹 莲藕炖排骨 植物根茎 蔬菜 挖藕人老家安徽无为 – 胖头鱼 吉林 前郭尔罗斯大草原 查干湖 淡水湖 鱼头泡饼 垮炖杂鱼 鱼把头 郭尔罗斯蒙古族 猎杀不绝 – 高跷捕鱼 广西 京族三岛 万尾渔村 – 狼鱼、马鲛鱼、池子鱼、炮弹鱼 海南 三亚市 西沙群岛 妈祖庙 – 花馍 山西 襄汾县 丁村 多山少川 蔬菜品种少 石磨 1.2主食的故事 黄馍馍 陕西 绥德县 黄土高原 陕北丘陵沟壑地区 窑洞 糜(méi)子 石碾子 糜子=黍 耐旱 – 小麦 黑龙江 从河西走廊传入中原 原产于西亚 – 馕 新疆 库车县 维吾尔族 古尔邦节 出自古波斯语 – 馒头、炊饼、蒸饼 蒸汽烹饪 五谷 稻 黍 稷 麦 菽 今天 稻谷 小麦 玉米 – 米粉 贵州 黎平县 地扪村 清水江源头 禾仓，吊脚瓦木结构 地扪：侗语，泉水之源。65%食用稻谷 – 河粉 广州沙河 干炒牛河 沙河粉 – 肉夹馍 陕西西安 泡馍 白吉馍、腊汁肉 – 兰州牛肉面 甘肃兰州市 蓬灰水 回族人马保子 – 云吞捞面 广东 广州市 云吞皮、竹升面 毛竹压面团 – 长寿面 擀面杖 – 岐山臊子面 陕西 岐山县 臊子：肉丁炒制的配料 只吃面不喝汤 – 肉粽子 浙江 嘉兴市 太湖流域粮仓 – 年糕 浙江 宁波市 井头村 水墨年糕 脚板年糕 青色年糕 晚粳米 梭子蟹 艾草 – 焖面 – 饺子 – 豆腐球 云南 建水县、石屏县 红河地区的建水古城,古称临安 大板井 1.3转化的灵感 豆腐 安徽 寿县 安徽北部 石膏 淮南王刘安 – 奶豆腐 内蒙古 锡林郭勒盟 乌珠穆沁草原 奶茶 – 乳扇 云南大理 白族 – 烤羊背 – 毛豆腐 浙江 天台山，安徽 休宁县 酸水点卤 – 黄酒 浙江 绍兴市 稻米酿出 – 糯米酒 安徽 休宁 酒曲 – 酱油 绍兴 仁昌古镇 腊肠 – 酱、酸菜 乳酸的味道，草酸分解，蛋白质水解 – 泡菜 黑龙江 绥化市 呼兰河，发源于小兴安岭，注入松花江。松嫩平原 打糕 辣白菜 1.4时间的味道 腊味 香港 煲仔饭 南安腊鸭 荔芋腊鸭煲 腊肠 – 腌鱼 湖南 靖州县 湘西 腌桶 禾花鱼 杉木 山奎 木姜子 腊肉 – 臭鳜鱼 安徽 黟县 徽州 刀板香 腊八豆腐 臭豆腐 毛豆腐 鳜鱼 淡水鱼 – 金华火腿 浙江 金华市 蜜汁火方 – 酱鸭 杭州 – 腌笃鲜 上海 咸肉 – 黄鱼鲞(xǐang) 宁波 笋干 宁波菜 – 梅干菜烧肉 绍兴 绍兴梅干菜 绍兴菜 – 三阳南货店 上海 酱汁肉 红焖虾 煎鲳鱼 油焖春笋 面拖蟹 醉蟹 醉虾 糟味，黄酒酒糟 浓油赤酱的上海本帮菜 – 紫菜 福建 霞浦县 闽东 – 乌鱼子 台湾 云林县 台湾西南 – 虾膏、虾酱 香港 大澳 南海 观赏日落 – 琵琶肉 香格里拉 尼西黑陶 1.5厨房的秘密 汽锅鸡 云南 昆明 建水汽锅 – 粉葛蒸肉、均安蒸猪 广东 顺德 西江 – 淮扬菜 江苏 扬州市 扬州包子 大烫干丝 酒酿火方 紫炝虎尾 素汤 狮子头 雪花鲥鱼 仿豹胎 – 油炸臭豆腐 湖南 长沙市 – 西湖醋鱼 – 糖葱薄饼 广东汕头市 潮州 达濠古城苏州街 峡山 潮汕 红糖 甘蔗渣 鸭脯 熏 炭火 冬节 1.6五味的调和 锡帮菜 江苏无锡市 加蟹开口小笼包 手推馄饨 酱排骨 – 陈皮 广东江门市,澳门 路环 苦瓜 茶枝柑 绿茶 中药 – 盐焗鸡 广东 惠东县,广东龙门县 粤东 盐田 客家人 – 醋 蟹黄小龙包 镇江醋排 山西老陈醋 镇江醋 肴肉 糯米 酒曲 酒醅 – 辣椒 四川 乐山市 鱼香肉丝 麻婆豆腐 泡椒 辣椒酱 豆瓣 15世纪末 哥伦布 美洲到欧洲 100多年后到中国 南美辣椒 东南亚的姜 中国的花椒 – 麻辣火锅 重庆 干辣椒 – 紫菜 广东汕头市 达濠古城 东湖村 潮汕 鱼丸紫菜煲 1000多年 – 味精 酽茶 海带中提取谷氨酸结晶 – 白切鸡 广州 – 糯稻、籼稻 贵州 从江县 加榜梯田 酸汤鱼 炜酒 木姜子 山柰 1.7我们的田野 鲁菜 獐子岛 黄海北部 葱烧海参 海参 鲍鱼 海胆 – 蟹 湖州，上海 崇明岛 赛螃蟹 靖江蟹黄汤包 河蟹 中华绒螯蟹 九月母蟹最美 十月公蟹最肥 – 蟹黄汪豆腐 江苏 兴化市 垛田 芋头 戽水瓢 淮扬菜 – 青稞 西藏 白朗县 雅鲁藏布江 日喀则 糌粑 青稞粉 酥油茶 望果节 – 贴秋膘 北京 – 灵芝、天麻、蜂蜜 西藏林芝 波密 印度洋 酥油蜂蜜 蜂蜜鳗鱼 蜜制酒心冰淇淋 果糖葡萄糖 2.1脚步 路菜 秦岭，甘肃 山丹牧场 麻辣香肠 烟熏腊肉 四川泡菜 乐山嫩豆花 槐花蜜 豆花 – 麦客 陕西 蓝田县，宁夏固原 锅盔 羊肉泡 蓝天裤带面 风箱大柴 浇头 臊子 油泼辣子 – 东海 台州 三门湾 望潮菌菇煲 红烧望潮 清炖跳跳鱼 夫妻船 鲳鱼 望潮 章鱼 短蛸 自来芡 弹涂鱼(跳跳鱼) – 小花菇 湖北十堰 房县 鸟苷酸盐 香菇酿 – 山东 山东临沂，蒙阴 椿树沟 沂蒙山 红烧肉 炝炒野生木耳 蒙山羊肉汤 青椒韭菜花 煎饼卷大葱 山东煎饼 鏊子 东山到上海 鲍鱼 珠海到成都 石斑 昆明到新疆 菌类 – 煎饼引申 广东 潮州 春卷 贵阳 丝娃娃 烤鸭卷饼 食饼筒 福建 润饼 新加坡 薄饼 巴黎 牛冻春 – 贵州 贵州雷山 桥港 云贵高原 腌鱼 稻花鱼 糯米稻花鱼 爬岩鱼 雷山鱼酱 木姜子(山胡椒)西南地区特有 青椒鱼酱 – 泉州 大厦村 萝卜饭 沙土萝卜 海蛎 虾干 古早味 – 菜籽油 安徽黄山 歙县，南京，四川成都 徽州 牛肉锅贴 回锅肉 徽州臭豆腐 油炸锅巴 蒜泥白肉 凉拌猪耳 红油 煸炒 清明 油菜花开 5月油菜籽成熟 2.2心传 面 陕西吴堡 张家山 黄土高原 挂面 汉中面皮 宁夏手擀面 四川甜水面 山西饸饹 武汉热干面 重庆小面 苏州头汤面 – 糕点 糯米卷 苏式小方糕 枣泥拉糕 蕨根糍粑 三角团 蟹黄烧麦 元松 钳花小包 四喜蒸饺 金鱼酥 船点 白案 湖南宜章 莽山 瑶族 糍粑 – 蚝烙 广东汕头 澄海 汫洲 潮汕小吃 蚝(牡蛎) – 烫干丝、葵花大斩肉 扬州 – 刀功 上海 浦东，广东 三套鸭 扣三丝 油爆河虾 啫啫煲 黄鳝啫啫煲 本帮菜 蓑衣刀法 – 冬 黑龙江大海林 杨木沟 云杉 玉米饼 铁锅炖鱼贴饼子 冻豆腐 2.3时节 春 浙江临安 九狮村 天目山 雷笋炒鸡丝 油焖春笋 多味笋干 黄泥拱 雷笋 – 鄱阳湖 江西赣州 上堡乡 藜蒿炒腊肉 蒿粑 藠头 野芹菜 藜蒿 木兰芽 榆钱饭 – 香椿 北京 房山 上方山 燕山 香椿鱼儿 香椿摊鸡蛋 香椿拌豆腐 九层皮 – 螺蛳、青蛳 浙江淳安 千岛湖，衢州 开化 钱塘江源头 紫苏炒青蛳 紫苏 – 飞鱼 台湾台东 兰屿 清煮飞鱼干 拼板舟 达悟族 – 葡萄 吐鲁番 亚尔乡，新疆和田 砾石戈壁 天山 玛仁糖(切糕) 葡萄干 抓饭 – 小刀面 安徽 芜湖 陶辛镇 青弋江 虾籽小刀面 江城 – 时节 千岛湖，湖南衡阳 冠市镇 春 刀鱼 夏 笋干炖鱼 秋 鱼头 冬 火锅 – 桂花 苏州 七都镇 吴江 桂花酱 桂花 长枳 – 雁来蕈 江苏溧阳 平桥，黑龙江 五常 龙凤山镇 长荡湖 姜酱雁来蕈 桂花糯米藕 板栗烧鸡 老鸭雁来蕈 扎肝 贴秋膘 – 玉米 山西陵川 锡崖沟，山西霍州 贾村，湖北天门 饸饹 筱面凉皮 荞麦碗托 茴香烧饼 天门蒸菜 来自南美 中国400年 2.4家常 中秋节 上海 红烧肉 河南抻面 – 泡菜、芽菜、芥菜、燃面 四川甘孜 康定 眉山 乐山 宜宾 – 西瓜酱 山东菏泽 郓城 – 茭白 辽宁盘锦 大洼 辽东湾 虾子焖茭白 草芽 蒲笋(野茭白) 碱蓬草 蒲草 茭白 只有中国、越南培育 – 蒲菜 扬州,淮安,济南 蒲菜涨蛋 蒲菜水饺 奶汤蒲菜 – 珠海 广东 珠海 拱北口岸 回锅肉 黄糖糍粑 鱼香肉丝 冬瓜荷叶煲老鸭 霸王花煲猪腱 金银菜南北杏蜜枣炖白肺 鱼腥草炖鸡汤 猪脚姜 木瓜、鲫鱼 鲫鱼：利于乳汁分泌 – 澳门 陈皮红豆沙 红豆姜撞奶 莲子龟苓膏 黑芝麻糊 木瓜雪耳羹 葡韵 鹌鹑蛋白果糖水 – 口蘑、白蘑 内蒙古 锡林郭勒，张家口 长城 小鸡炖蘑菇 口蘑原汤 烩南北 烩南北：300年历史 2.5相逢 火锅 四川凉山州 金阳县，重庆 石柱县 黄喉 毛肚 花椒 西南标志 朝天椒 火锅底料 北京的涮肉火锅 北方游牧民族传入 云南的菌子火锅 潮汕的牛肉火锅 – 深圳 下沙村 鸡蛋仔 粉圆 烤香肠 烧肉 葡式焗扇贝 豆腐蒸桂花鱼 金汤水煮鳜鱼 水煮海鲜 花菇 云耳 鱿鱼 盆菜 – 杭州、开封 西湖醋鱼 鲤鱼焙面 开封灌汤包 杭州小笼包 片儿川 雪菜 – 上海 罗宋汤 炸猪排 辣酱油 – 广东 喼汁 春卷 牛肉球 酱油 – 新疆 新疆沙湾县 博尔通古，安集海,石河子 大盘鸡 纳仁 皮牙子(洋葱) 10万上海知青 – 眷村 台湾,四川自贡 红烧牛肉面 燊海井 井盐作坊 二两面 – 壳菜 宁波 象山县 石浦 渔山岛,台东 法式贻贝 金针花(忘忧草) 壳菜:学名贻贝,半个世纪的相聚 – 北京 山林丘壑 江河湖海 草原沙漠 土耳其大饼 西班牙海鲜饭 葡萄酒蒸海虹 2.6秘境 瓦氏雅罗鱼(华子鱼) 内蒙古 达里诺尔 碱水湖 清蒸华子鱼 酸辣华子鱼 油煎华子鱼 炖烧华子鱼 羊胡草 – 沙蟹 广西 北海 青山头村 粤菜白切鸡 沙蟹汁 豇豆 海上丝绸之路起点之一 – 野韭花 内蒙古 陈巴尔虎旗 莫尔格勒河 野韭花酱 手把羊肉 那达慕 – 羊肚包肉、红柳枝烤羊肉、馕 塔克拉玛干 新疆和田 亚曼拜克村 – 羊肉 宁夏吴忠 涝河桥 黄河 贺兰山 宁夏平原 手抓羊肉 洋芋擦擦 青贮饲料 – 石斑鱼 珠海，万山岛 清蒸石斑鱼 清蒸虾干 白蚁 – 鸡枞 云南临沧 沧源，建水 阿佤山 鸡枞油 蕨菜 水焯 煳辣 – 蕨菜 长白山 – 大排档 香港 深水埗 鲜虾云吞 竹昇面 – 酥油、糌粑 青海玉树 巴塘草原 2.7三餐 天津 馒头、锅巴菜 煎饼果子 馃箅儿 – 重庆 早餐小面 牛肉面 碱水面 – 苏州 细面 枫镇大肉面 – 武汉 面窝 三鲜豆皮 热干面 – 广州 濑粉 艇仔粥 肠粉 干蒸烧卖 榴莲酥 招牌虾饺 五味鸭 清蒸鲈鱼 西洋菜猪骨汤 – 深圳 蒸腊鱼 富士康 – 湖南湘乡 咸鸭蛋 – 四川凉山 布拖县 炸薯块 乌洋芋 炒洋芋 坨坨肉(猪肉) 彝族火把节 – 安徽六安 毛坦厂 大别山 剁椒蒸鱼头 蒿子粑粑 豆腐干子 干子烧肉 蒿子(粑蒿) 90个高考班 2w余人 1w多考生 – 上海 竹荪伞盖 上汤双色铁棍山药 时蔬彩虹蛋糕 秋葵炒竹笋 素食 – 香港 粉岭 冰皮月饼 – 四川古蔺 赤水河 生煎包 锅盔 米粑 豌杂面 麻辣鸡 黄腊丁(黄颡鱼) 盐酸菜煮黄腊丁 – 仓山泉水 大理 洱海门，苍山 洱海：第七大淡水湖 洱海鲫鱼 酸木瓜煮鱼 爆炒见手青 见手青(红网牛肝菌) 高温解毒 白木瓜(酸木瓜) 白族 – 广厦千间 夜眠仅需六尺 家财万贯 日食不过三餐","tags":[{"name":"纪录片","slug":"纪录片","permalink":"https://amasawaseiji.github.io/tags/纪录片/"}]},{"title":"乔布斯传","date":"2016-08-07T09:54:51.000Z","path":"2016/08/07/乔布斯传/","text":"0之所以买这本书，完全是因为买了kindle。虽然我买了就后悔了，因为手机有kindle软件，而且kindle的体验是那么不好，黑白，翻页就刷新好烦，十分后悔。但是kindle给了购书优惠券88，8月1号过期，所以我就在7.31随便买的，因为想看的技术书都没有电子版（好坑爹），只好买一些杂书诸如黑客与画家，写给大家看的设计书等，还有一些小说如东野圭吾的书。当然也买了这本乔布斯传。 之所以读这本书，是因为我在看技术书，想了解一下这些技术的历史。我是抱着虔诚的态度开始读这本书的，一开始每一章每一节我都要做笔记，看到后面发现乔布斯不会编程，我想还是放弃了做详细笔记的计划，太耗时，而且很多地方我并不关心。全书也是挑着读完的，不是每句都读。全书大约58w字。 1乔布斯生父名叫钱德勒，叙利亚人。生母乔安妮，德裔移民，在他们23岁意外怀孕。但因为宗教的问题不被家长允许，乔布斯生下来就被送人了。养父保罗，退役军人，是个机械师，养母克拉克，亚美尼亚移民，他们家住旧金山。 乔布斯有这样的身世，影响了他后来的性格。保罗脾气温和，乔布斯总喜欢跟保罗待在一起，保罗摆弄他的机械，但乔布斯并不喜欢机械，他喜欢的是电子。他们家住的地方，也就是后来的硅谷，有惠普，英特尔等大公司。硅谷的国王大道，每年吸引着全美1/3的风险投资。 乔布斯小时候，比较淘气，三年级之前一直恶作剧，因为他不喜欢那些无聊的课程。这一情况直到四年级遇到了一个耐心的老师才改变，测试显示乔布斯智力超群，可以连跳2级。受工程师文化的熏陶，高中时期制造了光感应设备，灯管表演等很酷的东西。 沃兹是乔布斯的同学，是个技术牛人，精通电子学。他们常合伙用造出的发明来恶作剧。沃兹比较诚实，没有心机。他们造出了蓝盒子，可以盗打付费电话。乔布斯展现了他的商业天赋，用这个来卖钱。 高中毕业时期，乔布斯认识了布伦南，他的第一任女朋友。乔布斯，沃兹，布伦南曾经是一块玩的小伙伴。乔布斯的本意是不想读大学，本来应该去伯克利、斯坦福等家门口的大学(他认为读这些学校的人都已经知道将来要做什么了，而他不知道)，但是乔布斯想去里德学院，那里学费昂贵，父母几乎负担不起，但是还是送他去了。乔布斯十分叛逆，对送他来的父母没有谢谢，也没说再见，他不想有背景。在里的学院，乔布斯认识了科特基，弗里德兰等人。受这些人的影响，乔布斯信奉佛教禅宗，服用迷幻剂，喜爱摇滚，冥想，崇尚素食。福里兰德也影响了乔布斯，从一个腼腆的少年，变成了可以说谎让别人信以为真的人。在里德没过多久，乔布斯厌烦那些课程，退学了。 他是一个怪人，总是光脚走路。从里德回来后，乔布斯进入一家游戏公司工作，但他与同事处不好关系，就被安排在夜间上班。没过多久，乔布斯说服老板给他付钱去印度朝圣。从欧洲出发，坐飞机到印度，在印度待了7个月，寻求觉悟，领会到，直觉的力量。回到家乡，与本地的禅宗人乙川弘文一起冥想。关于他为什么探求觉悟，大概是因为他对亲生父母一无所知(他知道自己是领养的)。这也使他变得自信起来。 2乔布斯的起点是沃兹帮他做的一款打砖块游戏，完工后，他把老板的奖金独吞了，没有分给沃兹。这一点，后来乔布斯否认，但事实确是如此。当时，反主流文化与技术的结合催生出个人计算机的概念。于是乔布斯与沃兹合伙办公司，生产个人计算机。命名为苹果是因为想不出更好的名字，而乔布斯是个素食主义者，只吃吃水果和蔬菜。第一笔订单25000美元，生产放在乔布斯的车库。之后他们生产了Apple 2，公司开始成了股份制公司，有了投资人，有了总裁。 布伦南与乔布斯的关系断断续续，也跟过别人，后来怀了乔布斯的孩子，但乔布斯却没处理好，不愿承认是他的孩子，后来做亲子鉴定证明是乔布斯的孩子。这件事也影响了乔布斯，开始变得成熟，不再不修边幅。 当时的计算机还没有GUI的概念，乔布斯一次在施乐那边看到了GUI，兴奋不已。1980年苹果上市了，乔布斯身价达到2亿多，不过乔布斯是个不会被钱左右的人，不太懂得施舍。乔布斯的易怒性格使他受到了打压，就来到了Mac团队，mac是一种红苹果的缩写。乔布斯拥有被称为现实扭曲力场的能力，就是可以调动别人的潜力，完成他们自认为完不成的工作，这是算是一种人格魅力吧。打造mac的过程十分艰辛，设计遵从极简风格，努力激励团队做出完美的产品。1984年mac发布，引起热烈反响，拥有着华丽的外观，简洁的设计，可以说是工艺品。盖茨是个会编程的技术人，编写excel、word软件。乔布斯找到盖茨编写mac版的办公软件。后来盖茨编写了windows操作系统，被指抄袭苹果，乔布斯指出盖茨没有品位。windows兼容其他硬件，而苹果的产品是软硬件结合，不会去兼容别的硬件。盖茨当然有市场，但是从抄袭这一点上，盖茨比不上乔布斯。 3mac是华丽的，但是缺点明显，运行缓慢，内存不足。销量下滑，董事会认为乔布斯不懂运营，因此把他排挤走了。走后的乔布斯创办了next公司，使用nextstep操作系统(NS前缀的来源)。同时乔布斯也因为之前投资了皮克斯公司，开始与皮克斯动画公司合作。 乔布斯的人生哲学是匮乏即是富足，自律产生喜悦。在布伦南之后，乔布斯陆续又有了几个女朋友，后来爱上了桑德斯，相处5年，但2个人太相似了，不能相互包容，桑德斯拒绝了乔布斯的求婚，相爱却没能相守。鲍威尔可是说是个心机婊啊，当时她是个学生，乔布斯去演讲，他坐在乔布斯旁边，乔布斯与他攀谈，她说我坐在这儿是因为中奖了，奖励是你会请我吃饭。于是乔布斯坠入爱河，1991年他们结婚。 乔布斯有钱后，雇佣了私家侦探探知了生母的情况，并相认了，乔布斯也没有怪她，她也在不断道歉。乔布斯还有一个亲生妹妹，叫莫娜，是个作家，她写了以乔布斯为蓝本的小说，乔布斯没有亲自看，认为25%符合。他们的生父，后来与生母离婚了，现在做餐饮店经历，甚至之前接待过乔布斯，但这个父亲不主动，他与乔布斯关系不好。乔布斯与布伦南的孩子名叫丽萨，当时已经读中学了，乔布斯把丽萨接来同住。后来，乔布斯陆续又有了一个儿子，2个女儿。皮克斯出品的动画电影玩具总动员大获成功，皮克斯迅速上市，乔布斯在这次上式中赚到的是苹果上市时的5倍。 4苹果在乔布斯走后，逐渐走下坡路，濒临破产，很多人希望乔布斯回去苹果，拯救苹果，于是乔布斯带着next的团队回到了苹果，重掌大权，并且与微软合作使用office，大幅裁员，实现了从亏损到盈利，真正拯救了苹果。艾夫的设计，引领了工程师，打破了以往工程师引领设计的方式。iMac发布了，又大获成功。同时又发布了Mac OS X操作系统，整合了Next的技术。零售店的实施，不光带来盈利，同时还有话题和议论，促进了苹果品牌知名度的提升。PC市场饱和了，乔布斯认为未来需要有数字中心的概念，电脑扮演数字中心的作用，需要各类设备端，比如音乐播放器，于是iTunes iPod诞生了，iTunes商店实现了音乐付费，打击盗版，这是爱音乐的人对音乐的一大贡献。同时iTunes兼容了Windows，到2011年，iTunes售出第100亿首歌，当年iPod的音乐产业给苹果带来了一半的收入。当时的潮流就是iPod里有什么歌。到了21世纪，苹果开始采用英特尔芯片。 52003年，乔布斯检测出肿瘤，乔布斯说可能与他回到苹果又保持皮克斯的工作那段时间的劳累导致，推测应为乔布斯不良的饮食习惯造成。本来可以治愈的，乔布斯不想开刀，耽误了治疗，后来扩散啦，又复发，最终导致他死亡。期间乔布斯又一次跟盖茨对话，盖茨评价乔布斯说，他愿意放弃一切拥有的东西换来乔布斯的品味。 当时的手机市场充斥着各类有键盘存在的手机，乔布斯认为那些都是愚蠢的产品，于是他们要做手机，才有了iPhone，采用金刚玻璃，简洁的设计和软键盘，多点触控。2007年1月发布，6月上市，价格500美元，到了2010年，手机已售出9000w部。2010年，iPad发布，表现强劲。2008年开放应用商店，开发者可以制造APP，同时还有iBook。这个时候，抄袭者又出现了，就是谷歌的安卓，这个操作系统不是封闭的，可以给制造硬件开放商使用。2011年，iPad2发布，iCloud发布。 在乔布斯最后的日子里，会见了总统，与家人一起去旅行，确定了继任者为库克。与2011年11月去世，而此时的苹果已经成为全球最有价值公司。 6乔布斯对于家居过于挑剔，所以他家没有什么家居。从印度回来，乔布斯说他看到了西方世界的疯狂，和理性思维的局限。他相信的是直觉，他的所有产品都是凭借直觉造出来的。好的艺术家抄创意，伟大的艺术家窃灵感。人们不知道他们想要什么，直到你把它摆在他们面前。乔布斯的伟大之处就在于这句话，可能天妒英才吧，去世的时候才56岁。他是一个走在科技与人文交叉口的人。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"燃到爆的电影","date":"2016-07-23T11:02:54.000Z","path":"2016/07/23/燃到爆的电影/","text":"最近在知乎看了一个关于电影的问题有什么值得一看的燃到爆的电影？的回答，于是就去看了其中列举的一些影片。我以我自己对这些电影的评分从低到高排列。 无耻混蛋 6分 这是一部二战题材的电影，讲述一个犹太女孩对纳粹的复仇，最燃的部分是最后在纳粹的电影里，女孩让自己的脸出现在大屏幕上宣告复仇，烧了整座电影院里的纳粹，虽然她也死了。抱歉，我没有燃起来，华丽有余，真实性不足，是个好故事，给6分。 热血警探6分 讲述伦敦一个高逮捕率警察被下派到一个最美小镇，美丽平和的表象下，实际上是一个集团用非正常手段获取的。只要有人做出对小镇不利的事情，他们会无视法律自己处理。警探知道真相后，以骑警的装束热血回归，以枪战揭开真相。同样，华丽有余，真实性不足，天马行空的想象，给6分。 赛德克巴莱 7分 讲述台湾土著抗日事迹。自1895年甲午战败，日本占据台湾，开发台湾，获取资源，到1930雾社事件，台湾土著始终被日本压迫着，就像种族划分一定没有好下场一样，土著也会反抗。在莫那鲁道的带领下，爆发了雾社事件，土著大肆杀戮日本人。我只看了上半部，下半部没找到好的资源，不过我不想看他们被镇压的结果了。华丽有余，又具有历史意义，给7分。 天国王朝8分 讲述12世纪十字军将领的私生子从铁匠到英雄的轨迹。耶路撒冷王是个麻风病患者，很有气魄。他死后，新国王好战，前去攻打伊斯兰大军，全军覆没。男主带领城民顽强抵抗伊斯兰大军，最终达成协议，基督徒得以获得生路。十分华丽，特技超强，有杜撰的成分，就像金庸杜撰了杨过杀死的蒙哥大汗一样，不过在恐怖主义泛滥的当时，这部片还是有一定社会意义，拉登的偶像就是片中的伊斯兰领袖萨拉丁，给8分。 指环王三部曲 9分 指环王是个什么故事呢，奇幻故事，书写于二战时期。由魔戒引发的正与邪的较量。本来魔君已经被打败，留下的魔戒却具有诱惑人心的力量，魔王想利用魔戒重新统治世界。魔戒流落到一个年轻的小矮人手上，从此小矮人开始了魔戒远征，把魔戒送到魔君的基地，投入一个熔岩河，销毁魔戒。可是魔戒就是魔戒，非常会蛊惑人心。如果把故事里的正与邪对应到二战的正与邪，可能你会体会到更多的影片想表达的意思。我最喜欢的是第一部，那个9人魔戒远征队将是我永远的记忆，里面唯一死的那位丞相之子的演员就是后来权力的游戏史塔克的父亲奈德。非常非常华丽，同时具有现实意义，绝对当得起燃这个字。一部关于责任，勇气，友谊，荣誉，荡气回肠的史诗，给9分。 辩护人 9分 韩国电影，讲述一个奋斗出来的只图钱的律师转型成为民权斗士的事迹，真实事件改编。国安，这个词听起来令人恐怖。一次读书会，被认定为赤色分子，拷打，让他们编故事，说谎话。统治者为了他们的目的可以随意制造社会舆论，随意牺牲任何人。民权何在？因为有民权斗士，政治才会进步。最后当男主被审判时，100多个律师中，90多个出庭为他辩护。这部片令人感动，动容，具有强大的社会意义。韩国片的长处就是反映社会，给9分。 闻香识女人 10分 这是一部关于，人生无可恋时，灵魂救赎的故事。一个退役将官，瞎了眼，眼怎么瞎的呢，做教官时喝酒引爆了手榴弹。烂人一个，没人认可他了，他什么都做不了，想自杀。一个穷人家出身的中学生，看到了几个有钱人对学校领导的恶作剧，领导要求他指出认那几个制作恶作剧的学生。说还是不说，说，做小人，不说，自己的前途毁了。这2个人碰到了一起，一起去了趟纽约，学生作为瞎子的助理。瞎子在自杀前要做一些事，做完了就自杀，学生得知后，阻止瞎子自杀，并且成功了，治愈了瞎子。正是杀了我，治愈我。返回后，瞎子帮助学生在最后的审判上说了一些话，此时的影片已经燃破了天际。2个人的故事，任一个单拎出来不足为奇，2个在一起令人感动的无以复加。人在绝望时，是需要一个人指出你还有什么优点的，更需要的是你站出来直面痛苦，做你该做的事，别人看在眼里，而心里为你鼓掌，这就是勇气。10分强片，尽在于此。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"日语50音","date":"2016-07-19T15:43:55.000Z","path":"2016/07/19/日语50音/","text":"a段 i段 u段 e段 o段 a行 a あ ア (阿) i い イ (伊) u う ウ (屋) e え エ (唉) o お オ (欧) ka行 ka か カ (卡) ki き キ (key) ku く ク (库) ke け ケ (开) ko こ コ (扣) sa行 sa さ サ (撒) shi し シ (西) su す ス (丝) se せ セ (赛) so そ ソ (搜) ta行 ta た タ (它) chi ち チ (七) tsu つ ツ (刺) te て テ (台) to と ト (头) na行 na な ナ (那) ni に ニ (你) nu ぬ ヌ (奴) ne ね ネ (乃) no の ノ (no) ha行 ha は ハ (哈,做助词读哇) hi ひ ヒ (黑) fu ふ フ (夫) he へ ヘ (海,做助词读唉) ho ほ ホ (后) ma行 ma ま マ (妈) mi み ミ (米) mu む ム (木) me め メ (麦) mo も モ (某) ya行 ya や ヤ (呀) i yu ゆ ユ (U) e yo よ ヨ (要) ra行 ra ら ラ (拉) ri り リ (利) ru る ル (鲁) re れ レ (来) ro ろ ロ (老) wa行 wa わ ワ (哇) i u e wo を ヲ (欧,只能做助词) ga行 ga が ガ (尬) gi ぎ ギ (给) gu ぐ グ (古) ge げ ゲ (改) go ご ゴ (高) ka行、浊音 za行 za ざ ザ (杂) ji じ ジ (鸡) zu ず ズ (孜) ze ぜ ゼ (在) zo ぞ ゾ (早) sa行 da行 da だ ダ (大) ji ぢ ヂ (鸡) zu づ ヅ (孜) de で デ (带) do ど ド (刀) ta行 ba行 ba ば バ (八) bi び ビ (比) bu ぶ ブ (不) be べ ベ (白) bo ぼ ボ (包) ha行 pa行 pa ぱ パ (趴) pi ぴ ピ (皮) pu ぷ プ (普) pe ぺ ペ (拍) po ぽ ポ (跑) ha行、半浊音","tags":[{"name":"日语","slug":"日语","permalink":"https://amasawaseiji.github.io/tags/日语/"}]},{"title":"明朝那些事儿4粉饰太平","date":"2016-06-25T12:21:29.000Z","path":"2016/06/25/明朝那些事儿4粉饰太平/","text":"年号表 年号 庙号 姓名 谥号 起止年 注 评价 嘉靖 世宗 朱厚熜 肃帝 1522-1566（45年） 谥号16字。正德帝朱厚照无子，由其堂弟朱厚熜继位。朱厚熜，朱见深之孙，朱佑樘之侄。朱厚熜父，朱佑杬，追封献帝，庙号睿宗。 始亡于嘉靖 嘉靖朱厚熜嘉靖帝朱厚熜是谁？我们都知道朱厚照无子，不光无子，连弟弟都没有。往上追溯，朱厚照老爹朱佑樘有弟弟吧，有。虽然万妃比较坏，朱佑樘侥幸活过来的，不过后来朱佑樘还是有很多弟弟的。有个弟弟叫朱佑杬，朱厚熜就是朱佑杬的儿子。正德16年4月，原住湖北安陆县的朱厚熜到达京城，此时的他只有15岁。刚到京城的朱厚熜就关于走哪条路到什么殿居住跟前来迎接大臣们产生了矛盾，大臣们要他走东安门到文华殿，此为皇太子所走路线，而朱厚熜要走大明门到奉天殿，此为皇帝所走路线。大臣们不让，朱厚熜表示如果不让，就打道回府，不干皇帝了，于是大臣们让步。从这一点就可以看出，朱厚熜绝非庸人。礼部尚书毛澄上书让皇帝尊孝宗皇帝为父，称其亲父亲母为皇叔考、皇叔母。于是朱厚熜找到杨廷和（时63岁）要给自己父母名分，杨廷和没有给他办。礼部小官张璁在翻阅毛澄奏疏时，发现了那篇给皇帝的奏疏，写就一篇文章支持皇帝给父母名分。大议礼开始，同时，朱厚熜亲妈也来了京城。杨廷和让步，给皇帝父母兴献帝、兴献后的称号，同时把张璁调到南京。还有一叫桂萼的也是张璁的拥护者，其背后有杨一清的支持。嘉靖2年，张璁攻击杨廷和，杨廷和主动退休。原因是真累了，要抽身。 杨慎杨慎，杨廷和儿子，正德6年状元。杨廷和走了，杨慎成了杨廷和那帮人的领袖，嘉靖3年，礼部尚书汪俊联合众文官上书反击。朱厚熜急忙召张璁、桂萼进京，汪俊见风使舵，愿意给加个皇字,变为兴献皇帝、兴献皇后。张璁进京，杨慎找人要在左顺门打死张璁、桂萼，但他们都逃了。郭勋，朱元璋时期郭英后代，郭英还有的优秀后代如土木堡时期的郭登。郭勋投机，成为张璁死党。众文官哭跪示威，要求诛杀张璁，重文官全部被抓，集体打屁股，死亡率达到12%，杨慎被流放云南，在那里，杨慎专心搞文学。嘉靖8年，杨廷和去世，年71。明代三大才子，解缙，杨慎，徐渭。杨慎排第一，比如三国演义开篇的滚滚长江东逝水那首词就是杨慎写的。嘉靖38年，杨慎去世，年72. 张璁张璁想要入阁，但是他确实没资格，想入阁，必须是庶吉士，翰林院待过的，张璁太菜，考进士都考了7、8回才考上。背后的杨一清出关，张璁才入阁。张璁比较缺德，嘉靖8年，得意忘形之后竟然攻击杨一清，说杨一清给张永写墓志铭，收贿赂200两，杨一清被免职。 夏言嘉靖9年，夏言也因为礼仪崭露头角。张璁感到被抢了生意，攻击夏言。夏言的武器是口才和笔法，确实是有才的人。张璁结党，甚至骂孔子，徐阶登场，反对张璁，徐阶被贬福建，皇帝对张璁的态度渐渐转变。张璁找了个夏言的人，让其上书说皇帝生不出儿子，陷害夏言，此人被审，结果闹大了，张璁败露，嘉靖10年，张璁被免职，夏言升礼部尚书。嘉靖15年，夏言成为首辅。嘉靖20年，郭勋攻击夏言，很快郭勋犯了事，死于狱中。再来说说朱厚熜，朱厚熜一上台，比较厌恶太监，斩了江彬、钱宁,甚至要斩张永，多亏了杨一清，张永才没事。朱厚熜迷信于修道，嘉靖21年，发生宫变，有个宫女趁嘉靖睡觉，拿绳子差点勒死嘉靖，嘉靖从此移居西苑。 严嵩严嵩，江西袁州府分宜人，成化16年生。正德元年庶吉士，之后母亲去世，回家归隐。正德16年进京，嘉靖17年任礼部尚书，工作勤奋，严嵩巴结夏言，夏言不搭理严嵩。嘉靖21年，严嵩弹劾夏言藐视皇帝，夏言离职，严嵩入阁。嘉靖24年，夏言又回来了，夏言为人比较孤傲，不结党，但也提拔了徐阶。 徐阶徐阶，弘治16年生，松江华亭人（今上海）。正德15年，聂豹为华亭知县，徐阶拜其为师，是为王学江右学派门人。嘉靖2年中探花，嘉靖3年，父亲去世回家守孝，嘉靖6年回来，因为反对张璁，被贬福建，政绩突出，嘉靖13年，提为湖广黄州同知，嘉靖18年进京。 严世蕃徐阶跟夏言是同一类人，比较坚持原则。嘉靖22年，徐阶任国子监校长。严世蕃，严嵩儿子，独眼。严世蕃对严嵩说夏言不足为虑，当今天下只有3个奇才，1是杨博，机智，军事重臣，2是陆炳，锦衣卫，嘉靖发小，救过嘉靖的命，3是自己，确实，严世蕃绝顶聪明，甚至比另外2个都要厉害。3人得2就能扳倒夏言。 夏言2夏言抓住了严世蕃贪污的罪证，严嵩得知，严世蕃说唯一的出路就是求情，严嵩跪地求饶，被夏言原谅。陆炳也犯了事，也去找夏言跪地求饶，也被原谅，但陆炳从此恨上了夏言。将领曾铣上书请求收复河套，夏言支持，嘉靖反对。严世蕃找到陆炳合谋，利用跟曾铣有仇的仇鸾攻击。严嵩上书支持嘉靖，反对夏言，夏言坚持，于是被免职。仇鸾上书弹劾曾铣，说曾铣结交近侍（夏言），嘉靖27年，曾铣被斩，夏言也死。 徐阶2其实，除了严世蕃说的3个奇才，还有另外的3个奇才，4是徐阶，5是高拱,高拱，正德7年生，河南新郑人。6是张居正,嘉靖26年，徐阶任翰林院院长，发现了张居正是个人才。嘉靖29年，鞑靼俺答进攻大同，仇鸾给钱送走俺答，于是俺答转而进攻北京，嘉靖召集众人商议对策，严嵩胆小不说话了，徐阶说出拖延待援的对策。援军来了，俺答撤退，嘉靖要丁汝夔反击，丁汝夔找到严嵩，严嵩告诉他不要追击，因为追击如果失败就要担责任，并且会保他无事。嘉靖追究丁汝夔责任，严嵩却把他卖了，丁汝夔被斩首。史称庚戌之变。徐阶因为这件事开始成为红人，严嵩告了徐阶一状，说徐阶有二心，原因是嘉靖30年，徐阶上书请求早立太子，嘉靖又开始冷落徐阶，但是徐阶跟夏言不同的是徐阶会巴结逢迎严嵩，当然徐阶的巴结逢迎不是为了升官发财，而是为了麻痹严嵩，除掉严嵩。虽然祖上仇钺是平定安化王叛乱的功臣，但仇鸾是个无能的人,开马市被俺答偷去很多财物，徐阶上书告了仇鸾的状，不久仇鸾病死。严嵩也找到陆炳告仇鸾的状，还说仇鸾跟徐阶关系密切，嘉靖把徐阶的奏疏拿给严嵩看，严嵩尴尬了。严世藩说此时的徐阶已成气候，动不得了，只能压制。 杨继盛虽然大家都知道严嵩是奸臣，但是没人敢攻击严嵩，除非不怕死的。杨博，虽然讨厌严嵩，但是在外面搞军事。张居正希望老师徐阶能挺身而出打击严嵩，当然徐阶不会那样蠢。高拱投靠裕王，严嵩跟他关系不大。陆炳虽然算是个好人，但毕竟还是严嵩的同盟。沈鍊是陆炳的下属，告了严嵩，被严世蕃害死，陆炳心中的天平开始往严嵩相反的方向倾斜了。杨继盛，正德5年生，嘉靖26年进士，同年的还有赵贞吉，后七子之一，据说是金瓶梅的作者。杨继盛是大公无私的人，死劾严嵩。奏疏送上去后，严世蕃看到原文后发现了破绽，因为文中引出了裕王、景王。高拱也意识到这可能会给他带来灭顶之灾，于是他找到徐阶，徐阶找到陆炳，希望陆炳能说句话，不要牵扯到裕王，保全杨继盛。严世蕃也找到陆炳，要整死杨继盛，牵扯到裕王身上。之后陆炳谁也不帮，保持了中立。之后杨继盛被打100军棍，腿断了，在狱中，肉腐烂，于是杨继盛拿碗片割去腐肉，不愧为硬汉。3年后，嘉靖34年英勇就义，赋诗曰浩气还太虚，丹心照千古。生平未报恩，留作忠魂补。 胡宗宪嘉靖32年，张经任浙江总督，指导抗倭。嘉靖33年，赵文华来到浙江，赵文华是严嵩干儿子，张经得罪了赵文华，于是赵文华整张经。张经在等待广西的狼土兵到来，一直没出兵。嘉靖34年，王泾在嘉兴打败倭寇，同时赵文华上书弹劾张经，说他拥兵自重，坐观倭乱。胡宗宪，徽州人，嘉靖17年进士。开始在西北任职，知兵事，嘉靖33年也来到浙江，投靠赵文华，张经走了，胡宗宪任浙江巡抚。任职后，很快就打了败仗，倭寇都是日本浪人，就是失去土地的武士，个人技能很高。俞大猷（yóu),福建晋江人，弘治17年生，是位武林高手，胡宗宪用其为总兵官。徐渭，明代三大才子最后一个，正德16年生，一直考不中进士，胡宗宪用其为幕僚，郑板桥见到徐渭的画，说愿为青藤门下走狗,而徐渭自己却说吾书第一，诗次之，文次之，画又次之，可见其才高八斗。汪直、徐海都是徽州人。汪直，是个跨境走私犯，走私军火，做日本人的生意，拥有私人武装，在日本九州岛还建有根据地，日本人给他打工，所以汪直算不上汉奸。而徐海是汉奸，专门干海盗。徐渭给出的策略是招抚，因为打打不过。胡宗宪派出使者前去跟汪直谈判，毛海峰,汪直养子，跟随使者去见胡宗宪，胡宗宪对其相当好。对于徐海，胡宗宪派出的是间谍，徐海还有两个合伙人陈东、麻叶，很快胡宗宪找到了徐海的破绽，徐海的老婆王翠翘,于是胡宗宪打算通过王翠翘劝降徐海。嘉靖35年，徐海进犯，胡宗宪拿出汪直的书信给徐海看，徐海以为汪直也投降了，于是退兵。胡宗宪让徐海攻击倭寇作为投诚的条件，徐海去了，打完了却被俞大猷打，胡宗宪命令俞大猷退兵。此时徐海已失去谈判的资本，胡宗宪又命令徐海去打陈东、麻叶，陈东、麻叶也被抓。嘉靖35年，徐海投降，胡宗宪却命令陈东攻击徐海，徐海自杀，之后陈东、麻叶也被杀。王翠翘的故事被写成小说金云翅传，在越南，此书相当于中国的红楼梦。嘉靖36年，汪直登岸，与胡宗宪谈判，胡宗宪请他去杭州转转，结果到了杭州，却被一个叫做王本固的官给抓起来了，并上书请求处斩汪直，胡宗宪上书说不能杀汪直，杀了必定会造成倭乱。最后汪直还是被杀了，胡宗宪招抚不成，只有一战。 戚继光嘉靖37年正式开战，俞大猷进攻毛海峰的舟山,打不下来，戚继光出场，1个月后，打下来了。戚继光，祖上是朱元璋时期的戚祥，世袭登州卫指挥佥事，嘉靖7年生，对倭寇战损率30:1，将是倭寇的噩梦，少年时作诗曰封侯非我意，但愿海波平。。嘉靖29年庚戌之变作的备俺答册在军中流传。后守卫蓟门自学孙子兵法，作一年三百六十日，多是横戈马上行诗句。嘉靖34年调任浙江，胡宗宪任其为宁绍台参将，慈溪龙山之战发现兵太熊，请求练兵，称为戚家军。嘉靖37年，舟山之战，发现兵还是不够好，于是练了义务兵,义乌兵善战无畏。赵文华，得罪了嘉靖，被削职为民，路上暴毙，胡宗宪没了靠山，于是给嘉靖送白鹿，意为祥瑞。嘉靖40年，台州大战爆发，戚家军用鸳鸯阵,每队11人，用5种兵器，标枪、盾牌、狼筅、长矛、短刀,宁海，新河，台州三战皆胜，歼敌5500，伤亡仅20，史称台州大捷。戚继光当然也有靠山，即是后来的张居正。福建倭乱，戚继光又去福建抗倭，嘉靖41年，横屿之战，士兵铺稻草前进，戚继光亲自擂鼓，大胜。嘉靖41年，胡宗宪被捕，原因是投靠奸党，自杀于狱中，赋诗曰宝剑埋冤狱，忠魂绕白云，年54。从嘉靖33年开始，历时12年，到隆庆元年，倭寇基本肃清。俞大猷，万历8年去世，年77。此后戚继光去了蓟门。徐渭被关监狱7年，出狱后经戚继光推荐，去到辽东给李成梁的儿子李如松、李如柏当老师，万历21年去世，年73。 徐阶3王世贞的老爹被严嵩整，王世贞跪地求饶，严嵩还是害死了王世贞的爹。徐阶依然努力巴结着严嵩，邹应龙讽刺徐阶是严嵩的小妾。嘉靖37年，徐阶派出3人弹劾严嵩，试探，3人被充军。嘉靖39年陆炳去世。嘉靖40年，皇宫失火，严嵩请嘉靖移居南宫，嘉靖怒了，而徐阶说3个月就能修好。同年，严嵩老婆死了，严嵩意识到徐阶已经占到了上风，带着家小跪地请求徐阶放过，当然徐阶不是夏言。王学门人何心隐,指出扳倒严嵩的关键在于皇帝，于是找到同为王学门人的蓝道行,在嘉靖与神仙对话的符文上做手脚。嘉靖41年，邹应龙弹劾严世蕃贪污，嘉靖怒，逮捕严世蕃，严嵩被辞退。 结语纵观嘉靖这40年，正是权谋争斗的高峰，原因无外乎嘉靖本人就十分聪明，所以在这个时代能活的久的一定是绝顶聪明之辈。前期的杨慎、张璁、甚至夏言都是配角，直到严嵩、严世蕃父子的强力组合出现，把持朝政近20年，无人能将其拉下马，足以证明他们父子的厉害。当然，他们的对手还是有的，比如徐阶与严世蕃的斗智，简直可以达到人类的智力极限，不过这在下部可以淋漓尽致的体现。我想起权谋电视剧琅琊榜，权谋的高峰，里面就有很多明代的影子，什么誉王、靖王，这里有裕王、景王，什么朝堂辩礼，这里有大议礼。所谓权谋，决定他们命运的是皇帝，皇帝偏向谁，谁就可以犯了罪也不死，要是被皇帝讨厌了，必死无疑。封建时代，可以定的罪名太多了，也极少有人身居高位，屁股是干净的。所以基本就是争宠。再来聊一聊东南战事，胡宗宪也好、戚继光也好，他们的初衷是为国效力。但是也不得不保住自己的位子，上面没人，底下就没权。不管他们做什么也好，目的是为国办事，而有些人如严嵩，目的是大私无公，不是为国尽力，却把持朝政，实在可恶。索性，嘉靖时期这样的人不多，仁人志士还是此起彼伏，因此嘉靖时期也相对稳定。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿3妖孽宫廷","date":"2016-05-30T15:12:21.000Z","path":"2016/05/30/明朝那些事儿3妖孽宫廷/","text":"年号表 年号 庙号 姓名 谥号 起止年 注 评价 洪武 太祖 朱元璋 高帝 1368-1398（31年） 谥号20字 洪武之治 建文 惠宗 朱允炆 让帝 1399-1402（4年） 朱棣篡位后废除，沿用洪武年号，称1402年为洪武35年，次年改元永乐。明神宗时期恢复建文年号。庙号谥号皆为南明时期所上。谥号16字 比较悲情，被朱棣抹除 永乐 成祖 朱棣(ti) 文帝 1403-1424（22年） 谥号16字，初庙号太宗，嘉靖年间改为成祖 永乐盛世 洪熙 仁宗 朱高炽 昭帝 1425（1年） 谥号16字 仁宣之治 宣德 宣宗 朱瞻基 章帝 1426-1435（10年） 谥号16字 仁宣之治 正统 英宗 朱祁镇 睿帝 1436-1449（14年） 谥号16字 景泰 代宗 朱祁钰 景帝 1450-1457（8年） 景泰实际年号只有7年，因为1457当年即被改元天顺（一般新皇帝继位次年改元）。英宗复辟后，谥曰戾。成化年间恢复帝号，谥号仅5字，无庙号。南明期间追认庙号代宗，谥号加长到16字。 第二悲情，被朱祁镇抹黑 天顺 英宗 朱祁镇 睿帝 1457-1464（8年） 英宗复辟，1457年称天顺元年，而不再称景泰8年 成化 宪宗 朱见深 纯帝 1465-1487（23年） 谥号16字 弘治 孝宗 朱佑樘 敬帝 1488-1505（18年） 谥号16字 弘治中兴 正德 武宗 朱厚照 毅帝 1506-1521（16年） 谥号16字 天顺徐有贞&amp;朱祁镇 VS 于谦朱祁镇复辟了，对于夺门有功的还乡团也毫不吝啬的封赏。徐有贞入阁，石亨、张軏(yuè)封爵，曹吉祥领司礼监。徐有贞掌权了，于是跟徐有贞有仇的于谦被捕入狱。内阁也大换血，换上了徐有贞的亲信，但是同时入阁的还有李贤，徐有贞把李贤当亲信。站稳脚跟之后，徐有贞捏造说于谦要迎立藩王，此时朱祁镇还是挺厚道的，他说于谦确实是有功的人，不愿意杀。徐有贞又想了个朱祁镇无法反驳的理由，说，不杀于谦，夺门无名啊。于是于谦被斩首，罪名是意欲迎立藩王，跟岳飞的莫须有异曲同工啊。于谦被斩首，天下冤之。后来朱祁镇也后悔了，到了他儿子朱见深的时代才为于谦平反，明武宗时期谥曰武肃，彻底肯定了于谦的功绩。评价：于谦一生干干净净，坦坦荡荡，伟大，可与日月同辉，民族英雄，作者评其为明代第二强人。还有个小插曲，朱祁镇复位后，没有处理还在病着的朱祁钰，也没废除朱祁钰的皇帝身份，直到一个月后朱祁钰去世。同年，朱祁镇改年号为天顺，也是目前为止为数不多的一年存在两个年号的年份，一般新皇继位次年改年号。 曹吉祥&amp;石亨 VS 徐有贞徐有贞也是个想做事的人，但是他发现同伙石亨、曹吉祥都是贪污腐败、素质不高的人。徐有贞想把他们赶走，就告了一状他们贪污。当然曹吉祥等人也不是那么好打发的，毕竟是皇帝身边的，就把徐有贞与朱祁镇两个人在一起说的话全都泄漏出来，让朱祁镇认为徐有贞嘴把不住风。当他们狗咬狗的时候，背后有个人一直注视着一切，就是李贤。表面上看李贤是徐有贞的人，但他与石亨也交情匪浅。其实李贤谁的人也不是，他是要为于谦讨公道的人。又一次，徐有贞叫他党羽攻击石亨贪污，石亨急忙找到曹吉祥，先一步去告了徐有贞的状，徐有贞入狱。作为徐有贞的表面同党，李贤也一同入狱，不过李贤有同伙搭救。风光了4个月的徐有贞得到了他应有的结局，后被发配充军，天顺4年被放回家，又10余年死去。纵观其一生，不过是个小丑，当个小丑也就罢了，却直接导致了于谦的死，所以作者对此人的评价只有4个字：无话可说。 李贤&amp;吴谨 VS 石亨&amp;曹吉祥徐有贞倒台了，石亨变成最红的人了。于是本性暴露无遗，贪污腐败，甚至藐视皇帝。命其侄子石彪守大同，认为皇帝也不敢拿他怎么样。当年的迎立外藩的当事人朱祁镇的叔叔也过来解释当年根本没有那回事。又一次，皇帝与大臣都在凤翔楼看到城中一处最豪华的房子，就问是谁家，吴谨站出来说是石亨家，于是朱祁镇对石亨态度大转变。天顺3年石彪入狱，但朱祁镇仍然念旧，不忍杀石亨。李贤跟朱祁镇解释了当年夺门并不是有功，朱祁钰死了，朱见深当皇帝也就是朱祁镇当皇帝(朱见深当年才10岁，朱见深是朱祁镇儿子)，相反，夺门是铤而走险，万一失败了，后果不堪设想。朱祁镇放下最后一点障碍，天顺4年，石亨入狱惨死。石亨死了，曹吉祥也心慌了。与养子曹钦一起造反了，密谋泄漏。吴谨、孙镗平叛，吴谨战死，孙镗打了一天，曹钦失败投井，曹吉祥被处斩。李贤，入阁后，致力于为于谦讨公道，正直之臣。成化2年病逝。他有个女婿名叫程敏正，程敏正对唐伯虎的一生影响深远。 总结天顺年间，于谦被害死了。徐有贞，一个小丑，害死于谦的罪人，石亨，前期有战功，后期跋扈，自取灭亡。曹吉祥不自量力，咎由自取。李贤，正直之臣。朱祁镇，是个好人，不是好皇帝。 成化天顺8年，朱祁镇病逝，年38，继位者朱见深。朱见深，正统12年出生。正统14年，土木堡之变，英宗被俘，代宗继位，朱见深被立为太子，孙太后以此作为代宗继位的交换条件（太子是侄子），同时，一个姓万的宫女被派到朱见深身边。景泰3年被废，朱见济被立为太子。天顺8年继位，年18，万宫女35。至此，2人以多年感情发展为姐弟恋，万宫女被封为贵妃。吴皇后怒打万贵妃，吴皇后被废。成化2年，万妃生子，不久夭折，此后再无生育能力。成化元年，广西一民女纪姑娘作为俘虏入宫当宫女，当值内库仓管员。成化5年，纪姑娘被宠幸，6年，生子朱佑樘。万妃，自己生不了孩子，也不允许别人有孩子，心狠手辣，但凡别的妃子怀孕，就会被万妃害死。因此从成化6年至成化11年，一直隐瞒着朱佑樘的存在，有赖于太监张敏的保护，吴废后的养育。成化11年，皇帝感叹自己没有儿子的时候，张敏告知皇帝已经有了儿子，纪姑娘封纪妃。同年纪妃去世，死因不详。几年后，张敏自尽。纪妃去世，孩子交由周太后保护，不久，朱见深4子出生，前2个都夭折了。 成化年间，朝廷一锅粥，各路人物登场，都不是好人。代表人物有，梁芳、李孜省、汪直、尚铭、万安。万安，成化5年入阁(时阁臣有商辂)，成化11年，商辂退休，万安成为首辅。汪直，太监，斗不倒尚铭(也是太监)。成化13年成立西厂,搞了杨晔(杨荣后人)，杨晔死于狱中。商辂与怀恩(好太监)告了汪直一状，汪直被免职。成化17年，李孜省、尚铭合伙搬倒汪直，李孜省又除掉了尚铭。梁芳、万妃劝帝废朱佑樘，怀恩力保，怀恩被罚凤阳守灵，朱佑樘终于没有被废掉。成化23年，万妃去世，朱见深亦去世，年41。 总结成化年前，乱成一锅粥，没有谁是主角。朱见深，不是个好人，也不是好皇帝，只是一个懦弱的人，这要归因于他悲惨的童年。 弘治朱佑樘是个好皇帝，一上台，就整治成化年间的妖魔鬼怪，李孜省充军，梁芳入狱，万安滚蛋。怀恩复职，吴废后被朱佑樘当做母亲奉养。任命王恕为吏部尚书，马文升为兵部尚书。这两个人奠定了弘治盛世的大局,此时都是老头子了。杨廷和出场，后来的权臣，三朝不倒，权倾天下。又有三人相继进入内阁，刘健、李东阳、谢迁是明代次强内阁，仅次于三杨内阁。刘健，弘治第一重臣。李东阳，善谋，文坛领袖，开创茶陵派。同时代还有一个李梦阳，发起文学史上的复古运动，还是前七子之一。同时代的还有唐伯虎，名寅，与祝枝山、文征明、徐祯卿合称吴中四才子或江南四大才子。唐伯虎进京赶考，监考官正是李贤的女婿程敏正，考题只有2人答了出来，一个是唐伯虎，另一个是徐经。意外发生了，由于唐伯虎时常对别人说他一定是状元，就被人告了作弊，与徐经，程敏正一同被抓。对唐伯虎的处罚是贬为小吏，不得为官，仕途算是断送了。这也是个悬案，到底有没有作弊，经作者推测，确实有人作弊，可能是徐经作弊，连累唐伯虎，也有可能作为程敏正的约定门生，唐伯虎确实从程敏正那里拿到了考题，作弊了。这三人的结果是，唐伯虎从此心灰意冷、浪荡天涯，程敏正免官，徐经回家焚烧四书五经，告诫后辈永不读书，其重孙徐振之，变成了旅行家，此人别名徐霞客。王恕、马文升都老了，马文升推举刘大夏，任兵部尚书，杨一清，刘大夏推举，于陕西指挥兵事。弘治18年，朱佑樘逝世，年36。 总结弘治年间，皇帝朱佑樘，任用王恕、马文升、刘健、李东阳、谢迁等人，天下大治，史称弘治中兴，朱佑樘是一个好皇帝，也是一个好人，到目前好像还没有人得到如此高的评价。 正德刘瑾 VS 刘健朱佑樘去世了，独子朱厚照继位，但这位皇帝不像他父亲，是个最能闹，最会玩的皇帝。马文升、刘大夏上书劝诫，刘瑾从中使坏，马文升、刘大夏被免职。刘瑾，八虎之一，因为会陪皇帝玩，成了大红人。焦芳，文官集团中刘瑾同党。刘健联合文官集团上书请除刘瑾等，被焦芳提前告知刘瑾，刘瑾等八虎先一步去找朱厚照哭诉，于是没有成功。刘健、谢迁请辞，李东阳因为之前只说要惩罚有罪的太监，没有同刘健等一样做绝，被留了下来。刘瑾胜。 王守仁在刘健、谢迁离职之际，有一批官员一起上书，请求朝廷挽留。结果当然是全部被打屁股。王守仁就在这批人中，第一次登场。王守仁，光芒冠绝当代、映照千古，是作者所说的明代第一强人。王守仁，字伯安，别号阳明。日本海军名将东乡平八郎，王守仁粉丝，其腰带上有一生伏首拜阳明几个字。王守仁父亲王华，是一名状元，家庭殷实。王守仁自小喜爱舞枪弄棍、兵书，立志做圣贤。甚至在他结婚时去跟道士学打坐，大家找不到他，人们都认为他是个怪人。既然要做圣贤，首先接触到的是理学家朱熹的格物穷理，于是他开始今日格一物，明日格一物，还有守仁格竹故事。后来研习武艺，骑射，考中进士，在一次与杭州的一个禅师的对话中，悟出不能存天理灭人欲的道理，因为人性不能泯灭。时间回到当时被打屁股的时候，王守仁因此被贬为贵州龙场驿。回去途中机智躲过刘瑾的追杀，到南京找到了他父亲王华，王华告诉王守仁，要他去赴任。于是王守仁出发了，去那边远之地，龙场条件很艰苦，但王守仁坚持了下来，教化乡民。也是在龙场，一个无人的山谷中，一门伟大的学问，心学，诞生了。很多史书记载了这一瞬间，也产生了一个名词，顿悟。心学讲求天人合一，随心而动，随意而行。 李东阳&amp;杨一清&amp;张永 VS 刘瑾此时朝廷只剩下李东阳苦苦支撑，李东阳向焦芳示好，不断营救刘瑾要迫害的人，忍辱负重。而另一边，因为皇帝不管事，刘瑾是皇帝的代言人，刘瑾权势越来越大，投靠他的人越来越多。杨廷和，神童，官场上平步青云，正德2年入阁，做过朱厚照的老师，因此刘瑾整不倒杨廷和，杨廷和也因此投入李东阳一边。杨一清，此时为三边总裁，位高权重。刘瑾想拉拢杨一清，被杨一清拒绝，于是刘瑾开始打击杨一清，杨一清走时推荐张彩接替。张彩是刘瑾的谋士，由是刘瑾对张彩产生了怀疑，杨一清这招实在是高啊，而杨一清入狱。杨一清本是李东阳的师弟，李东阳设法救出杨一清，让他隐居起来，要用他的时候再通知他。刘瑾，也是想做点事的，但是不懂的事也要掺和就会犯错了。刘瑾建言说整饬军屯，开始犯错。刘瑾谋士张彩听说此事，提醒刘瑾要小心，但是刘瑾已经不信任张彩了，不听，继续犯错。军屯因为损害到地方军阀的利益，引发了安化王叛乱，而叛乱的口号是诛杀刘瑾。杨一清起复三边总裁，平定叛乱，监军张永。张永，八虎之一，与刘瑾不和。当杨一清赶到时，叛乱已经被他老部下平定了，于是杨一清开始试探张永，得知张永确实可以争取。张永走时，杨一清请求张永去搬倒刘瑾，一旦皇上同意，要连夜派兵抓了刘瑾，并告诉他，到时候会有人帮助他。张永回去的接风宴上，刘瑾也有防备，一直监视着张永。张永假装一直喝酒，直到刘瑾离席，张永开始告状，但是朱厚照是个250，说这些事先不管，先喝酒。张永又说刘瑾会夺取天下，朱厚照依旧250，说让他去夺。张永坚持说，到时候陛下去哪安身，朱厚照终于清醒了，于是刘瑾被抄家下狱。但是朱厚照毕竟有感情了，不想杀刘瑾。李东阳出手了，联合百官弹劾刘瑾，并从刘瑾家搜出了兵器，于是刘瑾判处凌迟。审刘瑾的时候，刘瑾仍然嚣张，说你们都是我推荐的，谁敢来审我，出来个驸马爷敢审，正德5年，刘瑾被处死，张彩也被处死，焦芳被赶出内阁。此后，杨一清担任户部尚书，又任吏部尚书。正德7年，李东阳退休，杨廷和接替，又4年，李东阳去世，年71。 朱厚照刘瑾死后，钱宁成了朱厚照的新玩伴。朱厚照玩，玩些什么呢，建豹房，玩动物。猎奇，玩女人，玩已婚的、怀孕的。总之，朱厚照反叛，追求自由。宫里玩腻了，就出去玩。江彬，也是朱厚照玩伴，支持朱厚照出去玩。朱厚照第一次出奔，被拦了回来，大臣们当然不会让皇帝出去玩。第二次出奔，钻空子跑出去了，去了关外。当年鞑靼有个牛人，叫做小王子，连年寇边，无人能敌。朱厚照当然想会会小王子，于是调兵遣将，迎击小王子。应州之战打响，朱厚照玩的厉害，打仗也是会的，应州之战赢了，朱厚照还亲手杀了一个，这段历史史书记载并不详实，无外乎当年朱厚照是偷跑出去的。北边玩过了，朱厚照要去南边玩，一大批大臣劝谏，朱厚照一怒之下打死了10几个，不过最后拗不过大臣，也就放弃了。 王守仁2朱棣打天下时黑了宁王朱权，宁王后来被封在南昌。朱宸濠正是朱权后代，很有抱负，心怀不轨。前后贿赂刘瑾、钱宁、杨廷和等，招聘流氓强盗。正德5年，王守仁起为庐陵知县。正德11年，巡抚江西南部，升官很快，背后支持王守仁的有杨一清，以及兵部尚书王琼。正德12年，王守仁到达江西。此后在江西剿匪，用兵诡异，很有成效。他的知行合一的理论，后来影响了如徐阶、张居正、海瑞(海瑞没明白)、陶行知等人。时任江西巡抚的还有孙燧，是个正直之臣。朱宸濠有两个谋士，刘养正，李士实，都没啥本事。朱宸濠还招揽来唐伯虎，唐伯虎去了发现是要谋反，于是装疯，裸奔才能回去，之后唐伯虎就彻底堕落，嘉靖2年去世，一代天才，这种结局，实在令人唏嘘。正德14年，朱宸濠叫来王守仁、孙燧宴会，借机试探他们俩。王守仁委婉的表达了要做忠臣的意愿。江彬与钱宁不和，要害钱宁，利用朱宸濠与钱宁有关系，就说了朱宸濠的坏话，杨廷和知道了，赶紧通知朱宸濠不要轻举妄动，但是朱宸濠太心慌了，遂谋反。正德14年，朱宸濠谋反，杀孙燧，王守仁逃跑。王守仁逃到了临江府，带着临江知府戴德孺的人马去了吉安。吉安知府伍文定是个勇将，于是王守仁在吉安建立大本营，召集兵马。由于聚集人马需要时间，王守仁使用诡计，使朱宸濠在洪都逗留10天没去进攻南京。而当军队集结完毕，王守仁却没有进军，他认为，攻难胜，敌动再寻机攻之。叫做此心不动，随机而行，所以也有人说王守仁狡诈专兵。朱宸濠进发了，攻下九江，一时攻安庆不下。此时，众人一致认为应该救援安庆，而王守仁认为应该攻打南昌。因为舍近求远，风险太大。大军进发了，南昌城夜战，一战而下。朱宸濠回退，驻扎于鄱阳湖。两军对峙于鄱阳湖，当夜，朱宸濠夜袭，遇伏，大败。朱宸濠为了鼓励士气，开始发钱。第二战，仰仗伍文定的勇猛，王守仁的奇兵，朱宸濠又败。朱宸濠铁锁连舟，王守仁火攻破之，俘虏朱宸濠。 王守仁3当朱厚照得知朱宸濠叛乱，决定亲征，不久，王守仁胜利的捷报传来，却被江彬隐瞒了。江彬又把钱宁整进了监狱。王守仁上奏，让皇帝路上小心刺客，江彬以为王守仁意指自己，就恨上了王守仁。而王守仁请求皇帝留在南京献俘，江彬却非要去南昌。于是王守仁抗命带俘虏去了杭州，把俘虏交给了此时到杭州的张永，自己宁可不要功劳，于是张永帮助王守仁抵挡了江彬的诬陷。江彬派张忠去找王守仁的茬，王守仁射箭连中3次红心堵住了张忠的嘴。朱厚照时在扬州，有江彬等人作恶，可为难了地方百姓。此后，江彬又为难王守仁，张永提前告知，王守仁突然去当道士了，于是皇帝又把他叫出来当官。正德15年，朱厚照离奇失踪，王守仁知道后，认为是江彬试探大家的反应，于是加紧操练兵马，朱厚照又回来了。正德16年，朱厚照回去经由清江浦时落水，不久身亡。朱厚照死了，作者对其评价为：昏庸、荒唐，不是个敬业的劳动者，追求自用，作为人是正常的，作为皇帝不正常。本来说，王守仁立了大功，应该会被委以重任，但是杨廷和阻碍了王守仁的仕途，因为喜欢王守仁的王琼和杨廷和有矛盾。嘉靖元年，王守仁任南京兵部尚书，同年，王守仁父亲王华病逝。此后王守仁辞官，开始传道授业。有个学生叫王艮，被王守仁识破是想出名，但仍然收徒。王艮创立泰州学派(思想启蒙学派)，传人有王栋、徐樾、赵贞吉、何心隐、李贽、徐阶。嘉靖6年，王守仁又被朝廷起用派去广西剿匪。临走时，与钱德宏、王畿 天泉论道。嘉靖7年，从广西回来的路上，王守仁病逝。 杨廷和&amp;张永 VS 江彬朱厚照去世了，但是朱厚照没儿子，于是杨廷和与张永商定由朱厚照堂弟朱厚熜(cōng)继位，年号嘉靖，在位共45年。杨廷和联合张永，骗江彬入宫，杀死。职位由张永、郭勋接替。 总结纵观正德时期，发生了很多大事。皇帝胡搞瞎搞，奸臣蹦了出来，前后太监当权作恶的有刘瑾(风光了5年)，钱宁，江彬。天下大乱，爆发了安化王之乱，宁王之乱，皇帝自己还出去跟蒙古人打了一仗。由其父亲缔造的弘治中兴的局面荡然无存，大明在下坡路上越走越快。当然也出现了一些能人赶走权奸，又有王守仁这样的第一强人坐镇，所以最后也没乱的起来。朱厚照不过是个有点胡作非为的人罢了，也发生了很多离奇的事情，让人感觉不似真的。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿2万国来朝","date":"2016-05-25T12:07:31.000Z","path":"2016/05/25/明朝那些事儿2万国来朝/","text":"前言看完第二部，真的想说点什么了。鉴于第一部，我是比较熟悉的，比如朱元璋朱棣，谁不知道啊，小说电视剧都已经有初步了解了。所以看的时候，波澜不惊，快感不多。但第二部，除了朱棣，还有许许多多精彩的故事，精彩的人，温暖的情。所以再写笔记啊什么的，真的想多写一点，我是看完了又回去大致翻阅一下，找到关键词，防止回忆的时候忘记什么了，不能马虎了。所以不管事实是怎么样，在我眼里，第二部确实比第一部精彩多。最近在简书看到做了10年读书笔记的人的笔记，吓得我都不知道自己在写的到底是什么鬼东西了，写这些有什么意义啊。我思考了一下，不管写的怎么样，证明我看过。就比如历史，如果不记下来，一个月后就忘了，但是记了下来，一个月后看到这篇，又都回忆起来了。现在，这就是意义。 我分为三个大段落划分，1是永乐盛世，2是仁宣之治，3一个民族英雄。下面开始回忆让此刻的我感动的第二部。 一、永乐盛世内修政理朱棣成功了，作为藩王克掉了皇帝，历时4年。建文帝失踪了，朱棣不能安心，派人去找，胡濙去找了。朱棣篡位不具有正统性，怎么办呢，硬说自己是马皇后生的，隐瞒了自己亲妈。那些建文的旧臣，如方孝孺，诛十族，第十族是朋友，学生。做完了这些事，朱棣还是觉得天下人不服他，他要文治武功，威震四海，这样才不会心虚。用解缙主编永乐大典，一部百科全书。又把京城从南京迁到北平，北平原来是他大本营，改名北京。虽然北边不是产粮区，环境也不好，但是因为跟蒙古作战，南京太远了。郑和原名马三保，小时候被抓去充军不幸被阉割。因为靖难有功，被朱棣赐名郑和。郑和的祖父父亲都是伊斯兰教徒，都去过麦加，郑和也有这个梦想，于是就开始7次下西洋的壮举。最远到达过非洲，航海中虽然也有过险境，都被郑和化解了。郑和下西洋不是耀武扬威，欺负弱小，而是文明的使者，传播文化，促进交流，比西方的一些航海家插个旗去殖民的行为强10000倍。此时共有30多国来给明朝朝贡，很多来了就不想走了，不愧为永乐盛世。 外征周边当时的安南，就是今天的越南，本来是姓陈的当国王，但是姓胡的篡位了，而且瞒着明朝。直到发现朝贡的国书上面国王换了姓，此时的陈姓支持者也来告知了真相。张辅出征了，张辅是靖难战死的朱棣第一大将张玉的儿子。张辅也很强，30万大军征安南。安南也有应对之策，大象。于是张辅找来马匹穿上狮子的画像，又充分利用火铳，平定了安南，陈氏没有继承人，明朝就把安南划入了版图。 瓦刺是蒙古的一支，虽然不是黄金家族，但是也在西部地区强盛了起来。朱棣打败鞑靼后，打瓦刺。瓦刺实力强，但是明军更强。此时明军有三大营，神机营，三千营，五军营，并且有一套当时领先世界的战术体系。就是先打枪，再上骑兵步兵。瓦刺骑兵也失败了。火器应用要数云南沐家最厉害。沐英当年跟随蓝玉傅友德进攻云南，之后就被封在云南。云南大象多，只有火器应对的了。 两个儿子永乐年间朱高炽朱高煦的争位我认为是堪比琅琊榜的权谋之争，因为他们的爹是个非正常手段上位的一代雄主，一不小心就倒台。朱高炽是太子，但是他腿残疾，又是个大胖子，远不如朱高煦漂亮威武。当年打南京时，朱棣就拍着他的背说，世子有疾，勉之，朱高煦从此就做上了皇帝梦。处心积虑打击朱高炽，当时大部分人看到朱高炽不牢靠了，都转投朱高煦。但是有有三个人始终支持朱高炽，就是著名的三杨，杨士奇，杨荣，杨溥，杨溥还为此坐了10年牢。朱棣喜欢打仗，不像朱元璋有旺盛的精力没日没夜的处理朝政，于是他就组建了内阁，内阁帮他做事，他就可以去打仗了。后来三杨组成的内阁堪称最强内阁。还设置巡抚总督督师管理地方大事。因为三杨的努力，朱高炽才没被废掉。朱棣在北征回来的路上死掉了，临死之前，胡瀅回来了。他最终得到了建文的消息，根据作者猜测，建文帝还活着，并且表达了不会再争了。朱高炽早先得到消息，顺利继位了。 仁宣之治朱高炽明仁宗朱高炽是个好人，他放过了朱高煦。他还把建文旧臣的后人都找回来，为方孝孺平反，但是他只干了一年就死了，他的年号叫洪熙。 朱瞻基明宣宗朱瞻基也是个好皇帝，他与他父亲统治时期，朝政清明，与民休养生息，史称仁宣之治，是明朝国力最强盛的时候。仁宗走了，朱高煦再也忍不住了，叛乱了。朱瞻基亲征，朱高煦不堪一击，被抓。朱高煦变成了喜剧演员，朱瞻基去看他，他莫名其妙的用脚勾了一下朱瞻基，朱瞻基用铜钟把他罩起来，他扛着钟走，最后朱瞻基放火烧死了他。 朱瞻基当政期间，开始启用太监，因为皇帝只有一个人，大臣有一帮，为了制衡，只好启用太监，没有别的办法。内阁有票拟权，皇帝有批红权。他教太监读书，这是乱象的一个起点。朱瞻基干了10年才30多岁就死了。他的年号叫宣德。 民族英雄于谦太监王振王振本来是个县城小官，为了荣华富贵，出人头地，自宫当了太监。当时太监文化水平太低了，于是王振脱颖而出。太监有2个部门最有前途，一个是司礼监一个是御马监，司礼监跟诏书有关，御马监跟兵符有关。朱瞻基死了，他的儿子才8岁的朱祁镇继位了。王振是朱祁镇的老师，朱祁镇什么都听王振的。王振作威作福，独揽大权，收受贿赂，朝政乌烟瘴气。明朝开始走下坡路。这时瓦刺又强大了起来，统一了蒙古，首领叫也先。也先进攻明朝边关，王振不懂兵，偏偏要逞能。带着皇帝，带着20w明军精锐出发了。到了山西，一会要回自己老家看看，一会又不看，被也先逮到机会，全军覆灭。随军大臣50多员战死，包括那个平定安南的张辅。皇帝被俘，20w精锐尽没，这就是著名的土木堡之变，所幸的是王振也在乱军中死了。 于谦按理说这明朝要走北宋的老路啊，但是此时一个人站了出来，拯救了这个危局，就是于谦。于谦的偶像是文天祥，宣德时期骂朱高煦有功，被委以地方大员。此时在朝廷纷纷议论南迁之时，力挺一战，并且迅速准备战备，稳定人心。此时代理政事的是朱祁镇的弟弟朱祁钰。朝堂上群臣请命要打击王振党羽，朱祁钰沉默了，于是朝堂斗殴开始了，几乎所有的大臣都去打那几个王振的党羽，活活打死。朱祁钰慌了，想逃走，于谦上前请求应判大臣们无罪，于谦的威望又上了一个层次。也先来了，带着朱祁镇做人质，大臣纷纷请求朱祁钰登基，朱祁钰登基了。朱祁镇成了太上皇，过期了。也先先在西北带着朱祁镇叩关，郭登杨洪拒不开门。也先之后去北京了，于谦正等着他。于谦下达了要么战死要么胜利这样的军令，各个门派人把手，分配武将。又亮出了最后的神机营(土木堡三大营也覆灭了)，在石亨孙镗等人的奋战下，也先失败了，撤退的晚上又被大炮轰，也先恢复元朝的霸业也覆灭了。 朱祁镇朱祁镇是明朝最传奇的一位皇帝了，但是他并不坏，还是个好人。因为小时候父亲就死了，年纪小被人利用也很正常。直到土木堡被俘，他将开始他传奇的一生。土木堡战败时，他也不跑，镇定自若，蒙古兵见他不凡就把他带去见也先，他也不怂，甚至他在也先那里还处到了朋友，他是那种到了哪里都人缘好的人。作为人质，被带着东奔西跑，大明朝也不要他了，有了新皇帝。流亡的日子是艰苦的，也是能体现患难与共的。袁彬就是跟朱祁镇患难与共的人，北方冷，袁彬把朱祁镇的脚放在自己怀里给他暖脚。袁彬遇难，朱祁镇愿用生命去救他。有个坏人叫喜宁，是个汉奸，总是迫害朱祁镇，后来喜宁被朱祁镇他们除掉了。朱祁镇还有蒙古朋友，叫伯颜帖木儿，总是帮着朱祁镇。朱祁镇对也先没有价值了，又不能杀他，就想把他送回去，但是明朝不来人接，因为朱祁钰不想他回来。朱祁钰爱上了皇位，放弃了兄弟。后来拗不过大臣终于派人去接，又不给钱，还好有个叫杨善的人，嘴皮子非常厉害，把也先说动了，不花钱就能领回家。 朱祁镇回来了，之后就被关在南宫。土木堡之后，朱祁镇的皇后钱氏倾尽所有的财物送给也先，希望也先放人质。当然没放，于是钱氏每天哭每天哭，哭瞎了一只眼，哭断了一条腿。皇后与皇帝之间也会有这种夫妻真感情，闻所未闻。此时，那么多年过去，钱氏在等他的丈夫回来，朱祁镇回来了。即使被囚禁，朱祁镇还是镇定自若，这么些苦吃过了，朱祁镇已经懂得了很多。 这下轮到朱祁钰着急了，他哥哥回来了，他的位子不稳了。而且太子还是朱祁镇的儿子(当年孙太后跟他当皇帝的交换条件),于是他贿赂大臣，让他们支持自己把太子换成自己的儿子。可是他儿子死得早，于是大家有要求他换回来，没辙了。朱祁钰也病了，快不行了。这时候冒出来一帮人，打算帮助朱祁镇复辟。这帮人有土木堡之后第一个提议南迁的徐锃，此时已改名徐有贞，石亨，太监曹吉祥，组成还乡团。在一个夜晚，带着朱祁镇夺门复位，并且成功了，朱祁镇又回到皇位了。 朱祁镇，明英宗，第一次当政年号正统,第二次天顺。 朱祁钰，明代宗，年号景泰。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"嫌疑人x的献身","date":"2016-05-22T13:20:04.000Z","path":"2016/05/22/嫌疑人x的献身/","text":"推荐之书早前看过电影，当时感到确实牛逼啊。不过到看书前，大致情节都记不清了。只记得真相是杀了一个叫花子，最后主角很悲剧。很震撼，之后也是久久不能平复。 后来意识到东野圭吾的大名，又见到解忧杂货店畅销，就先买了相对熟识的x来看。 情节石神是个数学天才，帝都大学毕业后被迫当了个高中数学老师，人到中年仍然孤身，他想自杀。恰巧那天隔壁来了靖子母女，靖子离异独自带着女儿，石神暗恋靖子，天天去靖子工作的便当店光顾。靖子前夫是个无赖，纠缠她们母女不放，靖子母女失手杀了他。石神挺身而出帮她们处理尸体，隐瞒真相。警察找了上来，靖子母女按照石神的指示小心对付。办案警官意外引来了汤川，汤川是石神的老友，物理学家，其逻辑思维足以和石神匹敌。石神精心布置的障眼法被汤川慢慢识破，和靖子的关系渐渐浮出水面。另一边靖子的老相识妻子去世，追求靖子，石神嫉妒着，靖子痛苦着。 随着汤川一步步识破真相，在跟石神在一排游民处讨论齿轮作用后，石神自首了，证据全部对的上。知道真相的汤川替好友不平，去找了靖子，把真相告诉了靖子。原来石神不惜为了保护靖子母女，抛尸后，不惜再杀一人，是个流浪汉，所有的案情都是跟流浪汉有关，那么靖子母女就永远是安全的。为爱牺牲至此，用情至深，超乎人性极点。 靖子得知真相的同时，老相识送上了钻戒，是愧疚的活一辈子还是去自首，靖子在犹豫，但是女儿割腕了，所幸没死。靖子决定说出实情，自首了。 感受除了感叹作者构思匪夷所思，故事精彩至极之外，就是石神的爱，是暗恋，从一开始就赌上了性命，实在伟大。所以得知真相的靖子承受不住那份巨大的压力，选择了自首。而且石神喜欢人从眼睛开始，有共鸣啊。虽然故事离我遥远，但是至情至性，感人至深，是我今年到目前为止读到的最好的故事。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿1洪武大帝","date":"2016-05-21T09:49:07.000Z","path":"2016/05/21/明朝那些事儿1洪武大帝/","text":"总评豆瓣阅读买的电子书，一共7部，总共4、50块，要是买实体书的话一定上百的，毕竟一部就20多万字。 第一部主要描写朱元璋的一生以及建文帝朱允炆那几年。我认为可以分为4个部分，第一是朱元璋与群雄相争到扫灭陈友谅及张士诚止，第二是灭掉元朝驱逐北元到蓝玉扫灭元庭止，第三是内政方面洪武四大案到朱元璋去世止，第四是靖难之战到朱允炆倒台止。作者着墨最多的是靖难之役，花了三分之一的篇幅都在讲这件事，讲的很细致。 这本书给我的感觉就是，一开始以为讲历史，结果啥都讲。也有很多人诟病的一点就是，故弄玄虚，夸大其词，不过这也是章回体小说的套路。 一、群雄相争朱元璋的发迹朱重八，安徽凤阳人，农民出身。为什么叫重八？因为祖上都没文化，只能以生日年龄等数字起名字，就是朱八八。 元末，官员腐败，汉人又地位低贱，天下大灾，爆发了韩山童、刘福通为首的农民起义。朱元璋家祸不单行，父母，大哥二哥都饿死了，朱元璋就去当打工的和尚，辗转讨饭于各地，在这期间磨练了心智。后汤和引荐他去郭子兴处参加起义军，因为能力强，郭子兴把义女马姑娘嫁给他为妻，这就是后来的马皇后。后来从郭子兴处借来兵马，在安徽江苏一带发展，占据金陵为根据地，成为一方势力。历史演进，小角色谢幕，出现了2个主要的对手。 陈友谅&amp;&amp;张士诚朱元璋前期主要是自己指挥为主，他是杰出的政治军事家，这有赖于他后来的自主学习。手下有武有徐达常遇春等名将，谋有刘基，关键时刻能正确判断事情的人。 陈友谅，湖北仙桃人，渔民出身。本是小吏，为人狠毒，一步步向上爬，最后干掉主子徐寿辉，称国号汉，登基为帝，都九江，占据湖北江西一带，陈友谅不愧为枭雄。第一次攻击金陵(南京)，陈友谅水军强大，战船多，朱元璋引诱其至龙湾，使其登岸，伏兵败之。但陈友谅还是很强大，不甘失败，又进攻南昌，朱元璋的侄子朱文正也是个守城名将，陈友谅没能攻下来，朱元璋支援，双方于鄱阳湖大战,朱元璋采用火攻，大败陈友谅60万大军，陈友谅战死。 张士诚，盐贩出身，占据江苏浙江一带，守城达人，自守之贼。元军攻打高邮，张士诚硬是凭借意志力守了下来，也是个人杰。但是他不思进取，在朱元璋与陈友谅大战的时候，也不去支援陈友谅。等到陈友谅被消灭了，就轮到他了，被朱元璋围城，城破自杀。 二、对元战争灭元朝当时元朝还是很有实力，但是从南往北打，历来成功者少。而且蒙古人善战，骑兵厉害。朱元璋先从河南山东开打，凭借他卓越军事家的谋略善战的名将，逐步驱逐元朝，攻下大都。后逐步往东北西北出兵，元迁都上都，称为北元。 这一时期，只要是朱元璋制定作战计划，将领们去完成任务，类似于汉武帝时期的方式。朱元璋只坐镇都城，已经建立了明朝。 逐北元这一时期涌现了许多名将，徐达、常遇春、李文忠、冯胜、邓愈、傅友德等。元朝也有一位名将，名叫王保保，只不过他的运气不好，总有人能打败他。期间常遇春病逝，一代名将陨落。当老将渐渐死去，新人脱颖而出，最厉害的就数蓝玉，蓝玉率领15万军深入漠北，打到捕鱼儿湖(贝加尔湖)，找到元庭，俘虏元妃，王公贵族大部，成吉思汗的黄金后代也遭遇灭顶之灾。后来另一支蒙古人建立政权，就是鞑靼。蓝玉的功绩被朱元璋称赞为可以和卫青(仲卿)，李靖(药师)比肩，不可谓不伟大。 三、洪武四大案对抗制度朱元璋是个权力欲望很大的人，他希望自己建立的朝代是最好的，亲自制定了很多制度，精力旺盛，也很疯狂。 明朝初期，朝廷官员分为2派，一个是李善长代表的淮西派，另一个则是刘基代表的浙东派。李善长可以说是朱元璋的萧何，后勤部长。朱元璋对其也很器重，因为都是老乡。两派互相攻击，最后两派都覆灭了。这时候蹦出来个胡惟庸当丞相，大肆拉拢派系，但朱元璋似乎不管不问，直到时机成熟，一件小事就让胡惟庸倒台，牵连者上万人，被杀。然后朱元璋废除了丞相制度，还设立锦衣卫等特务机构，专门监察官员不法者。锦衣卫，飞鱼服，绣春刀是标配，电影绣春刀等都在讲述着这个传奇的职业。 朱元璋制定了许多约束官员的制度，给官员的俸禄又少，还面对着一个杀官员不眨眼的皇帝，所以明初当官真的是有很大风险的，可谓是朝不保夕，即使你没有犯法。 空印案是官员钻法律的漏洞，郭桓案是腐败，蓝玉案着实是蓝玉自己作死，蓝玉有性格缺陷，打仗很吊，做大官不会做，最出名的就是他奸淫投降俘虏的元妃，人品有问题。后来又因为别的事惹恼了朱元璋，以谋反罪处死，牵连甚广。 为了子孙万代朱元璋杀那么多人，很多错杀冤杀。这与其自身成长经历有关系，他从要饭的变成皇帝，这期间，他的心越来越硬。他希望自己的后代不要像他那样受那么多苦，为子孙剪除了一大批可能有威胁的臣子。建立了他认为完美的制度，认为这样他的子孙后代只要他制定照着制度走，就能千秋万达，历史证明，这多么不现实啊。 四、靖难之战朱标与朱允炆朱元璋的儿子除了太子朱标，都被封为亲王，拥有军队，用以危难时勤王。朱标，为人宽厚，为朱元璋喜爱，被封为太子，但是死得早。由于朱元璋对朱标的深爱，便立朱标的儿子朱允炆为继承人。朱允炆也是个饱读诗书，宽厚的人。朱元璋怕自己走了，朱允炆镇不住那些有能力的大臣或者亲王，给他留了几个人。方孝孺，忠义的文臣。齐泰，不出错的出色官员。黄子澄，朱允炆的伴读。朱允炆早就意识到朱棣不会安分。 靖难朱允炆一上台就搞他的其他的几个叔叔，或者关起来，或者流放，但就是不杀死，妇人之仁。朱棣也警觉了，暗中打造兵器，装疯。等到时机成熟了，遂起兵，占据北平。本来朱棣一个亲王，十几万兵，不可能成什么气候。但是怪就怪在朱允炆和朱棣能力不是一个层级的。 首先去打朱棣的是耿炳文，这是个守将，不会攻啊。带了30万人，败。但是朝廷兵多啊，第二波，李景隆，李文忠之子，但这是个军事白痴啊，带了60万人，又败。这一战也有沙尘暴的原因，让朱棣抓住了时机，天要朱棣胜。之后，朱棣进攻，打济南，这个时候，有人站了出来，铁炫、盛庸、平安这些人，有的是小吏，有的是低职军官，但他们守住了济南。战争进入拉锯阶段。 朱允炆任命盛庸为新的总帅，进攻朱棣。此战朱棣大败，大将朱玉战死。但是因为朱允炆的不杀朱棣的约束，混战中所有人都不敢把火器朝朱棣身上招呼，这也是朱棣与朱允炆的等级差别的体现。之后又一次发生了沙尘暴，朱棣又打败了盛庸。 姚广孝，和尚，道士，阴阳家。本来已经是个老人了，但觉得一生空有抱负无处施展，又考不过科举，就到了朱棣的身边，劝说朱棣造反。这一次他劝说朱棣绕道直取京城，于是朱棣又出发了，不打济南了，走徐州、宿州、灵璧、直到南京。这个时候，那个李景隆又出来了，作为朱棣的内应来打开城门了，这个间谍埋得好深啊。朱允炆烧城失踪，一批忠臣被朱棣残杀。 朱棣，历时四年，燕贼篡位。归因于他的坚韧，朱允炆的等级太低。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记02【无题】","date":"2016-05-18T14:36:01.000Z","path":"2016/05/18/日记02【无题】/","text":"烦心事本来只是看到一篇讲给博客插入音乐的博客，想实践一下，顺便测试一下。遇到了一些烦心事，工作上也有点不愉快，这两天回去之后，一般就是睡觉。 从小的来，我妈最近工作中扭到腰了，还挺严重。突然意识到我才从学校出来，父母身体却不好了，努力的速度完全赶不上他们衰老的速度啊。最近看到一句话，读得好不如长得好，长得好不如生得好。 本来很早就能下班的，可是一个同事请假了，另一个同事跑得比我还快。版本要发布了，我只能留下解决可能出现的问题。还真有，就是那个跑得早的同事的问题。这还不是关键，加班也就罢了，好基友在等我下班啊，最后我就请他吃了饭啊。 我陷入困境了这两天，浑浑噩噩，上班埋头敲代码，下班看点书睡觉。大雨衬托着此时的心情。又疯狂买了4本书，一个月买4本，这个月买6本了。 新东西试试插入音乐的功能","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"游无锡","date":"2016-05-15T15:42:25.000Z","path":"2016/05/15/游无锡/","text":"游与行在我的词典中，旅游分为2种。 一是旅游，一堆人，特别热闹，到什么景区。这是规范化的旅游，要收钱。很多时候没什么大意思。一般目的地是人工开发大于自然美景。 二是旅行，可以一个人或者几个人，野游。随便到什么地方，有的时候比规范化的旅游看点更多，更美。一般目的地是自然风景。 旅游地又分为2种，但是我现在认为可以有3种。 自然风景，人为装饰较少，如一些山。本身足够雄奇，不需要人工雕饰。 人文风景，一般以建筑为主。由于现在很少有历史遗迹（很多那些所谓的遗迹都是后人还原仿建的），这类看点不大，也没什么意思。 影视基地，背靠自然风景的影视基地。中国影视发展了几十年，这群基地是仿的里面最出类拔萃的。影视也可以怀旧啊，还是有一些精品的。 无锡早上出发，车上老板陈词，做活动，新人介绍。我也挺悲催的，惩罚环节怎么少的了我(郁闷脸)。3个小时的车程，中午都是硬菜。到了无锡，导游就上来了，名叫侯希希，笑声很有特点。无锡缘何称无锡，锡山有锡，锡锻造青铜器的材料，兵家必争锡山。王翦除锡山，无锡（导游说的）。还说了，吴的祖先，阖闾，夫差，勾践，吴越，范蠡，西施，还好我都懂。 鼋(元)头渚很烂的地方，坐大船去到一个岛上，岛上全都是近些年旅游开发的东西。且人满为患。 仙岛 岛上的水 城 下了岛，还有 包孕吴越 拔河游览完毕，公司的体育竞技，选在一个草坪上，我们组第一场第一轮晋级，第二轮败退。第二场，训练的很好，有个隐患没人注意，比赛时绑带脱落。out出局。值得一提的是决出总冠军的拔河比赛。之前一直没了解过拔河有什么技巧。原来有种姿势是全体正向拔河向后倒，利用草坪的摩擦力不大，着力点放宽，他们组轻松取得胜利。反观另一组，全部侧身姿势，爆发力是强，一点对面顶住5秒钟，胜负已定。如果不是草坪是水泥地效果就没有这么好了。 晚宴还好可以不用喝太多酒，一群人出去逛了下夜晚的无锡。没有杭州的脚步匆匆，这是一个地广人少的地方，适合生活。夜静很美丽。 酒店2人一间，4星级，400多一天，可以了。 三国城刚进去嗤之以鼻，不就是人工造的吗，没啥意思。直到看三英战吕布的表扬，马术可以的，背景音乐也是老三国的，有刘欢的这一拜 还有 貂蝉已随清风去等。谁让我看过老三国呢，还不止一遍。忍不住发了个朋友圈，像我这种从不发朋友圈的也没忍住，虽然后来删除了。 三英战吕布 看完，天公不作美，下起了雨，撑伞呗。途中我们的导游秀逗了一把，他说刘备去山东诸葛亮老家三顾毛驴，看来他水平太次了。但是路上还有个其他的导游，倒是水平不低。为什么呢？他说，有三个人在对待汉朝皇帝这件事上犯了成本高，效率低的致命错误。他们分别是，董卓，袁绍，袁术。卧槽！一听这个，我觉得他肯定看过易中天的，这是易中天讲的呀。水平可以的。到了水边，本次旅游最最壮阔的地方、最最美的地方。一张图说明一切。 壮阔的水边 当时风大，浪起，很有fell。为什么打动我？背靠太湖，这里自然风景已经大过了人文建筑。 之后去吴王宫，水浒城，就再也没有这样令人神往的地方了。 吴王宫","tags":[{"name":"游记","slug":"游记","permalink":"https://amasawaseiji.github.io/tags/游记/"}]},{"title":"岛上书店","date":"2016-05-15T13:52:27.000Z","path":"2016/05/15/岛上书店/","text":"封面 每个人的生命中，都有最艰难的那一年，将人生变得美好而辽阔 句子 无人为孤岛，一书一世界 独自生活的难处，在于不管弄出什么样的烂摊子，都不得不自己清理 没有人会漫无目的地旅行，那些迷路者是希望迷路 好的婚姻，至少有一部分是阴谋 婚礼就是这样，会让人感觉孤独的要命 一个地方如果没有一家书店，就算不上个地方了。 主题 因为从心底害怕自己不值得被爱，我们独来独往。然而就是因为独来独往，才让我们以为自己不值得被爱。有一天，你不知道是什么时候，你会驱车上路。有一天，你不知道是什么什么时候，你会遇到他(她)。你会被爱，因为你今生第一次真正不再孤单。你会选择不再孤单下去。 –A.J.与艾米婚礼 迟暮花开 关于一本畅销小说，美国人所写。故事时间跨度还是有些长，所以人生阅历尚浅的我很难get到共鸣。就像那个电影，one day，主要是虐，但是那种时间的流逝，命运的无常，很让人唏嘘。 再扯另一个话题，看书。之前我看书，都是过一遍，图一个爽，不会去想任何东西，那叫浅阅读。现在知道了看书是要思考的，所谓学而不思则罔。看一个小时，思考2个小时，作者为什么怎么写？作者想通过这些表达什么？虽然我还get不到这种阅读技能，也时间有限不能想那么久，毕竟不是去研究什么东西。但现在已经开始思考了，这也算是进步，至少会想一下，看完了，我从中学到了什么。 那，这本书，我又学到了什么？除了低谷中的坚持，无出其右啊，关键是get不到啊，没有共鸣。但是个不错的故事。由于不是一口气读完，中间还穿插了去旅游，前面的有些都记不清楚了。只能试着去回忆了。 主人公是一家在爱丽丝岛的书店的老板。名字叫A.J.费克里（我总是读成费里克（尴尬））。故事开头，女主角给小岛书店推荐书目，遭到了A.J.的冷遇。女主角名叫阿米莉亚（朋友会喊她艾米），是出版社的销售代表。冷遇？这是因为A.J.妻子妮可去世了，他在低谷中。A.J.整日买醉，书店情况越来越糟。人在低谷中，总是要有重重一击，才会清醒过来。A.J.的一本价值几十万的书被偷了，那是他最值钱的东西。警长兰比亚斯在A.J.最低谷的时候给予他类似于陌生人的关怀。 A.J.重拾跑步，打算重新开始，也跟兰比亚斯成了朋友。一天，他去跑步回来发现，家中多了一个女婴，附带一则留书，玛雅的妈妈说自己实在无路可走了，第二天，玛雅的妈妈就跳河自杀了。（这里埋了个伏笔，为什么玛雅妈妈一个外地人，人生的最后选择了爱丽丝岛？）A.J.竟然渐渐与玛雅产生了感情，决定收养玛雅。一个单身汉收养一个女婴，听起来不可思议。A.J.是个痴迷于读书的人，尤其喜欢短篇。这样一对父女开始新的生活，且越来越好。 一天玛雅出水痘，A.J.很焦虑，抓到手边一本书开始读，这本书叫迟暮花开，讲述作者自己单身一辈子，78岁娶了位妻子，妻子比他还大，2年后妻子去世，这样一个悲伤地故事。A.J.发现这本书是阿米莉亚推荐给他的，他还有印象，他想找到这个跟他有共同阅读品味的人交流一下。于是2人从合作关系开始，慢慢开始约会。艾米的男朋友是个军人，艾米跟他并没有共同语言。A.J.带着玛雅以及兰比亚斯以去某公园为幌子，实际是他去找艾米，至此2个人确定了男女朋友关系。终于A.J.找到个机会，在请到迟暮花开作者的前提下，办了场签售会，他要在会后求婚！A.J.不会当众求婚，那样做会类似于强迫，他更尊重艾米。会后，A.J.开车送人去了，艾米得知迟暮花开竟然是别人代笔，真是令人啼笑皆非。A.J.回来后即向艾米求婚，艾米答应。并隐瞒了代笔的事，她不想2人结缘的那本书最后是个笑话。 婚礼上A.J.前妻的姐姐伊斯梅，很苦恼，走到了海里，兰比亚斯阻止了她。原来伊斯梅的丈夫丹尼尔外遇不断，而且伊斯梅流产了7次之多，一直没有孩子。丹尼尔是个作家，写的第一本书很受欢迎，所以伊斯梅一直忍受着，直到忍不了了。回去的路上，伊斯梅责问丹尼尔华莱士（玛雅的妈妈）的事情，她知道玛雅是丹尼尔跟华莱士的孩子。车停在路上，遭遇车祸，丹尼尔去世，伊斯梅受伤。 玛雅上初中了，写得一手好作文，这都是A.J.一手打造出来的，一次作文比赛，A.J.给与玛雅指导，玛雅获得第三，写的是她想象的她的妈妈死的那一天的活动。这又是一个引子，引出了之前的谜题，A.J.的收藏书被偷的谜题。 兰比亚斯跟他的妻子结婚时，只知其表不知其里，离婚了，单身很多年。一天，他跟A.J.吐露他喜欢伊斯梅。2人约会、上床。早上起来，他发现了那本被偷的书在伊斯梅那儿，但是他爱着伊斯梅，什么也没做。A.J.有时会有失语症，一天，他跑步时，晕倒了。去医院得知自己得了脑瘤，手术后也不能活多久。他犹豫着是要花一笔钱治病，还是省那笔钱给玛雅读大学，给妻子还房贷。他找到兰比亚斯，告诉他实情。兰比亚斯跟伊斯梅坦白自己知道那本书在伊斯梅那儿，在伊斯梅的话中真相终于揭开。原来华莱士找过伊斯梅，想要问丹尼尔要钱，她们过不下去了。伊斯梅要单独摆平这件事，她爱着丹尼尔。偶然看到A.J.不省人事，那本书就在桌上，她顺手拿走了。给华莱士，但华莱士用这个换不来钱。又去找伊斯梅，还给她书。然后这本书被玛雅损坏了，伊斯梅只能一直放自己那儿。书换得7万多元，手术了，之后也没活多久，去世了。艾米经营不来书店，兰比亚斯和伊斯梅接手，艾米辞去了销售代表的工作，又有新人上来，又有新故事不断发生。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"草房子","date":"2016-05-08T10:27:00.000Z","path":"2016/05/08/草房子/","text":"读书总结？读书读的是什么？读了一本书，除了跟随作者领略了主人公的心路历程，体验了一番别人的生活经历，于我留下了什么。时间一久，恐怕就什么都忘了。所以说读书不光是体验，还要总结。这才是读书的用意所在。况且听人说，就算读的书再少，也要写总结。于是这篇就是一篇总结，而且是认真读完了的总结。 草房子？都知道，儿童文学，入选中学课文的。早在我中学时，就在同桌的手里见过这本书了，并且他当时还跟我安利了，但是错过了没有读。后来也忘记是高中还是大学了，在少儿频道看过电影版。当时看的很感动的，虽然都是小朋友的戏，但是有共鸣啊。直到作者曹文轩获得国际安徒生奖，草房子又进入了我的视野，果断买了本回来看。虽然已经步入工作，看完了之后，仍然觉得感动依在。 感动依在秃鹤因为是秃子，被人嘲笑，不受人待见。但是他却在事关学校荣誉的文艺表演上，证明了自己。原来人可以不因为外表，而是因为有所担当，变成最英俊的少年。 纸月被男同学欺负，被迫转学。转学后依然有人在上学路上骚扰她，天天迟到，桑桑站了出来，桑桑为帮助纸月逃脱，跟人比试从桥上跳下去。少年为了少女甘冒艰险，什么是值得的，什么是胆略？ 桑桑成了蒋老师和白雀的信使，他也不懂为什么就愿意成为信使，并把这件事变成了他的责任，因为他的好奇导致他俩的误会，桑桑耿耿于怀，总想着弥补。后来终于桑桑说出了实情，可是时过境迁，挽回已不可能。白雀把那些信全部送给了桑桑，希望他以后可以懂得多，就误会少了。阴差阳错，不能全怪桑桑，除了要桑桑明白，也是要读者明白，大人的世界是什么样。 秦大奶奶独居校园小屋，学校赶不走。因此她和学校就结下了梁子，让人误会。却在学生落水之际，不顾年迈挺身而出，赢得了大家的尊重，也因此变成了慈祥的秦大奶奶，直到故去引得一群学生悲伤与怀念。 杜小康本是油麻地富贵人家的孩子，成绩好，总是抢了桑桑的风头，2人从竞争对手到朋友大概还是因为杜小康的心胸豁达，愿意借车给桑桑骑，也由此引发了一场大火。杜小康有担当，主动承认，而桑桑却做了缩头乌龟。桑桑因此痛恨自己，羡慕着杜小康。但是天有不测风云，杜家遭难了，货船沉船了，家道中落。杜小康上不了学，跟着父亲去放鸭，也失败了。这里应该是全篇的高潮，也是中学课文的那段。杜小康在放鸭途中，面对孤独，忽然长大了，回来后桑桑主动卖鸽子给杜小康筹钱摆小摊卖东西。杜小康的勇敢，与桑桑的友谊，荡气回肠，大有英雄惜英雄之意。 细马是邱家要来的孩子，他是外地来的，跟不上学校进度。于是辍学去放羊了，因为家里的关系，桑桑成为细马唯一的朋友。细马因为年龄稍大的原因，被邱二妈认为是来继承家产的而不是来孝敬双亲的。想赶细马走，但邱二爷对细马确是真情实意，令细马很感动。就在他被送走的时候又自己回来了。恰逢发大水，邱家被淹了，没有家产了，邱二爷病故了，细马成了家里的顶梁柱。经历了这些，细马也突然间长大了，他阻止邱二妈自寻死路，精明的做一些生意，要给邱二妈盖新房子，为人养子者做到如此，无愧于天下了。 文中最后桑桑经历了死亡的考验，原来在面临死亡之际，人性的光辉突然会变得无比耀眼，他愿意做一切为任何人。也许是上天悲悯，看到了桑桑的真情实意，给与了他免死牌。 后记正如小说扉页所说。 也许，我们谁也无法走出自己的童年······ 我也深刻领悟过童年，前段时间翻到我大学时写过的一篇报告，上面还描述了一段惊心动魄的过往。小时候，跟伙伴去桥下玩，踩着石头过河。我们撺掇其中一个第一个去，结果被水冲到下游去了，惊动了很多人，好在下游有大石头挡住了他，不然后果会很严重。这么多年我都记得，更记住了不能拿生命冒险，更不能让别人拿生命冒险。 又如小说内容提要概括的那样，少男少女之前毫无瑕疵的纯情，不幸少年与厄运相拼时的悲怆与优雅，残疾男孩对尊严的执着坚守，垂暮老人在最后一瞬所闪耀的人格光彩，在死亡体验中对生命深刻而优美的领悟，大人们之间扑朔迷离而又充满诗情画意的情感纠葛·····这一切正是一个少年正在体验或终将体验的征程。其实不光是少年，现在社会的少年体验这些的时间明显滞后了。无论何时，于个人而言，这也是一笔珍贵的财富。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"2015在上海","date":"2016-05-08T07:11:29.000Z","path":"2016/05/08/2015在上海/","text":"2015年下半年我都待在上海，从学生转向职场，颇多艰难。所见所闻，偶有所感，遂记之。 越老感悟越不同2016-01-03 生活就像强奸，既然反抗不能，那就安然接受！以前宅久了，出去到外面吵闹的地方，恨不得找个地缝钻进去不出来。觉得跟自己毫不相关，却打扰到我，真想呵呵这个世界一脸。那时候是真的抑郁，一点不与外界交流。现在反而觉得累了闷了就到那些吵闹欢快的地方去，虽然他们跟我还是一点关系没有，但她们有笑容，总是能感染到我。这之间主要的变化大概是从不闻不看到愿闻愿见。接受他们接受世界才能进一步热爱生活热爱世界。 上海初见闻2016-01-14 在上海待了几个月了，想聊一聊我眼中的上海。 刚来上海的时候也没什么了解，只觉得这是个高大上的地方，地铁都飞行于地面上，6的飞起。 后来住了一些天，发现上海原住民都会养宠物，并且喊狗狗是宝宝。对待狗都像自己儿子一样，比如会给狗擦屁股。。 还有就是这边的小吃路边摊一些门店都是泛中原籍人民经营的。操着一口中原官话，我听着都很熟悉。也不是上海，大江南北到处都有，毕竟赶上改革开放，中原人口庞大就都往东南方向谋生去了。就跟你在珠三角感觉云贵川湘人多一样。 后来领略到上海房价之贵，郊区也都200多w，感觉把自己一辈子都卖给上海也怕是难买套房住下来。 物价还好，住也不是很夸张。之前看到一朋友转载的一文章，说在上海，月薪8k勉强自给自足，我感觉也没有说的那么夸张。 听人说北京这地方工作区跟生活区挤在两大坨，然后每天大家都往一个方向去上班，又同一个方向下班。所以地铁特拥堵。上海倒是还好，因为工作区是呈星射线型向四周扩散，除了市中心哪一环比较挤，其他地方还好的。 就说我去过的几个区吧，首先浦东这地方真的是有点人少，除了一些大型的工作园区，更多看到的是宽阔的马路，爽朗的天空。仿佛远方的大海就在不远处一样。说到工作园区，那真的是一个挺让人向往的地方，因为这是一个成熟的生活园区。你在这上班，我有丰富的餐饮大楼，娱乐放松大楼，保证你不会枯燥。 往南到闵行奉贤过，那边儿主要的感受就是人多，主要的居民区居住区挺多，但是那边美女也蛮多的，哈哈。 市中心以及浦东的高科技公司较多，但是市中心也是参差不齐，也有破烂的小作坊，也有高大上的甲级写字楼。总之浦东是一个可以向往的地方。 地铁非常发达，基本上你要去的地方90%都是用不着在做公交车的。就说有的时候你要转个线，经常直线下降几十米都很正常。不知道在重庆的朋友会不会打我。 再有就是公交，有的郊区蛮乱的说，不是自动售票。浦东的就很好，会用三种语言播报，普通话，上海话，英语都来。我还学会了说谢谢，上海话说听起来和“下压”差不多。哈哈 还有就是嘉定，那地方，空旷风大，人流多，吃的地方少。就不要去喝西北风了哈 雁栖之地-江湾新城2016-01-15 也许以后少有机会写东西了。行万里路，读万卷书。所见所闻，群像百态，皆可成文。 昨天去了江湾新城，发觉虽然浦东空旷和大气，江湾这地方一点不输。江湾是孤傲中掺杂些许自然。 我有说行走在江湾的大路上，想起来九峰山骑行的豪情。九峰山真的有九座山丘，在金华，九峰山还有水上乐园，是个生态旅游景点。当年去九峰山一路上人烟稀少，只有一条孤寂的道路绵绵不绝，望不到尽头。路上草丛中偶尔还会出现坟茔。浙江地区有种特色，往往在路边会见到墓碑和一些供奉拜祭的器具，或者还会有残留的香线，你这也是我当年夜间骑行所忌惮的东西。放哪儿不好，把墓碑竖在路边这样真的好吗？ 在去园区之前，遇一溪流。这并不足奇，吸引眼球的是岸边垂钓者众多，细下心来去数钓竿，两边栏杆加在一起足足有20有余竿。这种地方，高楼林立，水那么黑，会有鱼？还真的有，我观察他们放鱼的水袋子中大鱼小鱼全有，真是个宝地。鱼儿游得过来，说明生态还没有破坏。凭栏望去，什么！还有鸭子水中游，河边草丛深，申延入河中，鸭子的身影渐渐隐没其后。驻足又有片刻，成双的白鸥从我头顶飞过，目光追随它们身影，触到斜射过来的阳光，乃止。 有如此景色，传说中的湾谷科技园又如何呢。大，非常之大，大到我不知道它会有多大。a但是由于刚刚开发完毕，很多大楼没有入驻的公司，空空如也。但是这不要紧，交通方便啊，虽然没有直达的地铁。但是园区自己有公车啊，只会往返两个站点，从附近的地铁站到园区只要10分钟。我是已经心向往之了。 今天也去了个地方，有可说道之处。徐家汇常熟路附近几条街大概是老外的生活圈子吧，走在路上一半都是歪果仁。还有一对歪果仁哥们骑三轮车卖鞋子，丰富了我的眼球啊。 最近读了个历史推理文集，三国谜案，颇有新意。除了一些悬案诸如邓艾昭雪之难、司马断嗣、东吴二宫并阙、血衣带诏、李严废黜通过史家隐笔给出合理推测，历史是任人打扮的女孩。关键是洛神密码的推理真有让人讶异的地方。洛神密码的主角不是甄宓不是曹植也不是曹丕，而是曹彰！作者甚至推测出曹睿是曹彰跟甄宓的儿子！曹植的洛神赋写的是曹彰！真的新颖地值得一看。 转眼还有三周就过年了，以后也少有机会读一些杂谈之类的东西了，岁岁少，岁岁少！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"侧耳倾听","date":"2016-05-06T15:54:04.000Z","path":"2016/05/06/侧耳倾听/","text":"世界上有两种人，一种是喜欢宫崎骏的人，另一种是不知道宫崎骏的人。 偶然翻阅别人博客，看到有讲到久石让in武道馆的演奏会，据说很震撼，于是去看了下。果然，1200人的演奏团，各种乐器眼花缭乱，据说是世界上最大的音乐会。 完了又去看了映像宫崎骏的介绍,又稍稍加深了对宫崎骏动画的认识。之前看了很多部，除了看完之后很震撼，其实是没看懂。也去翻阅豆瓣评论，试图找找这些电影都讲得什么涵义，不过一时难以体会。 侧耳倾听最早了解宫崎骏都是在各种碎片信息中，就知道有这么个动画大师，由于愚昧无知的原因，觉得动画片是不是有点low，就没有去看了。直到后来有个同学在QQ空间说看了千与千寻感动的不要不要的，才有意识的想去也看看。 再后来关注豆瓣之后，有个妹子在那讲失恋后，每次觉得坚持不下去了，就去看侧耳倾听，就会重新充满力量。我就去看了，第一次看了3遍。第一印象就是白活这么大了，要是早一点看到这个电影的话，也许没有后来的种种的幼稚。然后我就被颠覆了。 侧耳倾听讲单纯的初恋，互相的鼓励和成长。要是早点看到，就知道原来喜欢一个人可以一起成长的嘛。初中的月岛雯问她姐姐自己的前途，高中的天泽圣司是个会制作小提琴的高手，却说像我这样的水准到处都是，梦想成为工匠大师。月岛雯哭着说，你们走的太快，我跟不上。全片充满治愈，各种感动。看完之后就觉得自己通透了，有些东西想的明白了，这也是这个电影于我的意义。 宫崎骏电影一发不可收拾的继续看下去。风之谷的娜乌西卡人与自然、战争与和平。幽灵公主人与神。龙猫5岁小孩必看。哈尔的移动城堡、千与千寻10岁女孩看得，奥斯卡获奖的。天空之城经典纯音乐的出处。大概就是心灵得到了净化，祛除了很多戾气。变了，变得跟以前不一样了。当然这些电影不只是给小孩子看得，因为主人公实质上都是过得是成人生活，她们独立勇敢而又善良，努力热爱生活，能领略到的。 当厌倦了生活，感觉坚持不下去了，不妨看看宫崎骏，满满的治愈。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"春秋战国：一段你应了解的历史【春秋篇】","date":"2016-05-04T15:16:32.000Z","path":"2016/05/04/春秋战国：一段你应了解的历史【春秋篇】/","text":"春秋有几霸春秋五霸有不同的说法，三种主流的说法涉及人物有八个人，读完春秋史我觉得真正名副其实只有3个人。齐桓公 晋文公 和 楚庄王。 小霸郑庄公平王东迁开始首先有所作为的是郑庄公。郑庄公是个能人，先是打败他妈喜欢的他弟弟郑段，军事外交内政用人能力都很强。以至于可以欺负卫国 宋国 等实力相当的国家。军事上发明鱼丽阵，擅长使用谋略，比如伏击等不合周朝军礼的手段。最牛逼的作为就是打败周天子的王师，对历史进程影响很大。死后子辈争位，郑国渐渐威势渐失，郑国后来沦落为二流国家。并没有称霸之实，只是使郑国成为中原诸国中最强的一国。 首霸齐桓公齐桓公吕小白确有称霸之实。而且使用的方法是尊王攘夷，使用道德感化的方式让各国心服口服，情愿尊齐国为领袖。吕小白线索里最重要的莫过于管仲，管仲是个神人各方面才能都很优秀。带领齐国改革，富国强兵。吕小白能耐不大，从他晚年不是英雄的惨死就看的出来，但是他从谏如流，恢弘的气度，不是常人可比。在位期间使齐国国土面积扩大，亲身两次北上攻打蛮夷，深入不毛，九死一生。并且把打下的蛮荒之地转手送给了当时弱小的燕国。这也是为什么燕国后来可以跻身战国七雄的重要原因。谥号桓，伟大的君主。晚年没了管仲他竟然被儿子饿死。死后诸子争位，齐国内乱，从霸主地位跌落下来，但仍然不失为一流国家。 虚名霸主宋襄公宋襄公纯熟扯淡的虚名霸主。宋襄公的偶像是齐桓公，所以就做了一个满口仁义道德的君子。只会仁义道德没有强大的国力或者过人的能力是不可能做到齐桓公那样的。打仗败给楚国，搞会盟想做老大还被楚国人抓了。他有个弟弟宋目夷倒是有点能耐的，多次在关键时刻提出正确的想法，但宋襄公一心要做君子，不采纳。所以宋国始终就是二三流的水平。 传奇霸主晋文公晋文公重耳是个传奇霸主。他老爸晋献公是个猛人，一生灭国18。重耳因为骊姬乱政的原因逃亡国外，一逃就是19年，流亡各国，受尽磨难。始终跟随他逃亡的7个人当中有后来赵国的先祖，魏国的先祖。还有寒食节纪念的人介子推。这场逃亡是个传奇，更是奇迹。后来终于在秦穆公的帮助下回国当国君。再后来在城濮之战退避三舍打败楚国，一跃成为执天下牛耳的超级大国。真正意义上的称霸。但后来晋国公族大权旁落，被六卿架空，最终分裂成三晋。重耳本人就是个牛人，人格魅力很大，才会有那么多人帮助他。重耳之后直到三家分晋晋国都是与楚国并列的超级大国。 楚庄王一鸣惊人楚庄王熊侣。楚国是蛮夷之国，所以敢称王。因为在南方的广袤土地上当时并不开化，国土面积越打越大，不遵守周礼所以随意攻灭小国。楚庄王上台之初楚国奸臣当道，所以他把自己伪装起来，伪装成一个不理朝政的昏君来看清谁是忠臣谁是奸臣。终于三年之后一鸣惊人，任用贤良打击奸臣。整肃内政。任用孙叔敖等人，在重耳死去之后与晋国的邲之战打败晋国，使楚国成为与晋国相当的超级大国。 西戎霸主秦穆公秦穆公嬴任好。嬴任好求贤若渴，用5张羊皮得到百里奚。百里奚又推荐蹇叔。秦国在西部边陲待腻歪了就想争霸中原。首先就是挡住东出之路的晋国，于是嬴任好就想通过控制晋国，好借路东出。后来才有了他护送重耳归国的事情。但是重耳不是池中之物。晋国强大了，秦国没有半点好处。后来晋秦合围郑国，就有了我们以前学过的烛之武退秦师这篇文章。再后来嬴任好打算飞夺郑国，一意孤行，1万人被翻脸的晋国在崤之战全歼。嬴任好东进不成，之好去打西戎，被周王封为西戎霸主。算不上真正的霸主。 吴王阖闾吴王阖闾吴光。吴国，一闪而逝的春秋巨星。晋国是吴国的同盟，派人教吴人中原先进的技术，让吴人骚扰楚国。吴光得到伍子胥的帮助，派遣专诸刺僚，通过政变的方式当上吴王。又有孙武的帮助富国强兵，吴光本人也勤俭节约。后来终于征集3万人打入楚国本土，柏举之战3万打20万大胜楚军，攻入楚都郢城，声震天下。楚国反扑才退兵。此后吴国修养生息，直到夫差上位打败越国，又开始北上争雄，后来黄池会盟达到可以与晋国平起平坐，但此时越国已经偷袭吴国，吴国就在此后数年灭亡。吴国虽然闪耀一时，但是却又瞬间灭亡，也算不上霸主之实。 越王勾践越王勾践。勾践早有范蠡和文种辅佐，但是越王不听劝谏，终于引来兵败被围。又因为有范蠡和文种，他才选择为吴王奴。越国只被允许有3000甲士防卫之用。勾践及范蠡都去吴宫做奴隶。忍辱负重三年，甚至去尝吴王大便，才换来夫差的信任被放回国。回国后卧薪尝胆，依靠伐吴九术，以身作则与民同苦，又靠越女剑和进献西施终于在吴王将兵在外偷袭姑苏城得手，之后奋战数年才灭亡吴国。但是勾践只是做到灭亡吴国震动天下，没有名副其实的去争霸。但他的传奇经历也足以是他成为春秋时代的巨星之一。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记01【青年节】","date":"2016-05-04T13:30:07.000Z","path":"2016/05/04/日记01【青年节】/","text":"央视新闻说青年节放半天假，14-28周岁都放假，不过跟我们没有关系。51回来之后事情好多，有点忙不过来。在淘宝淘了些东西，都是从知乎上看来的。 淘宝购物清单 桌上书架 很笨重，益乐新村快递站点真是少，就几个通，韵达，天天等有站点。他们给我用的宅急送，真是醉了。然后送到公司，拖回来感觉手臂都不是我的了，十几公斤重啊！ 鞋架 现在淘宝卖的都是有遮尘布的,挺好的。 脏衣袋 实用 台灯 省电护眼用的，当初来住的时候，匆忙就决定了，桌子不舒服，凳子不舒服。想要自己添置，空间又太小。打算等房东装修好4楼，上去住了，房子一定要大一些才行。 所思与所想书读不完，总是想着买书。比如重新学C语言,再看看算法。又想着要看一下数据科学与Python,还想买一些闲书看看。现在真是后悔大学那么好的时光没有做点有意义的事情，最起码读点书唉。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]}]