[{"title":"计算机是怎样跑起来的【计算机知识大纲】","date":"2017-03-09T22:51:58.000Z","path":"2017/03/10/计算机是怎样跑起来的【计算机知识大纲】/","text":"知识点 GBK字符编码，汉字占用2字节。UTF-8，3个字节。 硬件由大量IC(集成电路)组成，上的引脚，有的用于输入，有的用于输出。 编译：把编程语言编写的文件(源文件)转换成机器语言编写的文件。 .NET是微软提出的技术。 2种编程方法：面向组件编程、面向对象编程。 GUI(图形用户界面) 算法 字符串的末尾用0表示，链表的末尾用-1，这些特殊字符是哨兵。 辗转相除法，机械求解最大公约数。2种方式，减法和除法。减法：2数中大数减去小数，直到两数相等，相等的这个数就是最大公约数。 典型算法。 名称 用途 辗转相除法 求最大公约数 埃拉托斯特尼筛法 判定素数 顺序查找、二分查找、哈希查找 检索数据 冒泡排序、快速排序 数据排序 最小公倍数。2数乘积除以最大公约数。 埃拉托斯特尼筛法，用待判定的数除以比它小的所有正整数，余数为零，可以整除，不是素数。利用的是计算机的处理速度，同样适用于计算鸡兔同笼问题。 执行时间短的算法更优秀。如，判定素数，只需要从2到待判定数的平方根即可。 线性搜索，从头到尾依次查找。哨兵，多用于此。加个特殊元素，减少判定次数。 数字间的规律，如石头剪刀布游戏判定输赢，0、1、2表示三情况，B+1除以3的余数与A相等，就是B获胜。 数据结构 栈和队列，栈存取形式是LIFO(后进先出)，队列是FIFO（先进先出）。 每个存储单元，8比特数据。 数组应用于线性搜索、冒泡排序。 123456789for (i = 999; i &gt; 0, i--) &#123; for (j = 0, j &lt; i, j++) &#123; if(x[i] &gt; x[j]) &#123; tmp = x[i]; x[i] = x[j]; x[j] = tmp; &#125; &#125;&#125; 典型数据结构 名称 特征 栈 小山堆积一样 队列 排成一队 链表 任意改变数据排列顺序 二叉树 把数据分为两路排列 二叉树是链表的特殊形态。 数组可以转化为栈或队列。 栈需要一个数组，一个变量。变量是索引，指向栈顶数据，是栈顶指针。数组、栈顶指针、入栈函数、出栈函数组成了栈。注意：栈顶指针指向的不是栈里顶端上的数据的地址，实际上是这个数据上面的地址。 1234567891011121314char Stack[100];char StackPointer = 0;/*入栈函数*/void Push(char Data) &#123; Stack[StackPointer] = Data; StackPointer++;&#125;/*出栈函数*/char Pop() &#123; StackPointer--; return Stack[StackPointer];&#125; 队列。数组、存放队头数据索引的变量、存放队尾数据索引的变量、存取函数。尾部存储满到最后，会折回数组的开头。逻辑结构变成圆环，循环利用。 123456789101112131415161718192021char Queue[100];char SetIndex = 0;char GetIndex = 0;void Set(char Data) &#123; Queue[SetIndex] = Data; SetIndex++; if (SetIndex &gt;= 100) &#123; SetIndex = 0; &#125;&#125;char Get() &#123; char Data; Data = Queue[GetIndex]; GetIndex++; if (GetIndex &gt;= 100) &#123; GetIndex = 0; &#125; return Data;&#125; 链表。c语言中用自我引用的结构体组成的数组表示链表。 123456struct TestResult &#123; char Chinese; char Math; char English; struct TestResult* Ptr;&#125;; 二叉树。有2个自我引用结构体的链表。用于搜索数据的算法，如二分查找，更快。 1234567struct TestResult &#123; char Chinese; char Math; char English; struct TestResult* Ptr1; struct TestResult* Ptr2;&#125;; 面向对象编程 缩写为OOP。C++在C的基础上增加了面向对象的机制。Java、C# 是对C++进一步改良。 结构体，操作数据的函数在外部。而面向对象编程可以把函数也放在内部。技巧有封装、继承、多态。 面向对象编程和面向过程编程是一对反义词。 多态指的是，针对同一消息，不同对象可以进行不同的操作。 .NET支持C# 数据库 DBMS缩略语。一张表由行和列组成，列被称为字段、属性，行被称为记录、元组。 SQL，结构化查询语言。 关系型数据库。 客户端、服务端。 主键和复合主键(多个字段组成) CRUD.插入（CREATE）获取(REFER)更新（UPDATE）删除（DELETE） TCP/IP网络 LAN（局域网） 传输控制协议和网际协议(TCP/IP) MAC地址：网卡编号 WAN（广域网） 集线器连接计算机，路由器连接互联网。 以太网网卡 CSMA/CD 带冲突检测的载波监听多路访问，是连接LAN计算机的方法。多路复用，是多个设备同时访问传输介质。 MAC地址由厂商编号和产品编号组成，每个都独一无二。 IP地址是软件上的编号。TCP/IP中传输数据都要带MAC地址和IP地址。IP地址是32比特的整数，8个一组，分4段。IP地址的范围，0.0.0.0~255.255.255.255.前三段是网络地址，后一段是主机地址。子网掩码就是标识出网络地址和主机地址。子网掩码转换的二进制数中，值为1表示网络地址，0的表示主机地址。与MAC地址一样，IP地址也是唯一的。 DHCP（动态主机设置协议）服务器获取IP地址和子网掩码。 默认网关存放路由器的IP地址。 DNS(域名系统)，解析域名为IP地址的服务器。其中记录着域名和IP地址的对应表。 ARP（地址解析协议），把IP地址转换为MAC地址。使用广播的形式。也有缓存表，记录对应表。 IP协议指定目标IP地址和路由器转发。TCP协议是双方相互回应确认信号，可靠传输数据。称作握手。通过包这种数据单元。 MAC信息 IP信息 TCP信息 数据 错误检查信息 网卡-设备驱动程序-IP协议程序-TCP协议程序-应用程序。层级结构。 TCP端口号识别上层的应用程序。web使用80，发送邮件25，接收邮件使用110. 数据加密 秘钥，用于加密和解密的数字。 XOR，逻辑异或运算。二进制，同则0，不同则1. 对称密钥加密技术，特征是加解密密钥相同。密钥的通知不安全，不适用于互联网。 公开密钥加密技术。加密密钥公开，解密密钥私有。公钥和私钥。 RSA，实现公开密钥加密技术的算法，三个字母代表三个三个发明者。 数字签名。MD5,信息摘要。 XML 可扩展标记语言。元语言。 HTML，超文本标记语言。 &lt; &gt; &amp; “ ‘ 5个特殊字符用&amp;lt &amp;gt &amp;amp &amp;quot &amp;apos 表示。&lt;![CDATA[ ]]&gt; 括起来就可以直接使用上述5种特殊字符了。 表示注释。 W3C(万维网联盟) CSV，只记录了信息，没有给信息赋予意义，比XML差一筹。 XML命名空间。xmlns=命名空间 的形式。 SOAP（简单的对象访问协议）用于分布式计算。分布式就是把程序分散在网络连接起来的计算机上。","tags":[{"name":"专读","slug":"专读","permalink":"https://amasawaseiji.github.io/tags/专读/"}]},{"title":"情书","date":"2017-03-05T16:20:11.000Z","path":"2017/03/06/情书/","text":"真的很惭愧，直到现在才完整看完这部电影。 大学时代曾看过一点，只是没看下去。毕业后，偶然有个人谈论电影这个话题，他一定对这个电影非常喜爱，所以介绍起这个电影起来滔滔不绝。如今，我是在top250里再看到这个标签，才重新拾起。 微博上曾有过某中学发现学长藏在墙壁里的情书，火极一时。大家纷纷要找到那情书所说女主，找到后，女主表示都过去多少年了，早就忘记了。 我们欣赏那种美好，向往那种美好，尤其是暗藏的，更加稀有。因为我们都有过。这个电影表现出了那种美好，无论是景物、人物、所有的一切，它本该美好，又讲的是这种人人都经历过的美好的故事。足以载入影史。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记2【我不相信】","date":"2017-03-05T12:48:28.000Z","path":"2017/03/05/周记2【我不相信】/","text":"这周主要是工作上的问题，还有就是个人也有了一些问题，结果就是有点糟糕。 同桌走了去年来的实习生，坐我旁边的。周一突然说家里叫他回家，他女朋友也回去了，于是他也就要回家发展了。真是突然呢！ 工作困扰工作上呢，我主要问题就是业务理解能力不足，也没有技术架构能力。结果呢，有些问题我就无法彻底且妥善地解决。最后也就只有跟上级沟通，搞一些暂时做法。 优秀同事我有一个非常优秀的同事，就是那种大学里是学霸的那种。他业务能力很强，工作极其认真。有时候就感觉我跟人家有差距，有些不服气。换个角度，这其实也是提升自己的一个榜样，多跟人家交流，紧跟人家步伐，这样的话自己差不多也会变得更优秀吧。 驾考这种自己的事一定要自己积极一些，要不然，考试的人那么多，排队排到黄花菜都凉了。 关于读书这两周，确实读了挺多书。但是呢，都是杂书，我想以此为引子锻炼一下状态，接下来开始真正的学习。所以接下来就是读专业书，专业学习为主了。还有读书的方法，不同的书应该有不同的读法。小说就通读一遍，结论性的书应该做记录笔记。 效率意志我发现上周这方面还挺好的，这周明显有下滑。主观认为这跟我三分钟热度的性格有一定关系，凡事没能坚持多久，去年就是这样。容易心有杂念，就坚持不下去了。周末更是，干脆一整天都在刷直播。完了又开始懊悔，进而产生极大的负能量。这种情况周而复始，人就被拖垮了。关于效率和意志，真的要找办法好好治治了，要不然就如上瘾一样，一点点蚕食，最后人生就这样虚度了。这是下周首要需要解决的课题，目前只想到读一些诗或许能缓解一些。 北岛的诗，作为结语。 告诉你吧，世界 我–不–相–信！ 纵使你脚下有一千名挑战者， 那就把我算作第一千零一名。 我不相信天是蓝的 我不相信雷的回声 我不相信梦是假的 我不相信死无报应 如果海洋注定要决堤， 就让所有的苦水都注入我心中 如果陆地注定要上升， 就让人类重新选择生存的峰顶。 新的转机和闪闪星斗， 正在缀满没有遮拦的天空 那是五千年的象形文字， 那是未来人们凝视的眼睛 。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"恶意","date":"2017-03-04T13:22:17.000Z","path":"2017/03/04/恶意/","text":"本来不打算再写一篇的，因为相较于嫌疑人、白夜行还是有差距的。但是可能接下来不会再读东野的书了，就对东野圭吾做个总结吧。 最初只看过电影嫌疑人x的献身，当时震撼挺大的。后来一个同学对嫌疑人的电影的评价，让我回忆起这个故事，于是买来实体书来看了。迅速读完，只是对于已知的故事，震撼没那么强烈了。 后来恰巧有 kindle 购书券，就一下买了解忧杂货店以及白夜行。先读的白夜行，是在一个假期读的，读完我就认定这本是我当年度读的最好的书了。就像评语说的，《白夜行》中的爱情极度炽烈，令人粉身碎骨。我认为则是，读完之后有种貌似读完的感觉，好像什么都没太说清楚，但其实已经说清楚了，给人以莫大惆怅感的结局。甚至需要一些时间来平复这种震撼的心情。 解忧杂货店，可能阅历不够，读不出太深层次的意思。 今天又读了一本东野早期作品，就是这部《恶意》。相较于《白夜行》、《嫌疑人》差了些，读完也没什么想说的。 对于作者东野圭吾，引用一段我也生以为然的评语作为评价。 后期笔锋越发老辣，文字鲜加雕琢，叙述简练凶狠，情节跌宕诡异，故事架构几至匪夷所思的地步，擅长从极不合理之处写出及其合理的故事，功力之深令人瞠目骇然。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"向前一步","date":"2017-03-03T12:54:37.000Z","path":"2017/03/03/向前一步/","text":"作者是 Facebook COO（首席运营官），1969年生，成功女性。 才意识到这类讲观点和经验的书是要做读书笔记的，不然看完差不多也忘完了。好在中途也开始了一些摘录。 不自信时，假装自信。 征求他人的建议有助于人际关系的建立。 分享自己的情绪，有助于建立更深层次的人际关系。（深表同感） 如果一个等着别人来告诉你应该做什么，就不可能成为领导别人的人。 只谈公事并不总是最佳的工作方式，将工作和生活完全分离就没什么意义了。不要害怕工作时谈起家里的私事。（又上了一课） 真正的领导力来自真诚的表现，以及不太完美的个性。 一个人对自己的工作越满意，就越不可能辞职。 如果你想要一位能平等相处的伴侣，那么从一开始就要建立平等的关系。（有用） 我们创建的家庭模式其实根植于童年的记忆。 完成，胜过完美。（作者座右铭，也对我启发很大） Facebook初创时期，天天晚上黑客长跑大赛。扎克伯格本人是个夜猫子，难怪有人说他睡觉都在编程。 成功是为自己做出最好的选择，并且接受它们。（独到的见解） 准时下班回家是件很重要的事。（有启发）","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"富爸爸穷爸爸","date":"2017-02-28T17:42:56.000Z","path":"2017/03/01/富爸爸穷爸爸/","text":"一本颠覆思想的财物启蒙书。对于一个小白来说，书中提到的很多观点是具有颠覆性的。以下仅记录我从中领悟到的。 努力学习，找一份工资高的工作，努力工作。这种模式犹如老鼠赛跑，很难从中跳出。不能为钱而工作。 理解资产和负债。增加资产，减少负债。按揭买房是一大负债。分期付款、信用卡都是。 除了职业，还应拥有事业。事业是资产项，资产产生收入。 财商包含会计、投资、市场观察力、法律知识。 投资自己的头脑，不应只了解一个专业技能，不断学习新东西。克服懒惰，自律。 这本书算是启蒙书，给你提供一种新思路。并且年龄越小的孩子读这本书收益越大。大人读由于丧失一些优势或者固有观念难以改变效果大打折扣。 仍然有一些指导性的东西。比如对于现阶段的我，应该怎么做呢。首先需要攒一笔资金，这需要适当的消费观念。同时学习财务方面的专业知识，再开始投资。再然后，不断用钱赚钱，开公司，实现财务自由。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"影视书（2017）","date":"2017-02-26T14:59:12.000Z","path":"2017/02/26/影视书（2017）/","text":"电影 序号 片名 上映时期 豆瓣得分 影评 1 勇敢的心 1995 8.8 95年的水平，相当震撼了。以及对于苏英战争欧洲史的一点开荒。 2 七月与安生 2016 7.6 实话说，有点强。周冬雨演技爆表了。 3 星球大战外传：侠盗一号 2017 7.4 这电影看的，全程一半在睡觉。如无装逼需求，弃坑。 4 西游伏妖篇 2017 5.8 春节档的商业片，经典的配乐还能唤得起多少情怀 5 面纱 2006 8.2 06年西方人到中国拍的电影。吕燕真是丑的可以，西方人反以为美？当爱与责任合二为一，恩典便与你同在！结局也是现实中正确的结局。 6 奇迹 2011 8.6 看完小说再看电影，总觉得哪里不够。文字传达的东西比影视信息量大吧。 7 阿甘正传 1994 9.4 人生是由命运和偶然共同构成的。影评 8 比利林恩的中场战事 2016 8.5 没经历过战争，无法理解他们。比利数度落泪，为自己也为他的宿命。影评 9 步履不停 2008 8.8 关于家庭、关于生死，淡淡的、安静的、细腻的体会感知。多珍惜与亲人在一起的时光… 10 如父如子 2013 8.3 怎样为父，未来的课题。我还是喜欢这样的讲好故事的是枝裕和。 11 情书 1995 8.8 揭秘暗恋。影评 12 言叶之庭 2013 8.2 快去看豆瓣有用最高的长评论，笑疯！ 13 无人知晓 2004 8.9 生命的悲壮 书籍 序号 书名 豆瓣得分 书评 1 你一定爱读的极简欧洲史 8.3 从另一个维度解读欧洲史，但也多是对中学历史知识的一点回顾。书评 2 奇迹 7.7 最初怀着美好的愿望制定目标，阻挠总会如期而至。但要相信，当你达成目标而收获的绝不仅仅是当初的那点愿望了，会有很多很多收获！致敬那些为目标百折不挠奋斗的人儿吧，因为那才是真正的勇者！书评 3 国境以南太阳以西 8.4 文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。书评 4 追风筝的人 8.8 无愧为文学的经典之作，大学图书馆里借阅榜榜首。一份愧疚，一场救赎，一丝悲悯。书评 5 皮囊 7.8 这是一本凑出来的书，写家人可以打9分，写家乡让我想到草房子，写朋友就真的是过目就忘了。总的来说，及格以上，上乘不达，比刘同强。书评 6 富爸爸穷爸爸 8.2 提到的很多观念对于一个完全没有财商的小白具有颠覆性，不错的启蒙书。说从中学到具体的知识，还是没有的。书评 7 向前一步 8.1 虽然主要是讲女性职业发展和女权的，但还是从中学习到一些关于职业职场的有效方法。书评 8 恶意 8.4 天王套装第四本。开头和结尾精彩，手记体写法也很惊艳。过于注重推理和技巧使得真实感不强烈。关于主题所说的那种恨意体会不来。书评","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"周记1【完不成的目标】","date":"2017-02-26T09:53:05.000Z","path":"2017/02/26/周记1【完不成的目标】/","text":"日记太繁琐，周记则恰好。记录一周思考，这是第一篇，还是说一下（笑）。 制定计划开始只是有一个大目标，没做具体的细化。直到看到了一个极度自律的人写的一篇血泪日记，为了完成每日目标，半夜也要完成。就开始细化每日目标了。使用贴纸写下月度计划，每天晚上回来再日记本上写下日计划。算是开了头。 估算时间计划写得太满，导致完不成。因此，制定计划时，准确预估完成所需时间格外重要。 安排顺序有时候顺序不对，就完全打乱了一系列计划，制定计划和实施时需要随机调整，以免某个时间段无法完成特定任务而打乱一切。比如，跑步不能安排在吃饭后吧。 调整作息规律过去一周这个问题是最大的问题。现在已经昼夜颠倒了，怎样在指定的时间睡觉，已经成了困扰我的问题。希望下周能调整一些。 心事打断我想我错了。春节回家被家人灌输了一定要找对象的观念，导致我真的以为我需要找对象了。回来为此苦恼很久，怎么找对象困扰了我。后来我终于想起了之前看到的一些文字，在拥有爱的爱的能力之前，找什么对象。我想也是，当我拥有除了照顾好自己还能照顾另一个人的时候，我再考虑找对象的事吧。 迷茫了就去读书一切迷茫，不知所措，都是因为知道的太少而想的太多。多读书，广泛读书，总会找到适合你的那本，打动你，给你方向的书。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"少年锦衣卫","date":"2017-02-26T09:09:32.000Z","path":"2017/02/26/少年锦衣卫/","text":"三维动漫，比不良人还要用心啊，剧情目前看起来也挺好啊，没有不良人略显狗血的拖沓啊。已经超越不良人了，建模真是美哭，国漫新扛把子。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"皮囊","date":"2017-02-26T07:58:14.000Z","path":"2017/02/26/皮囊/","text":"每个读者只能读到已然存在于他内心的东西。书籍只不过是一种光学仪器，帮助读者发现自己的内心。 不可否认，这是今年读到的第一本触动我的书，或者说感受到的共鸣更多。这本书也有很大的毛病，后面的内容水平直线下降，甚至看到后面我联想到了刘同。刘同的书借用一个网友的评论就是“妈妈给的零花钱又被骗了”这种感觉。虽然有毛病，但是这本书还是值得看的，哪怕你只看一半也可以。 首先刺痛我的是，作者嘲讽那些在大城市打拼，跟老家的人产生了隔阂，已经回不去了的那些人。说他们是无家可回孤魂野鬼，庆幸自己还有家。然后作者着力想表达的是，我们这代人，从小镇到县城到地级市到大城市，慢慢的失去了家。呼吁我们小镇才是生我们养我们构成我们的家。作者最后说，我们都是既离开了家，又无法到达的人。我想，我们这代人是城市化进程的结果，城市化也是构成我们的一部分。我们想回到过去，谁不想呢，这也是无奈的事情。也许家里的事情于我们已变陌生，但我们终归还是拥有家人、亲戚，只要我们时常回去走走，即便是在陌生的城市，也不一定就是失去了家。 当作者写到闽南的乡土情怀时，我联想到了曹文轩的盐城农村，蒲松龄的山东，透过文字传达的家乡记忆，也足以令人动容。比如，作者说他们那拨人是晋朝时迁过去的，至今还保留着很多风俗，封建理想也根深蒂固。瞬间觉得自己这种明代山西迁往淮河流域的人，流传下来的文明简单的可怜。 作者由于家庭原因（父亲中风），早早担负起一家之主的责任，在大学时代就成熟老道地规划好了自己的人生。读到这里，令我汗颜，想到自己直到大学毕业依然迷茫不堪，没有任何规划。不得不感叹家庭对于塑造子女影响巨大。当然，健康家庭出身的孩子也相对来说更比较不会有心理创伤，谁又能说哪样的结果更好呢。 最令我感动还是作者描写的关于阿太，母亲，父亲，他的家人。这也是全书的精华，一个艰难家庭更容易催生出坚固的亲情，当然这也是人为努力的结果。毫无疑问，作者笔下的母亲是一位伟大的母亲。关于后半部分写到朋友、发小等，批评的人批评过了。我觉得这还是跟作者有关系，急于成名了，内容难免良莠不齐，或许这也跟作者心理创伤有关。现代大部分人都多少有心理问题。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"比利林恩的中场战事","date":"2017-02-24T15:11:16.000Z","path":"2017/02/24/比利林恩的中场战事/","text":"一部描述美国真正的参战士兵心境的电影。 在美国，有很多参战过的士兵，患有跟战争有关的心里疾病，称为战争后遗症，没参与过战争的人无法理解。 比利林恩数次落泪，因为他通过短暂的中场休息，看清了自己和这个国家的本质，看清了人们无法理解自己，看清了宿命。透过他的视角，是否能让人们能反思战争。 附上片尾音乐。","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"追风筝的人","date":"2017-02-24T14:17:18.000Z","path":"2017/02/24/追风筝的人/","text":"经典无愧为经典。 早在我大学时代，这本书长期是学校图书馆里借阅榜第一。去年在朋友圈里看到一个朋友发的出自书中的一句话。 我看见镶木板的墙上挂着照片，照片中的人都将成为我的亲人。 配文：阿米尔到索拉雅家中提亲。那时我便将书购来，拖了很久，终于看完。 之所以没能一气呵成读完，我认为是这样的原因。前面部分描述的一直是安静祥和的小孩之间的真挚友谊，虽然处处预示着将会发生悲惨的事情，但着实是陌生的另一个国家的事情，难免让人感到晦涩、不理解。直到某次乘车途中，读到了发生的那件惨事，一发不可收拾读到大半。再后来，当我把此书列入计划中，方才读完剩下的部分。最后一部分，本来看得我觉得这书可能也就中上水平了，没有传说的那么神，但是后面纷至沓来的一波高潮，改变了我的看法，这本书是实至名归的上上之作。 我庆幸自己有足够的理解能力，能读到书中想表达的东西之一，人性。 没有良知、没有美德的人不会痛苦。 我想我们普通人都是有良知、崇尚美德的人。我们想努力弥补的都是我们愧疚的东西。诚然，有的人面对愧疚，选择逃避。但是，这种人内心深处是有创伤的，他/她们的灵魂是不完整的，当他/她们遭遇不幸，他/她们是容易怀疑人生的。敢于弥补愧疚的人都是勇敢的人，当他/她们完成赎罪，伤口会自愈、灵魂会完整，也便活出了人生的最高境界。 而是对生活曾有过的黑暗忍气吞声的照单全收。 哈桑、索拉博、无数承受战火的阿富汗人，作者还表达了悲悯。哈桑忍受着一切，哈桑依然是那个深爱着阿米尔的哈桑，就像他热爱生活一样。当你经历过地狱，并且从那里走出来，你将无所畏惧。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"阿甘正传","date":"2017-02-22T14:37:36.000Z","path":"2017/02/22/阿甘正传/","text":"印象中这是一部励志电影。 以我粗浅的阅历来看，美国的励志电影中的励志跟我们印象中的励志是不一样的。通常关于刻苦、努力啊基本不说，说的多的往往是运气或者天赋。这类电影通常更多的是探讨生命的意义，你要说它是励志电影真的是不走心。这是一部探讨残障人士的生命的意义的电影。 电影中有一段台词可以作为点睛之笔，摘录如下。 是否我们每个人 都有注定的命运 还是我们的生命中只有偶然 像在风中飘 但我想 也许两者都有吧 也许两者都同时发生着 我们每个人都有着好的或者不好的命运，但人生仅仅是这样吗？不是啊，还有偶然，就像那片随风漂浮的羽毛，时而扬起，时而下落，最终还会落地。我们能做的只是在风雨中承受着这一切，就像詹妮像鸟一样飘零、中尉在飓风中咆哮、羽毛飞舞…","tags":[{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"国境以南太阳以西","date":"2017-02-20T14:26:18.000Z","path":"2017/02/20/国境以南太阳以西/","text":"文学家40多岁创作的作品，我又能读懂几分呢，太深刻而无法评价。 借由其中一首歌在网易云音乐上的热评剧透作为读后记吧。 结尾泉的出现更让我觉得岛本或许真的就不存在。从国境以南来，到太阳以西去，可能岛本只是初一厢情愿的幻象吧。不得不说，初活出了大部分人的理想，有一个带你尽人事尝甘涩的初恋，有一个陪你立黄昏问你粥可温的爱人，有一次让你甘愿放弃一切的精神出轨，有一次回到现实却无奈下半身的肉体出轨。 附上书中反复提及的钢琴三重奏。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"半世伶俜空自许","date":"2017-02-19T13:15:39.000Z","path":"2017/02/19/半世伶俜空自许/","text":"读史使人明智，读诗使人灵秀，数学使人周密，科学使人深刻，伦理学使人庄重，逻辑修辞使人善辩，凡有所学，皆成性格。–培根 查阅寒伧（chen，同寒碜）时，相关词汇给到了伶俜（líng pīng），查伶俜看到了一首诗。 冰骨云绡雪数枝，清幽香冷与尘离。 深山有韵风摇影，古涧无人月弄姿。 半世伶俜空自许，一生风雨却谁知。 都言此萼非凡数，谁道花中最是痴。 这不是一首古诗，而是一位小才女写的诗。多好的诗啊。","tags":[{"name":"诗歌","slug":"诗歌","permalink":"https://amasawaseiji.github.io/tags/诗歌/"}]},{"title":"桃栗三年柿八年","date":"2017-02-19T06:43:14.000Z","path":"2017/02/19/桃栗三年柿八年/","text":"是枝裕和的风格就是讲述平凡的、淡淡的生活，讲述生活的本质。这个故事与电影海街日记一样充满温情。 小学生集体大出逃，7人和一只死了的狗，开始了一段冒险之旅，为了在新干线列车交错的地方许下愿望，让奇迹发生。 这是一个儿童题材的故事，火山灰、波斯菊、燃放的烟花、种子、生活中的一切事物，你喜欢也罢，不喜欢也罢，你通通要接受。生活也是一样，你也必须接受。 也许所谓的奇迹只是需要发泄而已。学会接受讨厌的事物，就是成长。 桃栗三年柿八年，达摩九年我一生。 书中出现的一句台词，原来是一句日本诗。人生需要时间的积累，才会开花结果。 小说是根据电影剧本写出来的，而电影是为了纪念九州新干线全线通车所拍的广告。你不得不佩服这位导演，一个广告电影，一个命题作文，选择了这样的题材，拍出了这样的作品，除了赞叹还能说什么呢。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"},{"name":"电影","slug":"电影","permalink":"https://amasawaseiji.github.io/tags/电影/"}]},{"title":"极简欧洲史","date":"2017-02-17T14:55:42.000Z","path":"2017/02/17/极简欧洲史/","text":"销量高不一定就好，充其量是对中学世界史的一点回顾。 副标题为为什么欧洲文明对现代文明影响这么深？我来回答一下这个问题。 因为欧洲工业革命，因为大航海，因为殖民。为什么欧洲能近代能够先崛起？因为科学的发展。为什么欧洲人能发明科学？因为欧洲古代有牛人，然后出现了文艺复兴。 这本书单只讨论了近代欧洲文明为什么能超越亚洲文明。给出的解释是：欧洲多国林立，强敌环饲，所以向海上扩张。王权为打压贵族，倚重商贾与科技。中欧一直小国并存，人才可以充分发挥才能，为文艺复兴打下基础。 从另外一角度讨论，中国历代关于科学的著述，偏向于经验总结。而欧洲则是科学方法论，欧洲有逻辑体系和实验方法2个方法论，这才是欧洲可以爆炸性增长的原因。 我们都知道古希腊罗马，罗马的灭亡是因为日耳曼蛮族入侵。蛮族在侵占的土地定居下来，罗马皇帝无地可辖所以才灭亡。所谓中世纪指西罗马帝国灭亡之后的一千年，日耳曼人建立国家，加入基督教，欧洲多国林立。 第二次入侵来自穆斯林，占领欧洲东部，跨越地中海控制到南欧的西班牙。所谓十字军东征即是征讨穆斯林，夺回圣地耶路撒冷。耶路撒冷是基督教发源的地方。 第三次入侵是来自北欧的维京人，维京人使用长船沿河掠夺，后来也定居下来。 英国原住民叫凯尔特人，日耳曼人、维京人入侵之后，才形成英语。 法国是由法兰克王国一分为三后才形成的。而另一支德国却很晚才统一。原因是教皇跟皇帝的争斗导致很分裂。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"马云山教练","date":"2017-02-17T14:36:54.000Z","path":"2017/02/17/马云山教练/","text":"又历时2天，终于可以写点了。这个主题不错吧！当然我没有功夫去学自己打造主题（摊手）。来不及了，车已经出发了。 马教练56岁，做教练20多年。很是健谈、做事麻利、头脑灵光、视野广阔、照顾后辈，当然这个年龄的人一般都会照顾后辈。 再谈公职人员态度。一个跟年期大妈一般态度恶劣，还是年轻好，对，年轻的好！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"日语50音","date":"2016-07-19T15:43:55.000Z","path":"2016/07/19/日语50音/","text":"a段 i段 u段 e段 o段 a行 a あ ア (阿) i い イ (伊) u う ウ (屋) e え エ (唉) o お オ (欧) ka行 ka か カ (卡) ki き キ (key) ku く ク (库) ke け ケ (开) ko こ コ (扣) sa行 sa さ サ (撒) shi し シ (西) su す ス (丝) se せ セ (赛) so そ ソ (搜) ta行 ta た タ (它) chi ち チ (七) tsu つ ツ (刺) te て テ (台) to と ト (头) na行 na な ナ (那) ni に ニ (你) nu ぬ ヌ (奴) ne ね ネ (乃) no の ノ (no) ha行 ha は ハ (哈,做助词读哇) hi ひ ヒ (黑) fu ふ フ (夫) he へ ヘ (海,做助词读唉) ho ほ ホ (后) ma行 ma ま マ (妈) mi み ミ (米) mu む ム (木) me め メ (麦) mo も モ (某) ya行 ya や ヤ (呀) i yu ゆ ユ (U) e yo よ ヨ (要) ra行 ra ら ラ (拉) ri り リ (利) ru る ル (鲁) re れ レ (来) ro ろ ロ (老) wa行 wa わ ワ (哇) i u e wo を ヲ (欧,只能做助词) ga行 ga が ガ (尬) gi ぎ ギ (给) gu ぐ グ (古) ge げ ゲ (改) go ご ゴ (高) ka行、浊音 za行 za ざ ザ (杂) ji じ ジ (鸡) zu ず ズ (孜) ze ぜ ゼ (在) zo ぞ ゾ (早) sa行 da行 da だ ダ (大) ji ぢ ヂ (鸡) zu づ ヅ (孜) de で デ (带) do ど ド (刀) ta行 ba行 ba ば バ (八) bi び ビ (比) bu ぶ ブ (不) be べ ベ (白) bo ぼ ボ (包) ha行 pa行 pa ぱ パ (趴) pi ぴ ピ (皮) pu ぷ プ (普) pe ぺ ペ (拍) po ぽ ポ (跑) ha行、半浊音","tags":[{"name":"日语","slug":"日语","permalink":"https://amasawaseiji.github.io/tags/日语/"}]},{"title":"明朝那些事儿4粉饰太平","date":"2016-06-25T12:21:29.000Z","path":"2016/06/25/明朝那些事儿4粉饰太平/","text":"年号表 年号 庙号 姓名 谥号 起止年 注 评价 嘉靖 世宗 朱厚熜 肃帝 1522-1566（45年） 谥号16字。正德帝朱厚照无子，由其堂弟朱厚熜继位。朱厚熜，朱见深之孙，朱佑樘之侄。朱厚熜父，朱佑杬，追封献帝，庙号睿宗。 始亡于嘉靖 嘉靖朱厚熜嘉靖帝朱厚熜是谁？我们都知道朱厚照无子，不光无子，连弟弟都没有。往上追溯，朱厚照老爹朱佑樘有弟弟吧，有。虽然万妃比较坏，朱佑樘侥幸活过来的，不过后来朱佑樘还是有很多弟弟的。有个弟弟叫朱佑杬，朱厚熜就是朱佑杬的儿子。正德16年4月，原住湖北安陆县的朱厚熜到达京城，此时的他只有15岁。刚到京城的朱厚熜就关于走哪条路到什么殿居住跟前来迎接大臣们产生了矛盾，大臣们要他走东安门到文华殿，此为皇太子所走路线，而朱厚熜要走大明门到奉天殿，此为皇帝所走路线。大臣们不让，朱厚熜表示如果不让，就打道回府，不干皇帝了，于是大臣们让步。从这一点就可以看出，朱厚熜绝非庸人。礼部尚书毛澄上书让皇帝尊孝宗皇帝为父，称其亲父亲母为皇叔考、皇叔母。于是朱厚熜找到杨廷和（时63岁）要给自己父母名分，杨廷和没有给他办。礼部小官张璁在翻阅毛澄奏疏时，发现了那篇给皇帝的奏疏，写就一篇文章支持皇帝给父母名分。大议礼开始，同时，朱厚熜亲妈也来了京城。杨廷和让步，给皇帝父母兴献帝、兴献后的称号，同时把张璁调到南京。还有一叫桂萼的也是张璁的拥护者，其背后有杨一清的支持。嘉靖2年，张璁攻击杨廷和，杨廷和主动退休。原因是真累了，要抽身。 杨慎杨慎，杨廷和儿子，正德6年状元。杨廷和走了，杨慎成了杨廷和那帮人的领袖，嘉靖3年，礼部尚书汪俊联合众文官上书反击。朱厚熜急忙召张璁、桂萼进京，汪俊见风使舵，愿意给加个皇字,变为兴献皇帝、兴献皇后。张璁进京，杨慎找人要在左顺门打死张璁、桂萼，但他们都逃了。郭勋，朱元璋时期郭英后代，郭英还有的优秀后代如土木堡时期的郭登。郭勋投机，成为张璁死党。众文官哭跪示威，要求诛杀张璁，重文官全部被抓，集体打屁股，死亡率达到12%，杨慎被流放云南，在那里，杨慎专心搞文学。嘉靖8年，杨廷和去世，年71。明代三大才子，解缙，杨慎，徐渭。杨慎排第一，比如三国演义开篇的滚滚长江东逝水那首词就是杨慎写的。嘉靖38年，杨慎去世，年72. 张璁张璁想要入阁，但是他确实没资格，想入阁，必须是庶吉士，翰林院待过的，张璁太菜，考进士都考了7、8回才考上。背后的杨一清出关，张璁才入阁。张璁比较缺德，嘉靖8年，得意忘形之后竟然攻击杨一清，说杨一清给张永写墓志铭，收贿赂200两，杨一清被免职。 夏言嘉靖9年，夏言也因为礼仪崭露头角。张璁感到被抢了生意，攻击夏言。夏言的武器是口才和笔法，确实是有才的人。张璁结党，甚至骂孔子，徐阶登场，反对张璁，徐阶被贬福建，皇帝对张璁的态度渐渐转变。张璁找了个夏言的人，让其上书说皇帝生不出儿子，陷害夏言，此人被审，结果闹大了，张璁败露，嘉靖10年，张璁被免职，夏言升礼部尚书。嘉靖15年，夏言成为首辅。嘉靖20年，郭勋攻击夏言，很快郭勋犯了事，死于狱中。再来说说朱厚熜，朱厚熜一上台，比较厌恶太监，斩了江彬、钱宁,甚至要斩张永，多亏了杨一清，张永才没事。朱厚熜迷信于修道，嘉靖21年，发生宫变，有个宫女趁嘉靖睡觉，拿绳子差点勒死嘉靖，嘉靖从此移居西苑。 严嵩严嵩，江西袁州府分宜人，成化16年生。正德元年庶吉士，之后母亲去世，回家归隐。正德16年进京，嘉靖17年任礼部尚书，工作勤奋，严嵩巴结夏言，夏言不搭理严嵩。嘉靖21年，严嵩弹劾夏言藐视皇帝，夏言离职，严嵩入阁。嘉靖24年，夏言又回来了，夏言为人比较孤傲，不结党，但也提拔了徐阶。 徐阶徐阶，弘治16年生，松江华亭人（今上海）。正德15年，聂豹为华亭知县，徐阶拜其为师，是为王学江右学派门人。嘉靖2年中探花，嘉靖3年，父亲去世回家守孝，嘉靖6年回来，因为反对张璁，被贬福建，政绩突出，嘉靖13年，提为湖广黄州同知，嘉靖18年进京。 严世蕃徐阶跟夏言是同一类人，比较坚持原则。嘉靖22年，徐阶任国子监校长。严世蕃，严嵩儿子，独眼。严世蕃对严嵩说夏言不足为虑，当今天下只有3个奇才，1是杨博，机智，军事重臣，2是陆炳，锦衣卫，嘉靖发小，救过嘉靖的命，3是自己，确实，严世蕃绝顶聪明，甚至比另外2个都要厉害。3人得2就能扳倒夏言。 夏言2夏言抓住了严世蕃贪污的罪证，严嵩得知，严世蕃说唯一的出路就是求情，严嵩跪地求饶，被夏言原谅。陆炳也犯了事，也去找夏言跪地求饶，也被原谅，但陆炳从此恨上了夏言。将领曾铣上书请求收复河套，夏言支持，嘉靖反对。严世蕃找到陆炳合谋，利用跟曾铣有仇的仇鸾攻击。严嵩上书支持嘉靖，反对夏言，夏言坚持，于是被免职。仇鸾上书弹劾曾铣，说曾铣结交近侍（夏言），嘉靖27年，曾铣被斩，夏言也死。 徐阶2其实，除了严世蕃说的3个奇才，还有另外的3个奇才，4是徐阶，5是高拱,高拱，正德7年生，河南新郑人。6是张居正,嘉靖26年，徐阶任翰林院院长，发现了张居正是个人才。嘉靖29年，鞑靼俺答进攻大同，仇鸾给钱送走俺答，于是俺答转而进攻北京，嘉靖召集众人商议对策，严嵩胆小不说话了，徐阶说出拖延待援的对策。援军来了，俺答撤退，嘉靖要丁汝夔反击，丁汝夔找到严嵩，严嵩告诉他不要追击，因为追击如果失败就要担责任，并且会保他无事。嘉靖追究丁汝夔责任，严嵩却把他卖了，丁汝夔被斩首。史称庚戌之变。徐阶因为这件事开始成为红人，严嵩告了徐阶一状，说徐阶有二心，原因是嘉靖30年，徐阶上书请求早立太子，嘉靖又开始冷落徐阶，但是徐阶跟夏言不同的是徐阶会巴结逢迎严嵩，当然徐阶的巴结逢迎不是为了升官发财，而是为了麻痹严嵩，除掉严嵩。虽然祖上仇钺是平定安化王叛乱的功臣，但仇鸾是个无能的人,开马市被俺答偷去很多财物，徐阶上书告了仇鸾的状，不久仇鸾病死。严嵩也找到陆炳告仇鸾的状，还说仇鸾跟徐阶关系密切，嘉靖把徐阶的奏疏拿给严嵩看，严嵩尴尬了。严世藩说此时的徐阶已成气候，动不得了，只能压制。 杨继盛虽然大家都知道严嵩是奸臣，但是没人敢攻击严嵩，除非不怕死的。杨博，虽然讨厌严嵩，但是在外面搞军事。张居正希望老师徐阶能挺身而出打击严嵩，当然徐阶不会那样蠢。高拱投靠裕王，严嵩跟他关系不大。陆炳虽然算是个好人，但毕竟还是严嵩的同盟。沈鍊是陆炳的下属，告了严嵩，被严世蕃害死，陆炳心中的天平开始往严嵩相反的方向倾斜了。杨继盛，正德5年生，嘉靖26年进士，同年的还有赵贞吉，后七子之一，据说是金瓶梅的作者。杨继盛是大公无私的人，死劾严嵩。奏疏送上去后，严世蕃看到原文后发现了破绽，因为文中引出了裕王、景王。高拱也意识到这可能会给他带来灭顶之灾，于是他找到徐阶，徐阶找到陆炳，希望陆炳能说句话，不要牵扯到裕王，保全杨继盛。严世蕃也找到陆炳，要整死杨继盛，牵扯到裕王身上。之后陆炳谁也不帮，保持了中立。之后杨继盛被打100军棍，腿断了，在狱中，肉腐烂，于是杨继盛拿碗片割去腐肉，不愧为硬汉。3年后，嘉靖34年英勇就义，赋诗曰浩气还太虚，丹心照千古。生平未报恩，留作忠魂补。 胡宗宪嘉靖32年，张经任浙江总督，指导抗倭。嘉靖33年，赵文华来到浙江，赵文华是严嵩干儿子，张经得罪了赵文华，于是赵文华整张经。张经在等待广西的狼土兵到来，一直没出兵。嘉靖34年，王泾在嘉兴打败倭寇，同时赵文华上书弹劾张经，说他拥兵自重，坐观倭乱。胡宗宪，徽州人，嘉靖17年进士。开始在西北任职，知兵事，嘉靖33年也来到浙江，投靠赵文华，张经走了，胡宗宪任浙江巡抚。任职后，很快就打了败仗，倭寇都是日本浪人，就是失去土地的武士，个人技能很高。俞大猷（yóu),福建晋江人，弘治17年生，是位武林高手，胡宗宪用其为总兵官。徐渭，明代三大才子最后一个，正德16年生，一直考不中进士，胡宗宪用其为幕僚，郑板桥见到徐渭的画，说愿为青藤门下走狗,而徐渭自己却说吾书第一，诗次之，文次之，画又次之，可见其才高八斗。汪直、徐海都是徽州人。汪直，是个跨境走私犯，走私军火，做日本人的生意，拥有私人武装，在日本九州岛还建有根据地，日本人给他打工，所以汪直算不上汉奸。而徐海是汉奸，专门干海盗。徐渭给出的策略是招抚，因为打打不过。胡宗宪派出使者前去跟汪直谈判，毛海峰,汪直养子，跟随使者去见胡宗宪，胡宗宪对其相当好。对于徐海，胡宗宪派出的是间谍，徐海还有两个合伙人陈东、麻叶，很快胡宗宪找到了徐海的破绽，徐海的老婆王翠翘,于是胡宗宪打算通过王翠翘劝降徐海。嘉靖35年，徐海进犯，胡宗宪拿出汪直的书信给徐海看，徐海以为汪直也投降了，于是退兵。胡宗宪让徐海攻击倭寇作为投诚的条件，徐海去了，打完了却被俞大猷打，胡宗宪命令俞大猷退兵。此时徐海已失去谈判的资本，胡宗宪又命令徐海去打陈东、麻叶，陈东、麻叶也被抓。嘉靖35年，徐海投降，胡宗宪却命令陈东攻击徐海，徐海自杀，之后陈东、麻叶也被杀。王翠翘的故事被写成小说金云翅传，在越南，此书相当于中国的红楼梦。嘉靖36年，汪直登岸，与胡宗宪谈判，胡宗宪请他去杭州转转，结果到了杭州，却被一个叫做王本固的官给抓起来了，并上书请求处斩汪直，胡宗宪上书说不能杀汪直，杀了必定会造成倭乱。最后汪直还是被杀了，胡宗宪招抚不成，只有一战。 戚继光嘉靖37年正式开战，俞大猷进攻毛海峰的舟山,打不下来，戚继光出场，1个月后，打下来了。戚继光，祖上是朱元璋时期的戚祥，世袭登州卫指挥佥事，嘉靖7年生，对倭寇战损率30:1，将是倭寇的噩梦，少年时作诗曰封侯非我意，但愿海波平。。嘉靖29年庚戌之变作的备俺答册在军中流传。后守卫蓟门自学孙子兵法，作一年三百六十日，多是横戈马上行诗句。嘉靖34年调任浙江，胡宗宪任其为宁绍台参将，慈溪龙山之战发现兵太熊，请求练兵，称为戚家军。嘉靖37年，舟山之战，发现兵还是不够好，于是练了义务兵,义乌兵善战无畏。赵文华，得罪了嘉靖，被削职为民，路上暴毙，胡宗宪没了靠山，于是给嘉靖送白鹿，意为祥瑞。嘉靖40年，台州大战爆发，戚家军用鸳鸯阵,每队11人，用5种兵器，标枪、盾牌、狼筅、长矛、短刀,宁海，新河，台州三战皆胜，歼敌5500，伤亡仅20，史称台州大捷。戚继光当然也有靠山，即是后来的张居正。福建倭乱，戚继光又去福建抗倭，嘉靖41年，横屿之战，士兵铺稻草前进，戚继光亲自擂鼓，大胜。嘉靖41年，胡宗宪被捕，原因是投靠奸党，自杀于狱中，赋诗曰宝剑埋冤狱，忠魂绕白云，年54。从嘉靖33年开始，历时12年，到隆庆元年，倭寇基本肃清。俞大猷，万历8年去世，年77。此后戚继光去了蓟门。徐渭被关监狱7年，出狱后经戚继光推荐，去到辽东给李成梁的儿子李如松、李如柏当老师，万历21年去世，年73。 徐阶3王世贞的老爹被严嵩整，王世贞跪地求饶，严嵩还是害死了王世贞的爹。徐阶依然努力巴结着严嵩，邹应龙讽刺徐阶是严嵩的小妾。嘉靖37年，徐阶派出3人弹劾严嵩，试探，3人被充军。嘉靖39年陆炳去世。嘉靖40年，皇宫失火，严嵩请嘉靖移居南宫，嘉靖怒了，而徐阶说3个月就能修好。同年，严嵩老婆死了，严嵩意识到徐阶已经占到了上风，带着家小跪地请求徐阶放过，当然徐阶不是夏言。王学门人何心隐,指出扳倒严嵩的关键在于皇帝，于是找到同为王学门人的蓝道行,在嘉靖与神仙对话的符文上做手脚。嘉靖41年，邹应龙弹劾严世蕃贪污，嘉靖怒，逮捕严世蕃，严嵩被辞退。 结语纵观嘉靖这40年，正是权谋争斗的高峰，原因无外乎嘉靖本人就十分聪明，所以在这个时代能活的久的一定是绝顶聪明之辈。前期的杨慎、张璁、甚至夏言都是配角，直到严嵩、严世蕃父子的强力组合出现，把持朝政近20年，无人能将其拉下马，足以证明他们父子的厉害。当然，他们的对手还是有的，比如徐阶与严世蕃的斗智，简直可以达到人类的智力极限，不过这在下部可以淋漓尽致的体现。我想起权谋电视剧琅琊榜，权谋的高峰，里面就有很多明代的影子，什么誉王、靖王，这里有裕王、景王，什么朝堂辩礼，这里有大议礼。所谓权谋，决定他们命运的是皇帝，皇帝偏向谁，谁就可以犯了罪也不死，要是被皇帝讨厌了，必死无疑。封建时代，可以定的罪名太多了，也极少有人身居高位，屁股是干净的。所以基本就是争宠。再来聊一聊东南战事，胡宗宪也好、戚继光也好，他们的初衷是为国效力。但是也不得不保住自己的位子，上面没人，底下就没权。不管他们做什么也好，目的是为国办事，而有些人如严嵩，目的是大私无公，不是为国尽力，却把持朝政，实在可恶。索性，嘉靖时期这样的人不多，仁人志士还是此起彼伏，因此嘉靖时期也相对稳定。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿3妖孽宫廷","date":"2016-05-30T15:12:21.000Z","path":"2016/05/30/明朝那些事儿3妖孽宫廷/","text":"年号表 年号 庙号 姓名 谥号 起止年 注 评价 洪武 太祖 朱元璋 高帝 1368-1398（31年） 谥号20字 洪武之治 建文 惠宗 朱允炆 让帝 1399-1402（4年） 朱棣篡位后废除，沿用洪武年号，称1402年为洪武35年，次年改元永乐。明神宗时期恢复建文年号。庙号谥号皆为南明时期所上。谥号16字 比较悲情，被朱棣抹除 永乐 成祖 朱棣(ti) 文帝 1403-1424（22年） 谥号16字，初庙号太宗，嘉靖年间改为成祖 永乐盛世 洪熙 仁宗 朱高炽 昭帝 1425（1年） 谥号16字 仁宣之治 宣德 宣宗 朱瞻基 章帝 1426-1435（10年） 谥号16字 仁宣之治 正统 英宗 朱祁镇 睿帝 1436-1449（14年） 谥号16字 景泰 代宗 朱祁钰 景帝 1450-1457（8年） 景泰实际年号只有7年，因为1457当年即被改元天顺（一般新皇帝继位次年改元）。英宗复辟后，谥曰戾。成化年间恢复帝号，谥号仅5字，无庙号。南明期间追认庙号代宗，谥号加长到16字。 第二悲情，被朱祁镇抹黑 天顺 英宗 朱祁镇 睿帝 1457-1464（8年） 英宗复辟，1457年称天顺元年，而不再称景泰8年 成化 宪宗 朱见深 纯帝 1465-1487（23年） 谥号16字 弘治 孝宗 朱佑樘 敬帝 1488-1505（18年） 谥号16字 弘治中兴 正德 武宗 朱厚照 毅帝 1506-1521（16年） 谥号16字 天顺徐有贞&amp;朱祁镇 VS 于谦朱祁镇复辟了，对于夺门有功的还乡团也毫不吝啬的封赏。徐有贞入阁，石亨、张軏(yuè)封爵，曹吉祥领司礼监。徐有贞掌权了，于是跟徐有贞有仇的于谦被捕入狱。内阁也大换血，换上了徐有贞的亲信，但是同时入阁的还有李贤，徐有贞把李贤当亲信。站稳脚跟之后，徐有贞捏造说于谦要迎立藩王，此时朱祁镇还是挺厚道的，他说于谦确实是有功的人，不愿意杀。徐有贞又想了个朱祁镇无法反驳的理由，说，不杀于谦，夺门无名啊。于是于谦被斩首，罪名是意欲迎立藩王，跟岳飞的莫须有异曲同工啊。于谦被斩首，天下冤之。后来朱祁镇也后悔了，到了他儿子朱见深的时代才为于谦平反，明武宗时期谥曰武肃，彻底肯定了于谦的功绩。评价：于谦一生干干净净，坦坦荡荡，伟大，可与日月同辉，民族英雄，作者评其为明代第二强人。还有个小插曲，朱祁镇复位后，没有处理还在病着的朱祁钰，也没废除朱祁钰的皇帝身份，直到一个月后朱祁钰去世。同年，朱祁镇改年号为天顺，也是目前为止为数不多的一年存在两个年号的年份，一般新皇继位次年改年号。 曹吉祥&amp;石亨 VS 徐有贞徐有贞也是个想做事的人，但是他发现同伙石亨、曹吉祥都是贪污腐败、素质不高的人。徐有贞想把他们赶走，就告了一状他们贪污。当然曹吉祥等人也不是那么好打发的，毕竟是皇帝身边的，就把徐有贞与朱祁镇两个人在一起说的话全都泄漏出来，让朱祁镇认为徐有贞嘴把不住风。当他们狗咬狗的时候，背后有个人一直注视着一切，就是李贤。表面上看李贤是徐有贞的人，但他与石亨也交情匪浅。其实李贤谁的人也不是，他是要为于谦讨公道的人。又一次，徐有贞叫他党羽攻击石亨贪污，石亨急忙找到曹吉祥，先一步去告了徐有贞的状，徐有贞入狱。作为徐有贞的表面同党，李贤也一同入狱，不过李贤有同伙搭救。风光了4个月的徐有贞得到了他应有的结局，后被发配充军，天顺4年被放回家，又10余年死去。纵观其一生，不过是个小丑，当个小丑也就罢了，却直接导致了于谦的死，所以作者对此人的评价只有4个字：无话可说。 李贤&amp;吴谨 VS 石亨&amp;曹吉祥徐有贞倒台了，石亨变成最红的人了。于是本性暴露无遗，贪污腐败，甚至藐视皇帝。命其侄子石彪守大同，认为皇帝也不敢拿他怎么样。当年的迎立外藩的当事人朱祁镇的叔叔也过来解释当年根本没有那回事。又一次，皇帝与大臣都在凤翔楼看到城中一处最豪华的房子，就问是谁家，吴谨站出来说是石亨家，于是朱祁镇对石亨态度大转变。天顺3年石彪入狱，但朱祁镇仍然念旧，不忍杀石亨。李贤跟朱祁镇解释了当年夺门并不是有功，朱祁钰死了，朱见深当皇帝也就是朱祁镇当皇帝(朱见深当年才10岁，朱见深是朱祁镇儿子)，相反，夺门是铤而走险，万一失败了，后果不堪设想。朱祁镇放下最后一点障碍，天顺4年，石亨入狱惨死。石亨死了，曹吉祥也心慌了。与养子曹钦一起造反了，密谋泄漏。吴谨、孙镗平叛，吴谨战死，孙镗打了一天，曹钦失败投井，曹吉祥被处斩。李贤，入阁后，致力于为于谦讨公道，正直之臣。成化2年病逝。他有个女婿名叫程敏正，程敏正对唐伯虎的一生影响深远。 总结天顺年间，于谦被害死了。徐有贞，一个小丑，害死于谦的罪人，石亨，前期有战功，后期跋扈，自取灭亡。曹吉祥不自量力，咎由自取。李贤，正直之臣。朱祁镇，是个好人，不是好皇帝。 成化天顺8年，朱祁镇病逝，年38，继位者朱见深。朱见深，正统12年出生。正统14年，土木堡之变，英宗被俘，代宗继位，朱见深被立为太子，孙太后以此作为代宗继位的交换条件（太子是侄子），同时，一个姓万的宫女被派到朱见深身边。景泰3年被废，朱见济被立为太子。天顺8年继位，年18，万宫女35。至此，2人以多年感情发展为姐弟恋，万宫女被封为贵妃。吴皇后怒打万贵妃，吴皇后被废。成化2年，万妃生子，不久夭折，此后再无生育能力。成化元年，广西一民女纪姑娘作为俘虏入宫当宫女，当值内库仓管员。成化5年，纪姑娘被宠幸，6年，生子朱佑樘。万妃，自己生不了孩子，也不允许别人有孩子，心狠手辣，但凡别的妃子怀孕，就会被万妃害死。因此从成化6年至成化11年，一直隐瞒着朱佑樘的存在，有赖于太监张敏的保护，吴废后的养育。成化11年，皇帝感叹自己没有儿子的时候，张敏告知皇帝已经有了儿子，纪姑娘封纪妃。同年纪妃去世，死因不详。几年后，张敏自尽。纪妃去世，孩子交由周太后保护，不久，朱见深4子出生，前2个都夭折了。 成化年间，朝廷一锅粥，各路人物登场，都不是好人。代表人物有，梁芳、李孜省、汪直、尚铭、万安。万安，成化5年入阁(时阁臣有商辂)，成化11年，商辂退休，万安成为首辅。汪直，太监，斗不倒尚铭(也是太监)。成化13年成立西厂,搞了杨晔(杨荣后人)，杨晔死于狱中。商辂与怀恩(好太监)告了汪直一状，汪直被免职。成化17年，李孜省、尚铭合伙搬倒汪直，李孜省又除掉了尚铭。梁芳、万妃劝帝废朱佑樘，怀恩力保，怀恩被罚凤阳守灵，朱佑樘终于没有被废掉。成化23年，万妃去世，朱见深亦去世，年41。 总结成化年前，乱成一锅粥，没有谁是主角。朱见深，不是个好人，也不是好皇帝，只是一个懦弱的人，这要归因于他悲惨的童年。 弘治朱佑樘是个好皇帝，一上台，就整治成化年间的妖魔鬼怪，李孜省充军，梁芳入狱，万安滚蛋。怀恩复职，吴废后被朱佑樘当做母亲奉养。任命王恕为吏部尚书，马文升为兵部尚书。这两个人奠定了弘治盛世的大局,此时都是老头子了。杨廷和出场，后来的权臣，三朝不倒，权倾天下。又有三人相继进入内阁，刘健、李东阳、谢迁是明代次强内阁，仅次于三杨内阁。刘健，弘治第一重臣。李东阳，善谋，文坛领袖，开创茶陵派。同时代还有一个李梦阳，发起文学史上的复古运动，还是前七子之一。同时代的还有唐伯虎，名寅，与祝枝山、文征明、徐祯卿合称吴中四才子或江南四大才子。唐伯虎进京赶考，监考官正是李贤的女婿程敏正，考题只有2人答了出来，一个是唐伯虎，另一个是徐经。意外发生了，由于唐伯虎时常对别人说他一定是状元，就被人告了作弊，与徐经，程敏正一同被抓。对唐伯虎的处罚是贬为小吏，不得为官，仕途算是断送了。这也是个悬案，到底有没有作弊，经作者推测，确实有人作弊，可能是徐经作弊，连累唐伯虎，也有可能作为程敏正的约定门生，唐伯虎确实从程敏正那里拿到了考题，作弊了。这三人的结果是，唐伯虎从此心灰意冷、浪荡天涯，程敏正免官，徐经回家焚烧四书五经，告诫后辈永不读书，其重孙徐振之，变成了旅行家，此人别名徐霞客。王恕、马文升都老了，马文升推举刘大夏，任兵部尚书，杨一清，刘大夏推举，于陕西指挥兵事。弘治18年，朱佑樘逝世，年36。 总结弘治年间，皇帝朱佑樘，任用王恕、马文升、刘健、李东阳、谢迁等人，天下大治，史称弘治中兴，朱佑樘是一个好皇帝，也是一个好人，到目前好像还没有人得到如此高的评价。 正德刘瑾 VS 刘健朱佑樘去世了，独子朱厚照继位，但这位皇帝不像他父亲，是个最能闹，最会玩的皇帝。马文升、刘大夏上书劝诫，刘瑾从中使坏，马文升、刘大夏被免职。刘瑾，八虎之一，因为会陪皇帝玩，成了大红人。焦芳，文官集团中刘瑾同党。刘健联合文官集团上书请除刘瑾等，被焦芳提前告知刘瑾，刘瑾等八虎先一步去找朱厚照哭诉，于是没有成功。刘健、谢迁请辞，李东阳因为之前只说要惩罚有罪的太监，没有同刘健等一样做绝，被留了下来。刘瑾胜。 王守仁在刘健、谢迁离职之际，有一批官员一起上书，请求朝廷挽留。结果当然是全部被打屁股。王守仁就在这批人中，第一次登场。王守仁，光芒冠绝当代、映照千古，是作者所说的明代第一强人。王守仁，字伯安，别号阳明。日本海军名将东乡平八郎，王守仁粉丝，其腰带上有一生伏首拜阳明几个字。王守仁父亲王华，是一名状元，家庭殷实。王守仁自小喜爱舞枪弄棍、兵书，立志做圣贤。甚至在他结婚时去跟道士学打坐，大家找不到他，人们都认为他是个怪人。既然要做圣贤，首先接触到的是理学家朱熹的格物穷理，于是他开始今日格一物，明日格一物，还有守仁格竹故事。后来研习武艺，骑射，考中进士，在一次与杭州的一个禅师的对话中，悟出不能存天理灭人欲的道理，因为人性不能泯灭。时间回到当时被打屁股的时候，王守仁因此被贬为贵州龙场驿。回去途中机智躲过刘瑾的追杀，到南京找到了他父亲王华，王华告诉王守仁，要他去赴任。于是王守仁出发了，去那边远之地，龙场条件很艰苦，但王守仁坚持了下来，教化乡民。也是在龙场，一个无人的山谷中，一门伟大的学问，心学，诞生了。很多史书记载了这一瞬间，也产生了一个名词，顿悟。心学讲求天人合一，随心而动，随意而行。 李东阳&amp;杨一清&amp;张永 VS 刘瑾此时朝廷只剩下李东阳苦苦支撑，李东阳向焦芳示好，不断营救刘瑾要迫害的人，忍辱负重。而另一边，因为皇帝不管事，刘瑾是皇帝的代言人，刘瑾权势越来越大，投靠他的人越来越多。杨廷和，神童，官场上平步青云，正德2年入阁，做过朱厚照的老师，因此刘瑾整不倒杨廷和，杨廷和也因此投入李东阳一边。杨一清，此时为三边总裁，位高权重。刘瑾想拉拢杨一清，被杨一清拒绝，于是刘瑾开始打击杨一清，杨一清走时推荐张彩接替。张彩是刘瑾的谋士，由是刘瑾对张彩产生了怀疑，杨一清这招实在是高啊，而杨一清入狱。杨一清本是李东阳的师弟，李东阳设法救出杨一清，让他隐居起来，要用他的时候再通知他。刘瑾，也是想做点事的，但是不懂的事也要掺和就会犯错了。刘瑾建言说整饬军屯，开始犯错。刘瑾谋士张彩听说此事，提醒刘瑾要小心，但是刘瑾已经不信任张彩了，不听，继续犯错。军屯因为损害到地方军阀的利益，引发了安化王叛乱，而叛乱的口号是诛杀刘瑾。杨一清起复三边总裁，平定叛乱，监军张永。张永，八虎之一，与刘瑾不和。当杨一清赶到时，叛乱已经被他老部下平定了，于是杨一清开始试探张永，得知张永确实可以争取。张永走时，杨一清请求张永去搬倒刘瑾，一旦皇上同意，要连夜派兵抓了刘瑾，并告诉他，到时候会有人帮助他。张永回去的接风宴上，刘瑾也有防备，一直监视着张永。张永假装一直喝酒，直到刘瑾离席，张永开始告状，但是朱厚照是个250，说这些事先不管，先喝酒。张永又说刘瑾会夺取天下，朱厚照依旧250，说让他去夺。张永坚持说，到时候陛下去哪安身，朱厚照终于清醒了，于是刘瑾被抄家下狱。但是朱厚照毕竟有感情了，不想杀刘瑾。李东阳出手了，联合百官弹劾刘瑾，并从刘瑾家搜出了兵器，于是刘瑾判处凌迟。审刘瑾的时候，刘瑾仍然嚣张，说你们都是我推荐的，谁敢来审我，出来个驸马爷敢审，正德5年，刘瑾被处死，张彩也被处死，焦芳被赶出内阁。此后，杨一清担任户部尚书，又任吏部尚书。正德7年，李东阳退休，杨廷和接替，又4年，李东阳去世，年71。 朱厚照刘瑾死后，钱宁成了朱厚照的新玩伴。朱厚照玩，玩些什么呢，建豹房，玩动物。猎奇，玩女人，玩已婚的、怀孕的。总之，朱厚照反叛，追求自由。宫里玩腻了，就出去玩。江彬，也是朱厚照玩伴，支持朱厚照出去玩。朱厚照第一次出奔，被拦了回来，大臣们当然不会让皇帝出去玩。第二次出奔，钻空子跑出去了，去了关外。当年鞑靼有个牛人，叫做小王子，连年寇边，无人能敌。朱厚照当然想会会小王子，于是调兵遣将，迎击小王子。应州之战打响，朱厚照玩的厉害，打仗也是会的，应州之战赢了，朱厚照还亲手杀了一个，这段历史史书记载并不详实，无外乎当年朱厚照是偷跑出去的。北边玩过了，朱厚照要去南边玩，一大批大臣劝谏，朱厚照一怒之下打死了10几个，不过最后拗不过大臣，也就放弃了。 王守仁2朱棣打天下时黑了宁王朱权，宁王后来被封在南昌。朱宸濠正是朱权后代，很有抱负，心怀不轨。前后贿赂刘瑾、钱宁、杨廷和等，招聘流氓强盗。正德5年，王守仁起为庐陵知县。正德11年，巡抚江西南部，升官很快，背后支持王守仁的有杨一清，以及兵部尚书王琼。正德12年，王守仁到达江西。此后在江西剿匪，用兵诡异，很有成效。他的知行合一的理论，后来影响了如徐阶、张居正、海瑞(海瑞没明白)、陶行知等人。时任江西巡抚的还有孙燧，是个正直之臣。朱宸濠有两个谋士，刘养正，李士实，都没啥本事。朱宸濠还招揽来唐伯虎，唐伯虎去了发现是要谋反，于是装疯，裸奔才能回去，之后唐伯虎就彻底堕落，嘉靖2年去世，一代天才，这种结局，实在令人唏嘘。正德14年，朱宸濠叫来王守仁、孙燧宴会，借机试探他们俩。王守仁委婉的表达了要做忠臣的意愿。江彬与钱宁不和，要害钱宁，利用朱宸濠与钱宁有关系，就说了朱宸濠的坏话，杨廷和知道了，赶紧通知朱宸濠不要轻举妄动，但是朱宸濠太心慌了，遂谋反。正德14年，朱宸濠谋反，杀孙燧，王守仁逃跑。王守仁逃到了临江府，带着临江知府戴德孺的人马去了吉安。吉安知府伍文定是个勇将，于是王守仁在吉安建立大本营，召集兵马。由于聚集人马需要时间，王守仁使用诡计，使朱宸濠在洪都逗留10天没去进攻南京。而当军队集结完毕，王守仁却没有进军，他认为，攻难胜，敌动再寻机攻之。叫做此心不动，随机而行，所以也有人说王守仁狡诈专兵。朱宸濠进发了，攻下九江，一时攻安庆不下。此时，众人一致认为应该救援安庆，而王守仁认为应该攻打南昌。因为舍近求远，风险太大。大军进发了，南昌城夜战，一战而下。朱宸濠回退，驻扎于鄱阳湖。两军对峙于鄱阳湖，当夜，朱宸濠夜袭，遇伏，大败。朱宸濠为了鼓励士气，开始发钱。第二战，仰仗伍文定的勇猛，王守仁的奇兵，朱宸濠又败。朱宸濠铁锁连舟，王守仁火攻破之，俘虏朱宸濠。 王守仁3当朱厚照得知朱宸濠叛乱，决定亲征，不久，王守仁胜利的捷报传来，却被江彬隐瞒了。江彬又把钱宁整进了监狱。王守仁上奏，让皇帝路上小心刺客，江彬以为王守仁意指自己，就恨上了王守仁。而王守仁请求皇帝留在南京献俘，江彬却非要去南昌。于是王守仁抗命带俘虏去了杭州，把俘虏交给了此时到杭州的张永，自己宁可不要功劳，于是张永帮助王守仁抵挡了江彬的诬陷。江彬派张忠去找王守仁的茬，王守仁射箭连中3次红心堵住了张忠的嘴。朱厚照时在扬州，有江彬等人作恶，可为难了地方百姓。此后，江彬又为难王守仁，张永提前告知，王守仁突然去当道士了，于是皇帝又把他叫出来当官。正德15年，朱厚照离奇失踪，王守仁知道后，认为是江彬试探大家的反应，于是加紧操练兵马，朱厚照又回来了。正德16年，朱厚照回去经由清江浦时落水，不久身亡。朱厚照死了，作者对其评价为：昏庸、荒唐，不是个敬业的劳动者，追求自用，作为人是正常的，作为皇帝不正常。本来说，王守仁立了大功，应该会被委以重任，但是杨廷和阻碍了王守仁的仕途，因为喜欢王守仁的王琼和杨廷和有矛盾。嘉靖元年，王守仁任南京兵部尚书，同年，王守仁父亲王华病逝。此后王守仁辞官，开始传道授业。有个学生叫王艮，被王守仁识破是想出名，但仍然收徒。王艮创立泰州学派(思想启蒙学派)，传人有王栋、徐樾、赵贞吉、何心隐、李贽、徐阶。嘉靖6年，王守仁又被朝廷起用派去广西剿匪。临走时，与钱德宏、王畿 天泉论道。嘉靖7年，从广西回来的路上，王守仁病逝。 杨廷和&amp;张永 VS 江彬朱厚照去世了，但是朱厚照没儿子，于是杨廷和与张永商定由朱厚照堂弟朱厚熜(cōng)继位，年号嘉靖，在位共45年。杨廷和联合张永，骗江彬入宫，杀死。职位由张永、郭勋接替。 总结纵观正德时期，发生了很多大事。皇帝胡搞瞎搞，奸臣蹦了出来，前后太监当权作恶的有刘瑾(风光了5年)，钱宁，江彬。天下大乱，爆发了安化王之乱，宁王之乱，皇帝自己还出去跟蒙古人打了一仗。由其父亲缔造的弘治中兴的局面荡然无存，大明在下坡路上越走越快。当然也出现了一些能人赶走权奸，又有王守仁这样的第一强人坐镇，所以最后也没乱的起来。朱厚照不过是个有点胡作非为的人罢了，也发生了很多离奇的事情，让人感觉不似真的。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿2万国来朝","date":"2016-05-25T12:07:31.000Z","path":"2016/05/25/明朝那些事儿2万国来朝/","text":"前言看完第二部，真的想说点什么了。鉴于第一部，我是比较熟悉的，比如朱元璋朱棣，谁不知道啊，小说电视剧都已经有初步了解了。所以看的时候，波澜不惊，快感不多。但第二部，除了朱棣，还有许许多多精彩的故事，精彩的人，温暖的情。所以再写笔记啊什么的，真的想多写一点，我是看完了又回去大致翻阅一下，找到关键词，防止回忆的时候忘记什么了，不能马虎了。所以不管事实是怎么样，在我眼里，第二部确实比第一部精彩多。最近在简书看到做了10年读书笔记的人的笔记，吓得我都不知道自己在写的到底是什么鬼东西了，写这些有什么意义啊。我思考了一下，不管写的怎么样，证明我看过。就比如历史，如果不记下来，一个月后就忘了，但是记了下来，一个月后看到这篇，又都回忆起来了。现在，这就是意义。 我分为三个大段落划分，1是永乐盛世，2是仁宣之治，3一个民族英雄。下面开始回忆让此刻的我感动的第二部。 一、永乐盛世内修政理朱棣成功了，作为藩王克掉了皇帝，历时4年。建文帝失踪了，朱棣不能安心，派人去找，胡濙去找了。朱棣篡位不具有正统性，怎么办呢，硬说自己是马皇后生的，隐瞒了自己亲妈。那些建文的旧臣，如方孝孺，诛十族，第十族是朋友，学生。做完了这些事，朱棣还是觉得天下人不服他，他要文治武功，威震四海，这样才不会心虚。用解缙主编永乐大典，一部百科全书。又把京城从南京迁到北平，北平原来是他大本营，改名北京。虽然北边不是产粮区，环境也不好，但是因为跟蒙古作战，南京太远了。郑和原名马三保，小时候被抓去充军不幸被阉割。因为靖难有功，被朱棣赐名郑和。郑和的祖父父亲都是伊斯兰教徒，都去过麦加，郑和也有这个梦想，于是就开始7次下西洋的壮举。最远到达过非洲，航海中虽然也有过险境，都被郑和化解了。郑和下西洋不是耀武扬威，欺负弱小，而是文明的使者，传播文化，促进交流，比西方的一些航海家插个旗去殖民的行为强10000倍。此时共有30多国来给明朝朝贡，很多来了就不想走了，不愧为永乐盛世。 外征周边当时的安南，就是今天的越南，本来是姓陈的当国王，但是姓胡的篡位了，而且瞒着明朝。直到发现朝贡的国书上面国王换了姓，此时的陈姓支持者也来告知了真相。张辅出征了，张辅是靖难战死的朱棣第一大将张玉的儿子。张辅也很强，30万大军征安南。安南也有应对之策，大象。于是张辅找来马匹穿上狮子的画像，又充分利用火铳，平定了安南，陈氏没有继承人，明朝就把安南划入了版图。 瓦刺是蒙古的一支，虽然不是黄金家族，但是也在西部地区强盛了起来。朱棣打败鞑靼后，打瓦刺。瓦刺实力强，但是明军更强。此时明军有三大营，神机营，三千营，五军营，并且有一套当时领先世界的战术体系。就是先打枪，再上骑兵步兵。瓦刺骑兵也失败了。火器应用要数云南沐家最厉害。沐英当年跟随蓝玉傅友德进攻云南，之后就被封在云南。云南大象多，只有火器应对的了。 两个儿子永乐年间朱高炽朱高煦的争位我认为是堪比琅琊榜的权谋之争，因为他们的爹是个非正常手段上位的一代雄主，一不小心就倒台。朱高炽是太子，但是他腿残疾，又是个大胖子，远不如朱高煦漂亮威武。当年打南京时，朱棣就拍着他的背说，世子有疾，勉之，朱高煦从此就做上了皇帝梦。处心积虑打击朱高炽，当时大部分人看到朱高炽不牢靠了，都转投朱高煦。但是有有三个人始终支持朱高炽，就是著名的三杨，杨士奇，杨荣，杨溥，杨溥还为此坐了10年牢。朱棣喜欢打仗，不像朱元璋有旺盛的精力没日没夜的处理朝政，于是他就组建了内阁，内阁帮他做事，他就可以去打仗了。后来三杨组成的内阁堪称最强内阁。还设置巡抚总督督师管理地方大事。因为三杨的努力，朱高炽才没被废掉。朱棣在北征回来的路上死掉了，临死之前，胡瀅回来了。他最终得到了建文的消息，根据作者猜测，建文帝还活着，并且表达了不会再争了。朱高炽早先得到消息，顺利继位了。 仁宣之治朱高炽明仁宗朱高炽是个好人，他放过了朱高煦。他还把建文旧臣的后人都找回来，为方孝孺平反，但是他只干了一年就死了，他的年号叫洪熙。 朱瞻基明宣宗朱瞻基也是个好皇帝，他与他父亲统治时期，朝政清明，与民休养生息，史称仁宣之治，是明朝国力最强盛的时候。仁宗走了，朱高煦再也忍不住了，叛乱了。朱瞻基亲征，朱高煦不堪一击，被抓。朱高煦变成了喜剧演员，朱瞻基去看他，他莫名其妙的用脚勾了一下朱瞻基，朱瞻基用铜钟把他罩起来，他扛着钟走，最后朱瞻基放火烧死了他。 朱瞻基当政期间，开始启用太监，因为皇帝只有一个人，大臣有一帮，为了制衡，只好启用太监，没有别的办法。内阁有票拟权，皇帝有批红权。他教太监读书，这是乱象的一个起点。朱瞻基干了10年才30多岁就死了。他的年号叫宣德。 民族英雄于谦太监王振王振本来是个县城小官，为了荣华富贵，出人头地，自宫当了太监。当时太监文化水平太低了，于是王振脱颖而出。太监有2个部门最有前途，一个是司礼监一个是御马监，司礼监跟诏书有关，御马监跟兵符有关。朱瞻基死了，他的儿子才8岁的朱祁镇继位了。王振是朱祁镇的老师，朱祁镇什么都听王振的。王振作威作福，独揽大权，收受贿赂，朝政乌烟瘴气。明朝开始走下坡路。这时瓦刺又强大了起来，统一了蒙古，首领叫也先。也先进攻明朝边关，王振不懂兵，偏偏要逞能。带着皇帝，带着20w明军精锐出发了。到了山西，一会要回自己老家看看，一会又不看，被也先逮到机会，全军覆灭。随军大臣50多员战死，包括那个平定安南的张辅。皇帝被俘，20w精锐尽没，这就是著名的土木堡之变，所幸的是王振也在乱军中死了。 于谦按理说这明朝要走北宋的老路啊，但是此时一个人站了出来，拯救了这个危局，就是于谦。于谦的偶像是文天祥，宣德时期骂朱高煦有功，被委以地方大员。此时在朝廷纷纷议论南迁之时，力挺一战，并且迅速准备战备，稳定人心。此时代理政事的是朱祁镇的弟弟朱祁钰。朝堂上群臣请命要打击王振党羽，朱祁钰沉默了，于是朝堂斗殴开始了，几乎所有的大臣都去打那几个王振的党羽，活活打死。朱祁钰慌了，想逃走，于谦上前请求应判大臣们无罪，于谦的威望又上了一个层次。也先来了，带着朱祁镇做人质，大臣纷纷请求朱祁钰登基，朱祁钰登基了。朱祁镇成了太上皇，过期了。也先先在西北带着朱祁镇叩关，郭登杨洪拒不开门。也先之后去北京了，于谦正等着他。于谦下达了要么战死要么胜利这样的军令，各个门派人把手，分配武将。又亮出了最后的神机营(土木堡三大营也覆灭了)，在石亨孙镗等人的奋战下，也先失败了，撤退的晚上又被大炮轰，也先恢复元朝的霸业也覆灭了。 朱祁镇朱祁镇是明朝最传奇的一位皇帝了，但是他并不坏，还是个好人。因为小时候父亲就死了，年纪小被人利用也很正常。直到土木堡被俘，他将开始他传奇的一生。土木堡战败时，他也不跑，镇定自若，蒙古兵见他不凡就把他带去见也先，他也不怂，甚至他在也先那里还处到了朋友，他是那种到了哪里都人缘好的人。作为人质，被带着东奔西跑，大明朝也不要他了，有了新皇帝。流亡的日子是艰苦的，也是能体现患难与共的。袁彬就是跟朱祁镇患难与共的人，北方冷，袁彬把朱祁镇的脚放在自己怀里给他暖脚。袁彬遇难，朱祁镇愿用生命去救他。有个坏人叫喜宁，是个汉奸，总是迫害朱祁镇，后来喜宁被朱祁镇他们除掉了。朱祁镇还有蒙古朋友，叫伯颜帖木儿，总是帮着朱祁镇。朱祁镇对也先没有价值了，又不能杀他，就想把他送回去，但是明朝不来人接，因为朱祁钰不想他回来。朱祁钰爱上了皇位，放弃了兄弟。后来拗不过大臣终于派人去接，又不给钱，还好有个叫杨善的人，嘴皮子非常厉害，把也先说动了，不花钱就能领回家。 朱祁镇回来了，之后就被关在南宫。土木堡之后，朱祁镇的皇后钱氏倾尽所有的财物送给也先，希望也先放人质。当然没放，于是钱氏每天哭每天哭，哭瞎了一只眼，哭断了一条腿。皇后与皇帝之间也会有这种夫妻真感情，闻所未闻。此时，那么多年过去，钱氏在等他的丈夫回来，朱祁镇回来了。即使被囚禁，朱祁镇还是镇定自若，这么些苦吃过了，朱祁镇已经懂得了很多。 这下轮到朱祁钰着急了，他哥哥回来了，他的位子不稳了。而且太子还是朱祁镇的儿子(当年孙太后跟他当皇帝的交换条件),于是他贿赂大臣，让他们支持自己把太子换成自己的儿子。可是他儿子死得早，于是大家有要求他换回来，没辙了。朱祁钰也病了，快不行了。这时候冒出来一帮人，打算帮助朱祁镇复辟。这帮人有土木堡之后第一个提议南迁的徐锃，此时已改名徐有贞，石亨，太监曹吉祥，组成还乡团。在一个夜晚，带着朱祁镇夺门复位，并且成功了，朱祁镇又回到皇位了。 朱祁镇，明英宗，第一次当政年号正统,第二次天顺。 朱祁钰，明代宗，年号景泰。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"嫌疑人x的献身","date":"2016-05-22T13:20:04.000Z","path":"2016/05/22/嫌疑人x的献身/","text":"推荐之书早前看过电影，当时感到确实牛逼啊。不过到看书前，大致情节都记不清了。只记得真相是杀了一个叫花子，最后主角很悲剧。很震撼，之后也是久久不能平复。 后来意识到东野圭吾的大名，又见到解忧杂货店畅销，就先买了相对熟识的x来看。 情节石神是个数学天才，帝都大学毕业后被迫当了个高中数学老师，人到中年仍然孤身，他想自杀。恰巧那天隔壁来了靖子母女，靖子离异独自带着女儿，石神暗恋靖子，天天去靖子工作的便当店光顾。靖子前夫是个无赖，纠缠她们母女不放，靖子母女失手杀了他。石神挺身而出帮她们处理尸体，隐瞒真相。警察找了上来，靖子母女按照石神的指示小心对付。办案警官意外引来了汤川，汤川是石神的老友，物理学家，其逻辑思维足以和石神匹敌。石神精心布置的障眼法被汤川慢慢识破，和靖子的关系渐渐浮出水面。另一边靖子的老相识妻子去世，追求靖子，石神嫉妒着，靖子痛苦着。 随着汤川一步步识破真相，在跟石神在一排游民处讨论齿轮作用后，石神自首了，证据全部对的上。知道真相的汤川替好友不平，去找了靖子，把真相告诉了靖子。原来石神不惜为了保护靖子母女，抛尸后，不惜再杀一人，是个流浪汉，所有的案情都是跟流浪汉有关，那么靖子母女就永远是安全的。为爱牺牲至此，用情至深，超乎人性极点。 靖子得知真相的同时，老相识送上了钻戒，是愧疚的活一辈子还是去自首，靖子在犹豫，但是女儿割腕了，所幸没死。靖子决定说出实情，自首了。 感受除了感叹作者构思匪夷所思，故事精彩至极之外，就是石神的爱，是暗恋，从一开始就赌上了性命，实在伟大。所以得知真相的靖子承受不住那份巨大的压力，选择了自首。而且石神喜欢人从眼睛开始，有共鸣啊。虽然故事离我遥远，但是至情至性，感人至深，是我今年到目前为止读到的最好的故事。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"明朝那些事儿1洪武大帝","date":"2016-05-21T09:49:07.000Z","path":"2016/05/21/明朝那些事儿1洪武大帝/","text":"总评豆瓣阅读买的电子书，一共7部，总共4、50块，要是买实体书的话一定上百的，毕竟一部就20多万字。 第一部主要描写朱元璋的一生以及建文帝朱允炆那几年。我认为可以分为4个部分，第一是朱元璋与群雄相争到扫灭陈友谅及张士诚止，第二是灭掉元朝驱逐北元到蓝玉扫灭元庭止，第三是内政方面洪武四大案到朱元璋去世止，第四是靖难之战到朱允炆倒台止。作者着墨最多的是靖难之役，花了三分之一的篇幅都在讲这件事，讲的很细致。 这本书给我的感觉就是，一开始以为讲历史，结果啥都讲。也有很多人诟病的一点就是，故弄玄虚，夸大其词，不过这也是章回体小说的套路。 一、群雄相争朱元璋的发迹朱重八，安徽凤阳人，农民出身。为什么叫重八？因为祖上都没文化，只能以生日年龄等数字起名字，就是朱八八。 元末，官员腐败，汉人又地位低贱，天下大灾，爆发了韩山童、刘福通为首的农民起义。朱元璋家祸不单行，父母，大哥二哥都饿死了，朱元璋就去当打工的和尚，辗转讨饭于各地，在这期间磨练了心智。后汤和引荐他去郭子兴处参加起义军，因为能力强，郭子兴把义女马姑娘嫁给他为妻，这就是后来的马皇后。后来从郭子兴处借来兵马，在安徽江苏一带发展，占据金陵为根据地，成为一方势力。历史演进，小角色谢幕，出现了2个主要的对手。 陈友谅&amp;&amp;张士诚朱元璋前期主要是自己指挥为主，他是杰出的政治军事家，这有赖于他后来的自主学习。手下有武有徐达常遇春等名将，谋有刘基，关键时刻能正确判断事情的人。 陈友谅，湖北仙桃人，渔民出身。本是小吏，为人狠毒，一步步向上爬，最后干掉主子徐寿辉，称国号汉，登基为帝，都九江，占据湖北江西一带，陈友谅不愧为枭雄。第一次攻击金陵(南京)，陈友谅水军强大，战船多，朱元璋引诱其至龙湾，使其登岸，伏兵败之。但陈友谅还是很强大，不甘失败，又进攻南昌，朱元璋的侄子朱文正也是个守城名将，陈友谅没能攻下来，朱元璋支援，双方于鄱阳湖大战,朱元璋采用火攻，大败陈友谅60万大军，陈友谅战死。 张士诚，盐贩出身，占据江苏浙江一带，守城达人，自守之贼。元军攻打高邮，张士诚硬是凭借意志力守了下来，也是个人杰。但是他不思进取，在朱元璋与陈友谅大战的时候，也不去支援陈友谅。等到陈友谅被消灭了，就轮到他了，被朱元璋围城，城破自杀。 二、对元战争灭元朝当时元朝还是很有实力，但是从南往北打，历来成功者少。而且蒙古人善战，骑兵厉害。朱元璋先从河南山东开打，凭借他卓越军事家的谋略善战的名将，逐步驱逐元朝，攻下大都。后逐步往东北西北出兵，元迁都上都，称为北元。 这一时期，只要是朱元璋制定作战计划，将领们去完成任务，类似于汉武帝时期的方式。朱元璋只坐镇都城，已经建立了明朝。 逐北元这一时期涌现了许多名将，徐达、常遇春、李文忠、冯胜、邓愈、傅友德等。元朝也有一位名将，名叫王保保，只不过他的运气不好，总有人能打败他。期间常遇春病逝，一代名将陨落。当老将渐渐死去，新人脱颖而出，最厉害的就数蓝玉，蓝玉率领15万军深入漠北，打到捕鱼儿湖(贝加尔湖)，找到元庭，俘虏元妃，王公贵族大部，成吉思汗的黄金后代也遭遇灭顶之灾。后来另一支蒙古人建立政权，就是鞑靼。蓝玉的功绩被朱元璋称赞为可以和卫青(仲卿)，李靖(药师)比肩，不可谓不伟大。 三、洪武四大案对抗制度朱元璋是个权力欲望很大的人，他希望自己建立的朝代是最好的，亲自制定了很多制度，精力旺盛，也很疯狂。 明朝初期，朝廷官员分为2派，一个是李善长代表的淮西派，另一个则是刘基代表的浙东派。李善长可以说是朱元璋的萧何，后勤部长。朱元璋对其也很器重，因为都是老乡。两派互相攻击，最后两派都覆灭了。这时候蹦出来个胡惟庸当丞相，大肆拉拢派系，但朱元璋似乎不管不问，直到时机成熟，一件小事就让胡惟庸倒台，牵连者上万人，被杀。然后朱元璋废除了丞相制度，还设立锦衣卫等特务机构，专门监察官员不法者。锦衣卫，飞鱼服，绣春刀是标配，电影绣春刀等都在讲述着这个传奇的职业。 朱元璋制定了许多约束官员的制度，给官员的俸禄又少，还面对着一个杀官员不眨眼的皇帝，所以明初当官真的是有很大风险的，可谓是朝不保夕，即使你没有犯法。 空印案是官员钻法律的漏洞，郭桓案是腐败，蓝玉案着实是蓝玉自己作死，蓝玉有性格缺陷，打仗很吊，做大官不会做，最出名的就是他奸淫投降俘虏的元妃，人品有问题。后来又因为别的事惹恼了朱元璋，以谋反罪处死，牵连甚广。 为了子孙万代朱元璋杀那么多人，很多错杀冤杀。这与其自身成长经历有关系，他从要饭的变成皇帝，这期间，他的心越来越硬。他希望自己的后代不要像他那样受那么多苦，为子孙剪除了一大批可能有威胁的臣子。建立了他认为完美的制度，认为这样他的子孙后代只要他制定照着制度走，就能千秋万达，历史证明，这多么不现实啊。 四、靖难之战朱标与朱允炆朱元璋的儿子除了太子朱标，都被封为亲王，拥有军队，用以危难时勤王。朱标，为人宽厚，为朱元璋喜爱，被封为太子，但是死得早。由于朱元璋对朱标的深爱，便立朱标的儿子朱允炆为继承人。朱允炆也是个饱读诗书，宽厚的人。朱元璋怕自己走了，朱允炆镇不住那些有能力的大臣或者亲王，给他留了几个人。方孝孺，忠义的文臣。齐泰，不出错的出色官员。黄子澄，朱允炆的伴读。朱允炆早就意识到朱棣不会安分。 靖难朱允炆一上台就搞他的其他的几个叔叔，或者关起来，或者流放，但就是不杀死，妇人之仁。朱棣也警觉了，暗中打造兵器，装疯。等到时机成熟了，遂起兵，占据北平。本来朱棣一个亲王，十几万兵，不可能成什么气候。但是怪就怪在朱允炆和朱棣能力不是一个层级的。 首先去打朱棣的是耿炳文，这是个守将，不会攻啊。带了30万人，败。但是朝廷兵多啊，第二波，李景隆，李文忠之子，但这是个军事白痴啊，带了60万人，又败。这一战也有沙尘暴的原因，让朱棣抓住了时机，天要朱棣胜。之后，朱棣进攻，打济南，这个时候，有人站了出来，铁炫、盛庸、平安这些人，有的是小吏，有的是低职军官，但他们守住了济南。战争进入拉锯阶段。 朱允炆任命盛庸为新的总帅，进攻朱棣。此战朱棣大败，大将朱玉战死。但是因为朱允炆的不杀朱棣的约束，混战中所有人都不敢把火器朝朱棣身上招呼，这也是朱棣与朱允炆的等级差别的体现。之后又一次发生了沙尘暴，朱棣又打败了盛庸。 姚广孝，和尚，道士，阴阳家。本来已经是个老人了，但觉得一生空有抱负无处施展，又考不过科举，就到了朱棣的身边，劝说朱棣造反。这一次他劝说朱棣绕道直取京城，于是朱棣又出发了，不打济南了，走徐州、宿州、灵璧、直到南京。这个时候，那个李景隆又出来了，作为朱棣的内应来打开城门了，这个间谍埋得好深啊。朱允炆烧城失踪，一批忠臣被朱棣残杀。 朱棣，历时四年，燕贼篡位。归因于他的坚韧，朱允炆的等级太低。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记02【无题】","date":"2016-05-18T14:36:01.000Z","path":"2016/05/18/日记02【无题】/","text":"烦心事本来只是看到一篇讲给博客插入音乐的博客，想实践一下，顺便测试一下。遇到了一些烦心事，工作上也有点不愉快，这两天回去之后，一般就是睡觉。 从小的来，我妈最近工作中扭到腰了，还挺严重。突然意识到我才从学校出来，父母身体却不好了，努力的速度完全赶不上他们衰老的速度啊。最近看到一句话，读得好不如长得好，长得好不如生得好。 本来很早就能下班的，可是一个同事请假了，另一个同事跑得比我还快。版本要发布了，我只能留下解决可能出现的问题。还真有，就是那个跑得早的同事的问题。这还不是关键，加班也就罢了，好基友在等我下班啊，最后我就请他吃了饭啊。 我陷入困境了这两天，浑浑噩噩，上班埋头敲代码，下班看点书睡觉。大雨衬托着此时的心情。又疯狂买了4本书，一个月买4本，这个月买6本了。 新东西试试插入音乐的功能","tags":[{"name":"日记","slug":"日记","permalink":"https://amasawaseiji.github.io/tags/日记/"}]},{"title":"游无锡","date":"2016-05-15T15:42:25.000Z","path":"2016/05/15/游无锡/","text":"游与行在我的词典中，旅游分为2种。 一是旅游，一堆人，特别热闹，到什么景区。这是规范化的旅游，要收钱。很多时候没什么大意思。一般目的地是人工开发大于自然美景。 二是旅行，可以一个人或者几个人，野游。随便到什么地方，有的时候比规范化的旅游看点更多，更美。一般目的地是自然风景。 旅游地又分为2种，但是我现在认为可以有3种。 自然风景，人为装饰较少，如一些山。本身足够雄奇，不需要人工雕饰。 人文风景，一般以建筑为主。由于现在很少有历史遗迹（很多那些所谓的遗迹都是后人还原仿建的），这类看点不大，也没什么意思。 影视基地，背靠自然风景的影视基地。中国影视发展了几十年，这群基地是仿的里面最出类拔萃的。影视也可以怀旧啊，还是有一些精品的。 无锡早上出发，车上老板陈词，做活动，新人介绍。我也挺悲催的，惩罚环节怎么少的了我(郁闷脸)。3个小时的车程，中午都是硬菜。到了无锡，导游就上来了，名叫侯希希，笑声很有特点。无锡缘何称无锡，锡山有锡，锡锻造青铜器的材料，兵家必争锡山。王翦除锡山，无锡（导游说的）。还说了，吴的祖先，阖闾，夫差，勾践，吴越，范蠡，西施，还好我都懂。 鼋(元)头渚很烂的地方，坐大船去到一个岛上，岛上全都是近些年旅游开发的东西。且人满为患。 仙岛 岛上的水 城 下了岛，还有 包孕吴越 拔河游览完毕，公司的体育竞技，选在一个草坪上，我们组第一场第一轮晋级，第二轮败退。第二场，训练的很好，有个隐患没人注意，比赛时绑带脱落。out出局。值得一提的是决出总冠军的拔河比赛。之前一直没了解过拔河有什么技巧。原来有种姿势是全体正向拔河向后倒，利用草坪的摩擦力不大，着力点放宽，他们组轻松取得胜利。反观另一组，全部侧身姿势，爆发力是强，一点对面顶住5秒钟，胜负已定。如果不是草坪是水泥地效果就没有这么好了。 晚宴还好可以不用喝太多酒，一群人出去逛了下夜晚的无锡。没有杭州的脚步匆匆，这是一个地广人少的地方，适合生活。夜静很美丽。 酒店2人一间，4星级，400多一天，可以了。 三国城刚进去嗤之以鼻，不就是人工造的吗，没啥意思。直到看三英战吕布的表扬，马术可以的，背景音乐也是老三国的，有刘欢的这一拜 还有 貂蝉已随清风去等。谁让我看过老三国呢，还不止一遍。忍不住发了个朋友圈，像我这种从不发朋友圈的也没忍住，虽然后来删除了。 三英战吕布 看完，天公不作美，下起了雨，撑伞呗。途中我们的导游秀逗了一把，他说刘备去山东诸葛亮老家三顾毛驴，看来他水平太次了。但是路上还有个其他的导游，倒是水平不低。为什么呢？他说，有三个人在对待汉朝皇帝这件事上犯了成本高，效率低的致命错误。他们分别是，董卓，袁绍，袁术。卧槽！一听这个，我觉得他肯定看过易中天的，这是易中天讲的呀。水平可以的。到了水边，本次旅游最最壮阔的地方、最最美的地方。一张图说明一切。 壮阔的水边 当时风大，浪起，很有fell。为什么打动我？背靠太湖，这里自然风景已经大过了人文建筑。 之后去吴王宫，水浒城，就再也没有这样令人神往的地方了。 吴王宫","tags":[{"name":"游记","slug":"游记","permalink":"https://amasawaseiji.github.io/tags/游记/"}]},{"title":"岛上书店","date":"2016-05-15T13:52:27.000Z","path":"2016/05/15/岛上书店/","text":"封面 每个人的生命中，都有最艰难的那一年，将人生变得美好而辽阔 句子 无人为孤岛，一书一世界 独自生活的难处，在于不管弄出什么样的烂摊子，都不得不自己清理 没有人会漫无目的地旅行，那些迷路者是希望迷路 好的婚姻，至少有一部分是阴谋 婚礼就是这样，会让人感觉孤独的要命 一个地方如果没有一家书店，就算不上个地方了。 主题 因为从心底害怕自己不值得被爱，我们独来独往。然而就是因为独来独往，才让我们以为自己不值得被爱。有一天，你不知道是什么时候，你会驱车上路。有一天，你不知道是什么什么时候，你会遇到他(她)。你会被爱，因为你今生第一次真正不再孤单。你会选择不再孤单下去。 –A.J.与艾米婚礼 迟暮花开 关于一本畅销小说，美国人所写。故事时间跨度还是有些长，所以人生阅历尚浅的我很难get到共鸣。就像那个电影，one day，主要是虐，但是那种时间的流逝，命运的无常，很让人唏嘘。 再扯另一个话题，看书。之前我看书，都是过一遍，图一个爽，不会去想任何东西，那叫浅阅读。现在知道了看书是要思考的，所谓学而不思则罔。看一个小时，思考2个小时，作者为什么怎么写？作者想通过这些表达什么？虽然我还get不到这种阅读技能，也时间有限不能想那么久，毕竟不是去研究什么东西。但现在已经开始思考了，这也算是进步，至少会想一下，看完了，我从中学到了什么。 那，这本书，我又学到了什么？除了低谷中的坚持，无出其右啊，关键是get不到啊，没有共鸣。但是个不错的故事。由于不是一口气读完，中间还穿插了去旅游，前面的有些都记不清楚了。只能试着去回忆了。 主人公是一家在爱丽丝岛的书店的老板。名字叫A.J.费克里（我总是读成费里克（尴尬））。故事开头，女主角给小岛书店推荐书目，遭到了A.J.的冷遇。女主角名叫阿米莉亚（朋友会喊她艾米），是出版社的销售代表。冷遇？这是因为A.J.妻子妮可去世了，他在低谷中。A.J.整日买醉，书店情况越来越糟。人在低谷中，总是要有重重一击，才会清醒过来。A.J.的一本价值几十万的书被偷了，那是他最值钱的东西。警长兰比亚斯在A.J.最低谷的时候给予他类似于陌生人的关怀。 A.J.重拾跑步，打算重新开始，也跟兰比亚斯成了朋友。一天，他去跑步回来发现，家中多了一个女婴，附带一则留书，玛雅的妈妈说自己实在无路可走了，第二天，玛雅的妈妈就跳河自杀了。（这里埋了个伏笔，为什么玛雅妈妈一个外地人，人生的最后选择了爱丽丝岛？）A.J.竟然渐渐与玛雅产生了感情，决定收养玛雅。一个单身汉收养一个女婴，听起来不可思议。A.J.是个痴迷于读书的人，尤其喜欢短篇。这样一对父女开始新的生活，且越来越好。 一天玛雅出水痘，A.J.很焦虑，抓到手边一本书开始读，这本书叫迟暮花开，讲述作者自己单身一辈子，78岁娶了位妻子，妻子比他还大，2年后妻子去世，这样一个悲伤地故事。A.J.发现这本书是阿米莉亚推荐给他的，他还有印象，他想找到这个跟他有共同阅读品味的人交流一下。于是2人从合作关系开始，慢慢开始约会。艾米的男朋友是个军人，艾米跟他并没有共同语言。A.J.带着玛雅以及兰比亚斯以去某公园为幌子，实际是他去找艾米，至此2个人确定了男女朋友关系。终于A.J.找到个机会，在请到迟暮花开作者的前提下，办了场签售会，他要在会后求婚！A.J.不会当众求婚，那样做会类似于强迫，他更尊重艾米。会后，A.J.开车送人去了，艾米得知迟暮花开竟然是别人代笔，真是令人啼笑皆非。A.J.回来后即向艾米求婚，艾米答应。并隐瞒了代笔的事，她不想2人结缘的那本书最后是个笑话。 婚礼上A.J.前妻的姐姐伊斯梅，很苦恼，走到了海里，兰比亚斯阻止了她。原来伊斯梅的丈夫丹尼尔外遇不断，而且伊斯梅流产了7次之多，一直没有孩子。丹尼尔是个作家，写的第一本书很受欢迎，所以伊斯梅一直忍受着，直到忍不了了。回去的路上，伊斯梅责问丹尼尔华莱士（玛雅的妈妈）的事情，她知道玛雅是丹尼尔跟华莱士的孩子。车停在路上，遭遇车祸，丹尼尔去世，伊斯梅受伤。 玛雅上初中了，写得一手好作文，这都是A.J.一手打造出来的，一次作文比赛，A.J.给与玛雅指导，玛雅获得第三，写的是她想象的她的妈妈死的那一天的活动。这又是一个引子，引出了之前的谜题，A.J.的收藏书被偷的谜题。 兰比亚斯跟他的妻子结婚时，只知其表不知其里，离婚了，单身很多年。一天，他跟A.J.吐露他喜欢伊斯梅。2人约会、上床。早上起来，他发现了那本被偷的书在伊斯梅那儿，但是他爱着伊斯梅，什么也没做。A.J.有时会有失语症，一天，他跑步时，晕倒了。去医院得知自己得了脑瘤，手术后也不能活多久。他犹豫着是要花一笔钱治病，还是省那笔钱给玛雅读大学，给妻子还房贷。他找到兰比亚斯，告诉他实情。兰比亚斯跟伊斯梅坦白自己知道那本书在伊斯梅那儿，在伊斯梅的话中真相终于揭开。原来华莱士找过伊斯梅，想要问丹尼尔要钱，她们过不下去了。伊斯梅要单独摆平这件事，她爱着丹尼尔。偶然看到A.J.不省人事，那本书就在桌上，她顺手拿走了。给华莱士，但华莱士用这个换不来钱。又去找伊斯梅，还给她书。然后这本书被玛雅损坏了，伊斯梅只能一直放自己那儿。书换得7万多元，手术了，之后也没活多久，去世了。艾米经营不来书店，兰比亚斯和伊斯梅接手，艾米辞去了销售代表的工作，又有新人上来，又有新故事不断发生。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"草房子","date":"2016-05-08T10:27:00.000Z","path":"2016/05/08/草房子/","text":"读书总结？读书读的是什么？读了一本书，除了跟随作者领略了主人公的心路历程，体验了一番别人的生活经历，于我留下了什么。时间一久，恐怕就什么都忘了。所以说读书不光是体验，还要总结。这才是读书的用意所在。况且听人说，就算读的书再少，也要写总结。于是这篇就是一篇总结，而且是认真读完了的总结。 草房子？都知道，儿童文学，入选中学课文的。早在我中学时，就在同桌的手里见过这本书了，并且他当时还跟我安利了，但是错过了没有读。后来也忘记是高中还是大学了，在少儿频道看过电影版。当时看的很感动的，虽然都是小朋友的戏，但是有共鸣啊。直到作者曹文轩获得国际安徒生奖，草房子又进入了我的视野，果断买了本回来看。虽然已经步入工作，看完了之后，仍然觉得感动依在。 感动依在秃鹤因为是秃子，被人嘲笑，不受人待见。但是他却在事关学校荣誉的文艺表演上，证明了自己。原来人可以不因为外表，而是因为有所担当，变成最英俊的少年。 纸月被男同学欺负，被迫转学。转学后依然有人在上学路上骚扰她，天天迟到，桑桑站了出来，桑桑为帮助纸月逃脱，跟人比试从桥上跳下去。少年为了少女甘冒艰险，什么是值得的，什么是胆略？ 桑桑成了蒋老师和白雀的信使，他也不懂为什么就愿意成为信使，并把这件事变成了他的责任，因为他的好奇导致他俩的误会，桑桑耿耿于怀，总想着弥补。后来终于桑桑说出了实情，可是时过境迁，挽回已不可能。白雀把那些信全部送给了桑桑，希望他以后可以懂得多，就误会少了。阴差阳错，不能全怪桑桑，除了要桑桑明白，也是要读者明白，大人的世界是什么样。 秦大奶奶独居校园小屋，学校赶不走。因此她和学校就结下了梁子，让人误会。却在学生落水之际，不顾年迈挺身而出，赢得了大家的尊重，也因此变成了慈祥的秦大奶奶，直到故去引得一群学生悲伤与怀念。 杜小康本是油麻地富贵人家的孩子，成绩好，总是抢了桑桑的风头，2人从竞争对手到朋友大概还是因为杜小康的心胸豁达，愿意借车给桑桑骑，也由此引发了一场大火。杜小康有担当，主动承认，而桑桑却做了缩头乌龟。桑桑因此痛恨自己，羡慕着杜小康。但是天有不测风云，杜家遭难了，货船沉船了，家道中落。杜小康上不了学，跟着父亲去放鸭，也失败了。这里应该是全篇的高潮，也是中学课文的那段。杜小康在放鸭途中，面对孤独，忽然长大了，回来后桑桑主动卖鸽子给杜小康筹钱摆小摊卖东西。杜小康的勇敢，与桑桑的友谊，荡气回肠，大有英雄惜英雄之意。 细马是邱家要来的孩子，他是外地来的，跟不上学校进度。于是辍学去放羊了，因为家里的关系，桑桑成为细马唯一的朋友。细马因为年龄稍大的原因，被邱二妈认为是来继承家产的而不是来孝敬双亲的。想赶细马走，但邱二爷对细马确是真情实意，令细马很感动。就在他被送走的时候又自己回来了。恰逢发大水，邱家被淹了，没有家产了，邱二爷病故了，细马成了家里的顶梁柱。经历了这些，细马也突然间长大了，他阻止邱二妈自寻死路，精明的做一些生意，要给邱二妈盖新房子，为人养子者做到如此，无愧于天下了。 文中最后桑桑经历了死亡的考验，原来在面临死亡之际，人性的光辉突然会变得无比耀眼，他愿意做一切为任何人。也许是上天悲悯，看到了桑桑的真情实意，给与了他免死牌。 后记正如小说扉页所说。 也许，我们谁也无法走出自己的童年······ 我也深刻领悟过童年，前段时间翻到我大学时写过的一篇报告，上面还描述了一段惊心动魄的过往。小时候，跟伙伴去桥下玩，踩着石头过河。我们撺掇其中一个第一个去，结果被水冲到下游去了，惊动了很多人，好在下游有大石头挡住了他，不然后果会很严重。这么多年我都记得，更记住了不能拿生命冒险，更不能让别人拿生命冒险。 又如小说内容提要概括的那样，少男少女之前毫无瑕疵的纯情，不幸少年与厄运相拼时的悲怆与优雅，残疾男孩对尊严的执着坚守，垂暮老人在最后一瞬所闪耀的人格光彩，在死亡体验中对生命深刻而优美的领悟，大人们之间扑朔迷离而又充满诗情画意的情感纠葛·····这一切正是一个少年正在体验或终将体验的征程。其实不光是少年，现在社会的少年体验这些的时间明显滞后了。无论何时，于个人而言，这也是一笔珍贵的财富。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"2015在上海","date":"2016-05-08T07:11:29.000Z","path":"2016/05/08/2015在上海/","text":"2015年下半年我都待在上海，从学生转向职场，颇多艰难。所见所闻，偶有所感，遂记之。 越老感悟越不同2016-01-03 生活就像强奸，既然反抗不能，那就安然接受！以前宅久了，出去到外面吵闹的地方，恨不得找个地缝钻进去不出来。觉得跟自己毫不相关，却打扰到我，真想呵呵这个世界一脸。那时候是真的抑郁，一点不与外界交流。现在反而觉得累了闷了就到那些吵闹欢快的地方去，虽然他们跟我还是一点关系没有，但她们有笑容，总是能感染到我。这之间主要的变化大概是从不闻不看到愿闻愿见。接受他们接受世界才能进一步热爱生活热爱世界。 上海初见闻2016-01-14 在上海待了几个月了，想聊一聊我眼中的上海。 刚来上海的时候也没什么了解，只觉得这是个高大上的地方，地铁都飞行于地面上，6的飞起。 后来住了一些天，发现上海原住民都会养宠物，并且喊狗狗是宝宝。对待狗都像自己儿子一样，比如会给狗擦屁股。。 还有就是这边的小吃路边摊一些门店都是泛中原籍人民经营的。操着一口中原官话，我听着都很熟悉。也不是上海，大江南北到处都有，毕竟赶上改革开放，中原人口庞大就都往东南方向谋生去了。就跟你在珠三角感觉云贵川湘人多一样。 后来领略到上海房价之贵，郊区也都200多w，感觉把自己一辈子都卖给上海也怕是难买套房住下来。 物价还好，住也不是很夸张。之前看到一朋友转载的一文章，说在上海，月薪8k勉强自给自足，我感觉也没有说的那么夸张。 听人说北京这地方工作区跟生活区挤在两大坨，然后每天大家都往一个方向去上班，又同一个方向下班。所以地铁特拥堵。上海倒是还好，因为工作区是呈星射线型向四周扩散，除了市中心哪一环比较挤，其他地方还好的。 就说我去过的几个区吧，首先浦东这地方真的是有点人少，除了一些大型的工作园区，更多看到的是宽阔的马路，爽朗的天空。仿佛远方的大海就在不远处一样。说到工作园区，那真的是一个挺让人向往的地方，因为这是一个成熟的生活园区。你在这上班，我有丰富的餐饮大楼，娱乐放松大楼，保证你不会枯燥。 往南到闵行奉贤过，那边儿主要的感受就是人多，主要的居民区居住区挺多，但是那边美女也蛮多的，哈哈。 市中心以及浦东的高科技公司较多，但是市中心也是参差不齐，也有破烂的小作坊，也有高大上的甲级写字楼。总之浦东是一个可以向往的地方。 地铁非常发达，基本上你要去的地方90%都是用不着在做公交车的。就说有的时候你要转个线，经常直线下降几十米都很正常。不知道在重庆的朋友会不会打我。 再有就是公交，有的郊区蛮乱的说，不是自动售票。浦东的就很好，会用三种语言播报，普通话，上海话，英语都来。我还学会了说谢谢，上海话说听起来和“下压”差不多。哈哈 还有就是嘉定，那地方，空旷风大，人流多，吃的地方少。就不要去喝西北风了哈 雁栖之地-江湾新城2016-01-15 也许以后少有机会写东西了。行万里路，读万卷书。所见所闻，群像百态，皆可成文。 昨天去了江湾新城，发觉虽然浦东空旷和大气，江湾这地方一点不输。江湾是孤傲中掺杂些许自然。 我有说行走在江湾的大路上，想起来九峰山骑行的豪情。九峰山真的有九座山丘，在金华，九峰山还有水上乐园，是个生态旅游景点。当年去九峰山一路上人烟稀少，只有一条孤寂的道路绵绵不绝，望不到尽头。路上草丛中偶尔还会出现坟茔。浙江地区有种特色，往往在路边会见到墓碑和一些供奉拜祭的器具，或者还会有残留的香线，你这也是我当年夜间骑行所忌惮的东西。放哪儿不好，把墓碑竖在路边这样真的好吗？ 在去园区之前，遇一溪流。这并不足奇，吸引眼球的是岸边垂钓者众多，细下心来去数钓竿，两边栏杆加在一起足足有20有余竿。这种地方，高楼林立，水那么黑，会有鱼？还真的有，我观察他们放鱼的水袋子中大鱼小鱼全有，真是个宝地。鱼儿游得过来，说明生态还没有破坏。凭栏望去，什么！还有鸭子水中游，河边草丛深，申延入河中，鸭子的身影渐渐隐没其后。驻足又有片刻，成双的白鸥从我头顶飞过，目光追随它们身影，触到斜射过来的阳光，乃止。 有如此景色，传说中的湾谷科技园又如何呢。大，非常之大，大到我不知道它会有多大。a但是由于刚刚开发完毕，很多大楼没有入驻的公司，空空如也。但是这不要紧，交通方便啊，虽然没有直达的地铁。但是园区自己有公车啊，只会往返两个站点，从附近的地铁站到园区只要10分钟。我是已经心向往之了。 今天也去了个地方，有可说道之处。徐家汇常熟路附近几条街大概是老外的生活圈子吧，走在路上一半都是歪果仁。还有一对歪果仁哥们骑三轮车卖鞋子，丰富了我的眼球啊。 最近读了个历史推理文集，三国谜案，颇有新意。除了一些悬案诸如邓艾昭雪之难、司马断嗣、东吴二宫并阙、血衣带诏、李严废黜通过史家隐笔给出合理推测，历史是任人打扮的女孩。关键是洛神密码的推理真有让人讶异的地方。洛神密码的主角不是甄宓不是曹植也不是曹丕，而是曹彰！作者甚至推测出曹睿是曹彰跟甄宓的儿子！曹植的洛神赋写的是曹彰！真的新颖地值得一看。 转眼还有三周就过年了，以后也少有机会读一些杂谈之类的东西了，岁岁少，岁岁少！","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]},{"title":"侧耳倾听","date":"2016-05-06T15:54:04.000Z","path":"2016/05/06/侧耳倾听/","text":"世界上有两种人，一种是喜欢宫崎骏的人，另一种是不知道宫崎骏的人。 偶然翻阅别人博客，看到有讲到久石让in武道馆的演奏会，据说很震撼，于是去看了下。果然，1200人的演奏团，各种乐器眼花缭乱，据说是世界上最大的音乐会。 完了又去看了映像宫崎骏的介绍,又稍稍加深了对宫崎骏动画的认识。之前看了很多部，除了看完之后很震撼，其实是没看懂。也去翻阅豆瓣评论，试图找找这些电影都讲得什么涵义，不过一时难以体会。 侧耳倾听最早了解宫崎骏都是在各种碎片信息中，就知道有这么个动画大师，由于愚昧无知的原因，觉得动画片是不是有点low，就没有去看了。直到后来有个同学在QQ空间说看了千与千寻感动的不要不要的，才有意识的想去也看看。 再后来关注豆瓣之后，有个妹子在那讲失恋后，每次觉得坚持不下去了，就去看侧耳倾听，就会重新充满力量。我就去看了，第一次看了3遍。第一印象就是白活这么大了，要是早一点看到这个电影的话，也许没有后来的种种的幼稚。然后我就被颠覆了。 侧耳倾听讲单纯的初恋，互相的鼓励和成长。要是早点看到，就知道原来喜欢一个人可以一起成长的嘛。初中的月岛雯问她姐姐自己的前途，高中的天泽圣司是个会制作小提琴的高手，却说像我这样的水准到处都是，梦想成为工匠大师。月岛雯哭着说，你们走的太快，我跟不上。全片充满治愈，各种感动。看完之后就觉得自己通透了，有些东西想的明白了，这也是这个电影于我的意义。 宫崎骏电影一发不可收拾的继续看下去。风之谷的娜乌西卡人与自然、战争与和平。幽灵公主人与神。龙猫5岁小孩必看。哈尔的移动城堡、千与千寻10岁女孩看得，奥斯卡获奖的。天空之城经典纯音乐的出处。大概就是心灵得到了净化，祛除了很多戾气。变了，变得跟以前不一样了。当然这些电影不只是给小孩子看得，因为主人公实质上都是过得是成人生活，她们独立勇敢而又善良，努力热爱生活，能领略到的。 当厌倦了生活，感觉坚持不下去了，不妨看看宫崎骏，满满的治愈。","tags":[{"name":"动漫","slug":"动漫","permalink":"https://amasawaseiji.github.io/tags/动漫/"}]},{"title":"春秋战国：一段你应了解的历史【春秋篇】","date":"2016-05-04T15:16:32.000Z","path":"2016/05/04/春秋战国：一段你应了解的历史【春秋篇】/","text":"春秋有几霸春秋五霸有不同的说法，三种主流的说法涉及人物有八个人，读完春秋史我觉得真正名副其实只有3个人。齐桓公 晋文公 和 楚庄王。 小霸郑庄公平王东迁开始首先有所作为的是郑庄公。郑庄公是个能人，先是打败他妈喜欢的他弟弟郑段，军事外交内政用人能力都很强。以至于可以欺负卫国 宋国 等实力相当的国家。军事上发明鱼丽阵，擅长使用谋略，比如伏击等不合周朝军礼的手段。最牛逼的作为就是打败周天子的王师，对历史进程影响很大。死后子辈争位，郑国渐渐威势渐失，郑国后来沦落为二流国家。并没有称霸之实，只是使郑国成为中原诸国中最强的一国。 首霸齐桓公齐桓公吕小白确有称霸之实。而且使用的方法是尊王攘夷，使用道德感化的方式让各国心服口服，情愿尊齐国为领袖。吕小白线索里最重要的莫过于管仲，管仲是个神人各方面才能都很优秀。带领齐国改革，富国强兵。吕小白能耐不大，从他晚年不是英雄的惨死就看的出来，但是他从谏如流，恢弘的气度，不是常人可比。在位期间使齐国国土面积扩大，亲身两次北上攻打蛮夷，深入不毛，九死一生。并且把打下的蛮荒之地转手送给了当时弱小的燕国。这也是为什么燕国后来可以跻身战国七雄的重要原因。谥号桓，伟大的君主。晚年没了管仲他竟然被儿子饿死。死后诸子争位，齐国内乱，从霸主地位跌落下来，但仍然不失为一流国家。 虚名霸主宋襄公宋襄公纯熟扯淡的虚名霸主。宋襄公的偶像是齐桓公，所以就做了一个满口仁义道德的君子。只会仁义道德没有强大的国力或者过人的能力是不可能做到齐桓公那样的。打仗败给楚国，搞会盟想做老大还被楚国人抓了。他有个弟弟宋目夷倒是有点能耐的，多次在关键时刻提出正确的想法，但宋襄公一心要做君子，不采纳。所以宋国始终就是二三流的水平。 传奇霸主晋文公晋文公重耳是个传奇霸主。他老爸晋献公是个猛人，一生灭国18。重耳因为骊姬乱政的原因逃亡国外，一逃就是19年，流亡各国，受尽磨难。始终跟随他逃亡的7个人当中有后来赵国的先祖，魏国的先祖。还有寒食节纪念的人介子推。这场逃亡是个传奇，更是奇迹。后来终于在秦穆公的帮助下回国当国君。再后来在城濮之战退避三舍打败楚国，一跃成为执天下牛耳的超级大国。真正意义上的称霸。但后来晋国公族大权旁落，被六卿架空，最终分裂成三晋。重耳本人就是个牛人，人格魅力很大，才会有那么多人帮助他。重耳之后直到三家分晋晋国都是与楚国并列的超级大国。 楚庄王一鸣惊人楚庄王熊侣。楚国是蛮夷之国，所以敢称王。因为在南方的广袤土地上当时并不开化，国土面积越打越大，不遵守周礼所以随意攻灭小国。楚庄王上台之初楚国奸臣当道，所以他把自己伪装起来，伪装成一个不理朝政的昏君来看清谁是忠臣谁是奸臣。终于三年之后一鸣惊人，任用贤良打击奸臣。整肃内政。任用孙叔敖等人，在重耳死去之后与晋国的邲之战打败晋国，使楚国成为与晋国相当的超级大国。 西戎霸主秦穆公秦穆公嬴任好。嬴任好求贤若渴，用5张羊皮得到百里奚。百里奚又推荐蹇叔。秦国在西部边陲待腻歪了就想争霸中原。首先就是挡住东出之路的晋国，于是嬴任好就想通过控制晋国，好借路东出。后来才有了他护送重耳归国的事情。但是重耳不是池中之物。晋国强大了，秦国没有半点好处。后来晋秦合围郑国，就有了我们以前学过的烛之武退秦师这篇文章。再后来嬴任好打算飞夺郑国，一意孤行，1万人被翻脸的晋国在崤之战全歼。嬴任好东进不成，之好去打西戎，被周王封为西戎霸主。算不上真正的霸主。 吴王阖闾吴王阖闾吴光。吴国，一闪而逝的春秋巨星。晋国是吴国的同盟，派人教吴人中原先进的技术，让吴人骚扰楚国。吴光得到伍子胥的帮助，派遣专诸刺僚，通过政变的方式当上吴王。又有孙武的帮助富国强兵，吴光本人也勤俭节约。后来终于征集3万人打入楚国本土，柏举之战3万打20万大胜楚军，攻入楚都郢城，声震天下。楚国反扑才退兵。此后吴国修养生息，直到夫差上位打败越国，又开始北上争雄，后来黄池会盟达到可以与晋国平起平坐，但此时越国已经偷袭吴国，吴国就在此后数年灭亡。吴国虽然闪耀一时，但是却又瞬间灭亡，也算不上霸主之实。 越王勾践越王勾践。勾践早有范蠡和文种辅佐，但是越王不听劝谏，终于引来兵败被围。又因为有范蠡和文种，他才选择为吴王奴。越国只被允许有3000甲士防卫之用。勾践及范蠡都去吴宫做奴隶。忍辱负重三年，甚至去尝吴王大便，才换来夫差的信任被放回国。回国后卧薪尝胆，依靠伐吴九术，以身作则与民同苦，又靠越女剑和进献西施终于在吴王将兵在外偷袭姑苏城得手，之后奋战数年才灭亡吴国。但是勾践只是做到灭亡吴国震动天下，没有名副其实的去争霸。但他的传奇经历也足以是他成为春秋时代的巨星之一。","tags":[{"name":"杂阅","slug":"杂阅","permalink":"https://amasawaseiji.github.io/tags/杂阅/"}]},{"title":"日记01【青年节】","date":"2016-05-04T13:30:07.000Z","path":"2016/05/04/日记01【青年节】/","text":"央视新闻说青年节放半天假，14-28周岁都放假，不过跟我们没有关系。51回来之后事情好多，有点忙不过来。在淘宝淘了些东西，都是从知乎上看来的。 淘宝购物清单 桌上书架 很笨重，益乐新村快递站点真是少，就几个通，韵达，天天等有站点。他们给我用的宅急送，真是醉了。然后送到公司，拖回来感觉手臂都不是我的了，十几公斤重啊！ 鞋架 现在淘宝卖的都是有遮尘布的,挺好的。 脏衣袋 实用 台灯 省电护眼用的，当初来住的时候，匆忙就决定了，桌子不舒服，凳子不舒服。想要自己添置，空间又太小。打算等房东装修好4楼，上去住了，房子一定要大一些才行。 所思与所想书读不完，总是想着买书。比如重新学C语言,再看看算法。又想着要看一下数据科学与Python,还想买一些闲书看看。现在真是后悔大学那么好的时光没有做点有意义的事情，最起码读点书唉。","tags":[{"name":"小事","slug":"小事","permalink":"https://amasawaseiji.github.io/tags/小事/"}]}]